{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "001": 6,
      "011": 7,
      "1001": 8,
      "10000": 9,
      "0000": 10,
      "0100": 11,
      "001100": 12,
      "0011": 13,
      "10011": 14,
      "00110000": 15,
      "010": 16,
      "00100": 17,
      "0010000": 18,
      "01100": 19,
      "00011": 20,
      "100110": 21,
      "00001100": 22,
      "000011000": 23,
      "000": 24,
      "0011000100": 25,
      "00110000011": 26,
      "00100011": 27,
      "000100": 28,
      "0011100": 29,
      "100001": 30,
      "01011": 31,
      "1100": 32,
      "0110": 33,
      "00110000001": 34,
      "001000001100": 35,
      "1000010": 36,
      "010000": 37,
      "10100": 38,
      "000010000": 39,
      "0010000100": 40,
      "10": 41,
      "011001": 42,
      "00000011": 43,
      "000110": 44,
      "10100011": 45,
      "00010": 46,
      "1000100": 47,
      "01100110": 48,
      "01110": 49,
      "10000011": 50,
      "000000": 51,
      "0000010": 52,
      "0011000110": 53,
      "100111001": 54,
      "01001": 55,
      "001011": 56,
      "0000100111001": 57,
      "001000011100": 58,
      "001000111100": 59,
      "00111000011": 60,
      "1100010": 61,
      "101": 62,
      "110000": 63,
      "00011001": 64,
      "1000": 65,
      "100100": 66,
      "1000110": 67,
      "100011001": 68,
      "0110011": 69,
      "00101011": 70,
      "10000010": 71,
      "00001001": 72,
      "000000011": 73,
      "00000011100": 74,
      "0000100011001": 75,
      "01000": 76,
      "00111": 77,
      "01100100": 78,
      "000111000": 79,
      "01000010000010": 80,
      "00000011100110": 81,
      "0000000111001": 82,
      "00000011100100": 83,
      "11": 84,
      "1100110": 85,
      "110100": 86,
      "110000011": 87,
      "00001": 88,
      "001001": 89,
      "000011100": 90,
      "100010": 91,
      "10001001": 92,
      "0110000": 93,
      "01010": 94,
      "0101100": 95,
      "0101011": 96,
      "00101": 97,
      "0011001": 98,
      "00110011": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "1"
      ],
      [
        "01",
        "1"
      ],
      [
        "100",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "00",
        "00"
      ],
      [
        "0",
        "100"
      ],
      [
        "001",
        "100"
      ],
      [
        "001",
        "1"
      ],
      [
        "1001",
        "1"
      ],
      [
        "001",
        "10000"
      ],
      [
        "01",
        "0"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "10000"
      ],
      [
        "01",
        "100"
      ],
      [
        "00",
        "011"
      ],
      [
        "10011",
        "0"
      ],
      [
        "00",
        "001100"
      ],
      [
        "00001100",
        "0"
      ],
      [
        "00",
        "0"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "00110000",
        "011"
      ],
      [
        "00100",
        "011"
      ],
      [
        "00",
        "0100"
      ],
      [
        "0011",
        "100"
      ],
      [
        "100",
        "001"
      ],
      [
        "01",
        "011"
      ],
      [
        "1",
        "100"
      ],
      [
        "011",
        "0"
      ],
      [
        "00110000",
        "001"
      ],
      [
        "0010000",
        "01100"
      ],
      [
        "100001",
        "0"
      ],
      [
        "0",
        "10000"
      ],
      [
        "1",
        "0100"
      ],
      [
        "0000",
        "10000"
      ],
      [
        "0010000",
        "100"
      ],
      [
        "1",
        "0"
      ],
      [
        "01",
        "1001"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "00011",
        "0"
      ],
      [
        "10100",
        "011"
      ],
      [
        "00",
        "010"
      ],
      [
        "100",
        "0100"
      ],
      [
        "01",
        "100110"
      ],
      [
        "011",
        "10"
      ],
      [
        "10000",
        "011"
      ],
      [
        "0000",
        "00"
      ],
      [
        "0000",
        "010"
      ],
      [
        "001100",
        "0110"
      ],
      [
        "10011",
        "1001"
      ],
      [
        "0",
        "1001"
      ],
      [
        "001",
        "011"
      ],
      [
        "0000",
        "100111001"
      ],
      [
        "00100",
        "0011100"
      ],
      [
        "00100011",
        "1100"
      ],
      [
        "0011100",
        "0011"
      ],
      [
        "1100",
        "010"
      ],
      [
        "1",
        "01"
      ],
      [
        "1",
        "10000"
      ],
      [
        "00",
        "011001"
      ],
      [
        "100",
        "0"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "0110"
      ],
      [
        "100",
        "011001"
      ],
      [
        "01",
        "10011"
      ],
      [
        "001",
        "01011"
      ],
      [
        "10000",
        "010"
      ],
      [
        "0000",
        "1001"
      ],
      [
        "0000",
        "00011"
      ],
      [
        "0000",
        "0011100"
      ],
      [
        "0000",
        "100011001"
      ],
      [
        "0100",
        "0"
      ],
      [
        "0011",
        "1"
      ],
      [
        "01100",
        "100"
      ],
      [
        "00011",
        "1000"
      ],
      [
        "010000",
        "10000010"
      ],
      [
        "00000011",
        "100110"
      ],
      [
        "000000011",
        "1001"
      ],
      [
        "00000011100",
        "100"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "100110"
      ],
      [
        "1",
        "10100"
      ],
      [
        "1",
        "10000011"
      ],
      [
        "00",
        "001"
      ],
      [
        "00",
        "1001"
      ],
      [
        "00",
        "0011100"
      ],
      [
        "100",
        "010"
      ],
      [
        "100",
        "01001"
      ],
      [
        "01",
        "10000"
      ],
      [
        "01",
        "010"
      ],
      [
        "01",
        "01100"
      ],
      [
        "01",
        "01011"
      ],
      [
        "001",
        "01"
      ],
      [
        "001",
        "1001"
      ],
      [
        "001",
        "10011"
      ]
    ]
  }
}