{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "0000": 6,
      "1000": 7,
      "000": 8,
      "10": 9,
      "1100": 10,
      "100000": 11,
      "1000000": 12,
      "100011": 13,
      "110": 14,
      "000000": 15,
      "00010": 16,
      "10000": 17,
      "111": 18,
      "100010": 19,
      "00000": 20,
      "000000100": 21,
      "100001": 22,
      "0000001001000": 23,
      "011": 24,
      "1100000": 25,
      "100011110": 26,
      "111100": 27,
      "1000100": 28,
      "101": 29,
      "101000": 30,
      "11000000": 31,
      "10000011": 32,
      "100000100011": 33,
      "001100": 34,
      "0001": 35,
      "10000001": 36,
      "00000011": 37,
      "110000001": 38,
      "01": 39,
      "0011": 40,
      "10010": 41,
      "000000000": 42,
      "101000000": 43,
      "11001000": 44,
      "0000000001000": 45,
      "0100011": 46,
      "0110000001": 47,
      "10010000001": 48,
      "11100011": 49,
      "00011": 50,
      "10100011": 51,
      "110000": 52,
      "10000001100000": 53,
      "100011111": 54,
      "1101": 55,
      "1101000": 56,
      "100010110": 57,
      "0000011001000": 58,
      "011100": 59,
      "10000011100000": 60,
      "01000111": 61,
      "11100011100000": 62,
      "010": 63,
      "001": 64,
      "001000": 65,
      "111000000": 66,
      "11101000": 67,
      "00000001": 68,
      "000100": 69,
      "101100": 70,
      "10100000": 71,
      "10110": 72,
      "10100001": 73,
      "10110000001": 74,
      "1100100": 75,
      "110011": 76,
      "110010110": 77,
      "1000001": 78,
      "100000100010": 79,
      "100000100001": 80,
      "10000000001": 81,
      "10000000011": 82,
      "10000001101000": 83,
      "1101100": 84,
      "10000111": 85,
      "10000101": 86,
      "100010100011": 87,
      "100010111": 88,
      "0111000000": 89,
      "0111000001": 90,
      "10010100001": 91,
      "10100000001": 92,
      "01100": 93,
      "0100000": 94,
      "0110": 95,
      "0100010": 96,
      "0101000000": 97,
      "00100": 98,
      "00101": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "0"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "100",
        "000"
      ],
      [
        "100",
        "0000"
      ],
      [
        "1000",
        "11"
      ],
      [
        "11",
        "0"
      ],
      [
        "0000",
        "00"
      ],
      [
        "000",
        "10"
      ],
      [
        "100",
        "00"
      ],
      [
        "11",
        "1"
      ],
      [
        "1000",
        "10"
      ],
      [
        "0000",
        "0"
      ],
      [
        "000000",
        "100"
      ],
      [
        "10000",
        "1"
      ],
      [
        "000000100",
        "1000"
      ],
      [
        "0",
        "11"
      ],
      [
        "1100",
        "000"
      ],
      [
        "100011",
        "110"
      ],
      [
        "11",
        "1100"
      ],
      [
        "1000",
        "100"
      ],
      [
        "10",
        "1"
      ],
      [
        "10",
        "1000"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "100000",
        "11"
      ],
      [
        "100000",
        "100011"
      ],
      [
        "00",
        "1100"
      ],
      [
        "000",
        "1"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "000000",
        "11"
      ],
      [
        "11000000",
        "1"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "11"
      ],
      [
        "100",
        "10"
      ],
      [
        "0000",
        "00000"
      ],
      [
        "10",
        "1000000"
      ],
      [
        "1100",
        "1000"
      ],
      [
        "000000000",
        "1000"
      ],
      [
        "0",
        "100011"
      ],
      [
        "0",
        "110000001"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "11",
        "100011"
      ],
      [
        "000",
        "11"
      ],
      [
        "10",
        "100011"
      ],
      [
        "1100",
        "00"
      ],
      [
        "1000000",
        "1100000"
      ],
      [
        "100011",
        "111"
      ],
      [
        "110",
        "1"
      ],
      [
        "110",
        "1000"
      ],
      [
        "100010",
        "110"
      ],
      [
        "00000",
        "11001000"
      ],
      [
        "011",
        "100"
      ],
      [
        "10000011",
        "100000"
      ],
      [
        "0100011",
        "1"
      ],
      [
        "11100011",
        "100000"
      ],
      [
        "0",
        "10"
      ],
      [
        "00",
        "1"
      ],
      [
        "00",
        "1000"
      ],
      [
        "11",
        "1000000"
      ],
      [
        "11",
        "101000"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "000",
        "100"
      ],
      [
        "10",
        "1100"
      ],
      [
        "10",
        "100000"
      ],
      [
        "10",
        "110"
      ],
      [
        "10",
        "100001"
      ],
      [
        "10",
        "110000001"
      ],
      [
        "1100",
        "100"
      ],
      [
        "1100",
        "11"
      ],
      [
        "1100",
        "10110"
      ],
      [
        "100000",
        "1"
      ],
      [
        "100000",
        "100010"
      ],
      [
        "100000",
        "100001"
      ],
      [
        "1000000",
        "0001"
      ],
      [
        "1000000",
        "0011"
      ],
      [
        "1000000",
        "1101000"
      ],
      [
        "110",
        "1100"
      ],
      [
        "10000",
        "111"
      ],
      [
        "10000",
        "101"
      ],
      [
        "100010",
        "100011"
      ],
      [
        "100010",
        "111"
      ],
      [
        "011",
        "1000000"
      ],
      [
        "011",
        "1000001"
      ],
      [
        "10010",
        "100001"
      ],
      [
        "101000000",
        "01"
      ],
      [
        "0",
        "1100"
      ],
      [
        "0",
        "100000"
      ],
      [
        "0",
        "110"
      ],
      [
        "0",
        "100010"
      ],
      [
        "0",
        "101000000"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "101"
      ]
    ]
  }
}