{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      ".": 1,
      "0": 2,
      "1": 3,
      "2": 4,
      "3": 5,
      "4": 6,
      "5": 7,
      "6": 8,
      "8": 9,
      "9": 10,
      ".,": 11,
      "14": 12,
      "12": 13,
      "10": 14,
      "11": 15
    },
    "merges": [
      [
        ".",
        ","
      ],
      [
        "1",
        "4"
      ],
      [
        "1",
        "2"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "1"
      ]
    ]
  }
}