{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "001": 6,
      "011": 7,
      "0000": 8,
      "1001": 9,
      "010": 10,
      "10000": 11,
      "0011": 12,
      "01100": 13,
      "0100": 14,
      "001100": 15,
      "0001": 16,
      "00100": 17,
      "11": 18,
      "00110000": 19,
      "0110": 20,
      "00000011": 21,
      "0010": 22,
      "0000100": 23,
      "01001": 24,
      "00010": 25,
      "100010": 26,
      "000": 27,
      "00011": 28,
      "0010000": 29,
      "01011": 30,
      "01010": 31,
      "0000010": 32,
      "0011100": 33,
      "0011000100": 34,
      "0011000110": 35,
      "001000000100": 36,
      "00001100": 37,
      "00110000001": 38,
      "00110000011": 39,
      "001000001100": 40,
      "000011000": 41,
      "1011": 42,
      "000010": 43,
      "1000000": 44,
      "10000011": 45,
      "01100100": 46,
      "00011001": 47,
      "10": 48,
      "1100": 49,
      "101100": 50,
      "010100": 51,
      "100000": 52,
      "100001001": 53,
      "00001": 54,
      "000100": 55,
      "100100": 56,
      "100011": 57,
      "1000010": 58,
      "011001": 59,
      "00001001": 60,
      "0000000": 61,
      "0100100": 62,
      "00100011": 63,
      "11001": 64,
      "000011": 65,
      "000110": 66,
      "000011100": 67,
      "1000011": 68,
      "1000100": 69,
      "10001001": 70,
      "0101100": 71,
      "0101100100": 72,
      "01011001": 73,
      "0000100001001": 74,
      "100111": 75,
      "00110100": 76,
      "01000": 77,
      "010001100100": 78,
      "0001100001001": 79,
      "00010101100100": 80,
      "001000100100": 81,
      "11010001100100": 82,
      "000111001": 83,
      "0001111": 84,
      "000111100": 85,
      "0011100100": 86,
      "00111000011": 87,
      "10111000011": 88,
      "00011001100010": 89,
      "1011000100": 90,
      "010100001": 91,
      "000011001": 92,
      "0000100111001": 93,
      "000011011": 94,
      "00110100011": 95,
      "010000011": 96,
      "101": 97,
      "101001": 98,
      "1100010": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "1"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "1"
      ],
      [
        "01",
        "0"
      ],
      [
        "100",
        "00"
      ],
      [
        "001",
        "1"
      ],
      [
        "01",
        "100"
      ],
      [
        "0",
        "100"
      ],
      [
        "001",
        "100"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "100"
      ],
      [
        "1",
        "1"
      ],
      [
        "001",
        "10000"
      ],
      [
        "011",
        "0"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "001",
        "0"
      ],
      [
        "0000",
        "100"
      ],
      [
        "0",
        "1001"
      ],
      [
        "00",
        "010"
      ],
      [
        "100",
        "010"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "011"
      ],
      [
        "00",
        "10000"
      ],
      [
        "01",
        "011"
      ],
      [
        "01",
        "010"
      ],
      [
        "0000",
        "010"
      ],
      [
        "0011",
        "100"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "001100",
        "0110"
      ],
      [
        "00100",
        "0000100"
      ],
      [
        "00",
        "001100"
      ],
      [
        "00110000",
        "001"
      ],
      [
        "00110000",
        "011"
      ],
      [
        "0010000",
        "01100"
      ],
      [
        "00001100",
        "0"
      ],
      [
        "1",
        "011"
      ],
      [
        "00",
        "0010"
      ],
      [
        "100",
        "0000"
      ],
      [
        "10000",
        "011"
      ],
      [
        "01100",
        "100"
      ],
      [
        "0001",
        "1001"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "1",
        "01100"
      ],
      [
        "010",
        "100"
      ],
      [
        "10000",
        "0"
      ],
      [
        "10000",
        "1001"
      ],
      [
        "00",
        "001"
      ],
      [
        "00",
        "0100"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "011"
      ],
      [
        "100",
        "0010"
      ],
      [
        "01",
        "1001"
      ],
      [
        "0000",
        "1001"
      ],
      [
        "0000",
        "000"
      ],
      [
        "0100",
        "100"
      ],
      [
        "00100",
        "011"
      ],
      [
        "1",
        "1001"
      ],
      [
        "00",
        "0011"
      ],
      [
        "00",
        "0110"
      ],
      [
        "00",
        "0011100"
      ],
      [
        "100",
        "0011"
      ],
      [
        "100",
        "0100"
      ],
      [
        "100",
        "01001"
      ],
      [
        "01",
        "01100"
      ],
      [
        "01",
        "01100100"
      ],
      [
        "01",
        "011001"
      ],
      [
        "0000",
        "100001001"
      ],
      [
        "1001",
        "11"
      ],
      [
        "0011",
        "0100"
      ],
      [
        "0100",
        "0"
      ],
      [
        "0100",
        "01100100"
      ],
      [
        "0001",
        "100001001"
      ],
      [
        "0001",
        "0101100100"
      ],
      [
        "00100",
        "0100100"
      ],
      [
        "11",
        "010001100100"
      ],
      [
        "00011",
        "1001"
      ],
      [
        "00011",
        "11"
      ],
      [
        "00011",
        "1100"
      ],
      [
        "0011100",
        "100"
      ],
      [
        "0011100",
        "0011"
      ],
      [
        "1011",
        "1000011"
      ],
      [
        "00011001",
        "100010"
      ],
      [
        "101100",
        "0100"
      ],
      [
        "010100",
        "001"
      ],
      [
        "00001",
        "1001"
      ],
      [
        "00001001",
        "11001"
      ],
      [
        "000011",
        "011"
      ],
      [
        "00110100",
        "011"
      ],
      [
        "0",
        "10000011"
      ],
      [
        "1",
        "01"
      ],
      [
        "1",
        "01001"
      ],
      [
        "1",
        "100010"
      ]
    ]
  }
}