{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "000": 6,
      "10": 7,
      "1000": 8,
      "1100": 9,
      "0000": 10,
      "100000": 11,
      "00000": 12,
      "1011": 13,
      "00100": 14,
      "100100": 15,
      "1100000": 16,
      "110": 17,
      "00011": 18,
      "10001011": 19,
      "111": 20,
      "101": 21,
      "001": 22,
      "001000": 23,
      "100010": 24,
      "100001": 25,
      "000100": 26,
      "00010": 27,
      "100011": 28,
      "1000000": 29,
      "000000100": 30,
      "0011": 31,
      "10000000": 32,
      "11100000": 33,
      "0001": 34,
      "10100000": 35,
      "00000001": 36,
      "100010110": 37,
      "100010111": 38,
      "0000001001000": 39,
      "011": 40,
      "1110": 41,
      "000001100": 42,
      "100110": 43,
      "111100": 44,
      "1000100": 45,
      "10000011100000": 46,
      "10000010100000": 47,
      "100011111": 48,
      "10000000100000": 49,
      "0000011001000": 50,
      "001100": 51,
      "100100000": 52,
      "11100": 53,
      "10100": 54,
      "101100": 55,
      "1100100": 56,
      "00000111": 57,
      "000001110": 58,
      "00100101": 59,
      "10000001100000": 60,
      "01": 61,
      "1100010": 62,
      "0010": 63,
      "00101": 64,
      "1001000": 65,
      "1001100000": 66,
      "0001011": 67,
      "101000": 68,
      "101011": 69,
      "11000000": 70,
      "11000011": 71,
      "00000011": 72,
      "1011100": 73,
      "0010000100": 74,
      "00100111": 75,
      "100100100001": 76,
      "1101000": 77,
      "110100100000": 78,
      "100010100000": 79,
      "100010100011": 80,
      "0011100100": 81,
      "011100": 82,
      "11110000000": 83,
      "0011001100": 84,
      "10110000101": 85,
      "0000011101100": 86,
      "0100001": 87,
      "00111": 88,
      "0010100000": 89,
      "1001100": 90,
      "1111": 91,
      "11100100": 92,
      "111000000": 93,
      "1111100": 94,
      "11100010100000": 95,
      "0001000100": 96,
      "10101": 97,
      "10100001": 98,
      "10100011": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "100",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "000"
      ],
      [
        "00",
        "000"
      ],
      [
        "10",
        "11"
      ],
      [
        "00",
        "100"
      ],
      [
        "100",
        "100"
      ],
      [
        "1100",
        "000"
      ],
      [
        "11",
        "0"
      ],
      [
        "000",
        "11"
      ],
      [
        "1000",
        "1011"
      ],
      [
        "11",
        "1"
      ],
      [
        "10",
        "1"
      ],
      [
        "00",
        "1"
      ],
      [
        "00",
        "1000"
      ],
      [
        "1000",
        "10"
      ],
      [
        "100",
        "001"
      ],
      [
        "000",
        "100"
      ],
      [
        "000",
        "10"
      ],
      [
        "1000",
        "11"
      ],
      [
        "100",
        "0000"
      ],
      [
        "0000",
        "00100"
      ],
      [
        "00",
        "11"
      ],
      [
        "100",
        "00000"
      ],
      [
        "11",
        "100000"
      ],
      [
        "000",
        "1"
      ],
      [
        "10",
        "100000"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "10001011",
        "0"
      ],
      [
        "10001011",
        "1"
      ],
      [
        "000000100",
        "1000"
      ],
      [
        "0",
        "11"
      ],
      [
        "11",
        "10"
      ],
      [
        "00000",
        "1100"
      ],
      [
        "100",
        "110"
      ],
      [
        "11",
        "1100"
      ],
      [
        "1000",
        "100"
      ],
      [
        "100000",
        "11100000"
      ],
      [
        "100000",
        "10100000"
      ],
      [
        "100011",
        "111"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "000001100",
        "1000"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "100000"
      ],
      [
        "11",
        "100"
      ],
      [
        "10",
        "100"
      ],
      [
        "10",
        "1100"
      ],
      [
        "1100",
        "100"
      ],
      [
        "00000",
        "111"
      ],
      [
        "00000",
        "1110"
      ],
      [
        "00100",
        "101"
      ],
      [
        "1000000",
        "1100000"
      ],
      [
        "0",
        "1"
      ],
      [
        "1",
        "100010"
      ],
      [
        "00",
        "10"
      ],
      [
        "00",
        "101"
      ],
      [
        "100",
        "1000"
      ],
      [
        "100",
        "1100000"
      ],
      [
        "000",
        "1011"
      ],
      [
        "10",
        "1000"
      ],
      [
        "10",
        "1011"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "1100",
        "0011"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "1011",
        "100"
      ],
      [
        "00100",
        "00100"
      ],
      [
        "00100",
        "111"
      ],
      [
        "100100",
        "100001"
      ],
      [
        "110",
        "1000"
      ],
      [
        "110",
        "100100000"
      ],
      [
        "100010",
        "100000"
      ],
      [
        "100010",
        "100011"
      ],
      [
        "0011",
        "100100"
      ],
      [
        "011",
        "100"
      ],
      [
        "111100",
        "00000"
      ],
      [
        "001100",
        "1100"
      ],
      [
        "101100",
        "00101"
      ],
      [
        "000001110",
        "1100"
      ],
      [
        "0",
        "100001"
      ],
      [
        "00",
        "111"
      ],
      [
        "00",
        "10100000"
      ],
      [
        "100",
        "1100"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "100100"
      ],
      [
        "11",
        "1000000"
      ],
      [
        "11",
        "11100"
      ],
      [
        "11",
        "100010100000"
      ],
      [
        "000",
        "1000100"
      ],
      [
        "10",
        "101"
      ],
      [
        "10",
        "100001"
      ],
      [
        "10",
        "100011"
      ]
    ]
  }
}