{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "11": 7,
      "1100": 8,
      "0100": 9,
      "0001": 10,
      "1000000": 11,
      "101": 12,
      "000": 13,
      "0111": 14,
      "1000": 15,
      "00010": 16,
      "001": 17,
      "000100": 18,
      "00011": 19,
      "10001": 20,
      "0011": 21,
      "010001": 22,
      "1001100": 23,
      "1000111": 24,
      "11000000": 25,
      "000001": 26,
      "10000001": 27,
      "001100": 28,
      "10100": 29,
      "0010": 30,
      "100011111": 31,
      "10": 32,
      "00000001": 33,
      "111100": 34,
      "11000011": 35,
      "0100000": 36,
      "10101": 37,
      "0100010": 38,
      "00101": 39,
      "1000100": 40,
      "10000011": 41,
      "1110001": 42,
      "01000001": 43,
      "000101": 44,
      "10000000011": 45,
      "100010111": 46,
      "001000": 47,
      "1000001": 48,
      "100000": 49,
      "100001100": 50,
      "10000101": 51,
      "011100": 52,
      "0110000001": 53,
      "00001": 54,
      "0000000": 55,
      "00000111": 56,
      "10000000": 57,
      "10000000001": 58,
      "10000000100000": 59,
      "100000000001": 60,
      "1011100": 61,
      "01000101": 62,
      "10011001000": 63,
      "101010111": 64,
      "0001011001100": 65,
      "10011": 66,
      "10010000001": 67,
      "1000010": 68,
      "0111000000": 69,
      "0110": 70,
      "110": 71,
      "1111000000": 72,
      "1101000101": 73,
      "1110011001000": 74,
      "11110": 75,
      "1100001": 76,
      "110010000011": 77,
      "01000000": 78,
      "0100001": 79,
      "10000000100010": 80,
      "1010": 81,
      "1010111": 82,
      "10110000000": 83,
      "100010": 84,
      "0100011": 85,
      "100011110": 86,
      "110000000010": 87,
      "00000101": 88,
      "0000011001100": 89,
      "0011001100": 90,
      "10100001": 91,
      "10100000001": 92,
      "11000011100000": 93,
      "101010110": 94,
      "1000011001010": 95,
      "10100010": 96,
      "00100": 97,
      "0010000001": 98,
      "0010000011": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "100"
      ],
      [
        "0",
        "100"
      ],
      [
        "00",
        "01"
      ],
      [
        "100",
        "0000"
      ],
      [
        "1",
        "01"
      ],
      [
        "00",
        "0"
      ],
      [
        "01",
        "11"
      ],
      [
        "100",
        "0"
      ],
      [
        "0001",
        "0"
      ],
      [
        "00",
        "1"
      ],
      [
        "00",
        "0100"
      ],
      [
        "0001",
        "1"
      ],
      [
        "100",
        "01"
      ],
      [
        "00",
        "11"
      ],
      [
        "0100",
        "01"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "0111"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "0000",
        "01"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "00",
        "1100"
      ],
      [
        "1",
        "0100"
      ],
      [
        "001",
        "0"
      ],
      [
        "1000111",
        "11"
      ],
      [
        "1",
        "0"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "11",
        "1100"
      ],
      [
        "1100",
        "0011"
      ],
      [
        "0100",
        "000"
      ],
      [
        "101",
        "01"
      ],
      [
        "010001",
        "0"
      ],
      [
        "00",
        "101"
      ],
      [
        "100",
        "0100"
      ],
      [
        "100",
        "00011"
      ],
      [
        "11",
        "10001"
      ],
      [
        "0100",
        "0001"
      ],
      [
        "0001",
        "01"
      ],
      [
        "1000000",
        "0011"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "00",
        "1000"
      ],
      [
        "100",
        "0001"
      ],
      [
        "100",
        "000"
      ],
      [
        "100",
        "001100"
      ],
      [
        "100",
        "00101"
      ],
      [
        "01",
        "1100"
      ],
      [
        "01",
        "10000001"
      ],
      [
        "0000",
        "1"
      ],
      [
        "0000",
        "000"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "1000000",
        "0001"
      ],
      [
        "1000000",
        "0100000"
      ],
      [
        "1000000",
        "00001"
      ],
      [
        "101",
        "1100"
      ],
      [
        "010001",
        "01"
      ],
      [
        "1001100",
        "1000"
      ],
      [
        "10101",
        "0111"
      ],
      [
        "000101",
        "1001100"
      ],
      [
        "100",
        "11"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "100",
        "0010"
      ],
      [
        "01",
        "11000000"
      ],
      [
        "01",
        "10"
      ],
      [
        "11",
        "0"
      ],
      [
        "11",
        "11000000"
      ],
      [
        "11",
        "01000101"
      ],
      [
        "11",
        "10011001000"
      ],
      [
        "11",
        "110"
      ],
      [
        "1100",
        "001"
      ],
      [
        "1100",
        "10000011"
      ],
      [
        "0100",
        "0000"
      ],
      [
        "0100",
        "001"
      ],
      [
        "1000000",
        "0100010"
      ],
      [
        "101",
        "0"
      ],
      [
        "101",
        "0111"
      ],
      [
        "101",
        "10000000"
      ],
      [
        "10001",
        "0"
      ],
      [
        "010001",
        "1"
      ],
      [
        "1000111",
        "10"
      ],
      [
        "11000000",
        "0010"
      ],
      [
        "000001",
        "01"
      ],
      [
        "000001",
        "1001100"
      ],
      [
        "001100",
        "1100"
      ],
      [
        "10100",
        "001"
      ],
      [
        "10100",
        "000001"
      ],
      [
        "11000011",
        "100000"
      ],
      [
        "10101",
        "0110"
      ],
      [
        "100001100",
        "1010"
      ],
      [
        "1",
        "0100010"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "10000001"
      ],
      [
        "00",
        "10000011"
      ]
    ]
  }
}