{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "11": 7,
      "0100": 8,
      "1100": 9,
      "0001": 10,
      "1000": 11,
      "0101": 12,
      "000": 13,
      "10100": 14,
      "1000000": 15,
      "01100": 16,
      "101": 17,
      "100100": 18,
      "1000101": 19,
      "00010": 20,
      "00011": 21,
      "001": 22,
      "00100": 23,
      "10001": 24,
      "000001100": 25,
      "00000001": 26,
      "0000011001000": 27,
      "000100": 28,
      "001000": 29,
      "100001": 30,
      "1111": 31,
      "100010111": 32,
      "001100": 33,
      "111100": 34,
      "0011": 35,
      "1000100": 36,
      "011": 37,
      "111000000": 38,
      "1100000": 39,
      "10100000": 40,
      "100011111": 41,
      "10": 42,
      "1001100": 43,
      "1000001": 44,
      "010100": 45,
      "00000100": 46,
      "00000101": 47,
      "110100": 48,
      "101000000": 49,
      "10100011": 50,
      "1011000": 51,
      "10101": 52,
      "101100": 53,
      "1001000000": 54,
      "010": 55,
      "000001": 56,
      "1110001": 57,
      "1110101": 58,
      "0100010": 59,
      "110000": 60,
      "10010010100000": 61,
      "100010110": 62,
      "011000": 63,
      "00001": 64,
      "000000100": 65,
      "00000011": 66,
      "000000000100": 67,
      "11100100": 68,
      "0100000": 69,
      "1100100": 70,
      "110010100011": 71,
      "010101": 72,
      "101000": 73,
      "1010000100": 74,
      "10100000100": 75,
      "10111": 76,
      "1010100": 77,
      "1011100": 78,
      "1011000000": 79,
      "100100100001": 80,
      "0011001000": 81,
      "11110000100": 82,
      "11100000000": 83,
      "11100000001": 84,
      "110100100001": 85,
      "1010000000": 86,
      "10100000000": 87,
      "100100000001": 88,
      "0000011011000": 89,
      "111010111": 90,
      "11000010100011": 91,
      "0000001001000": 92,
      "0000000001000": 93,
      "11100100000": 94,
      "001111": 95,
      "001011000": 96,
      "10011": 97,
      "1001000": 98,
      "10001100": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "01"
      ],
      [
        "100",
        "0"
      ],
      [
        "01",
        "01"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0100"
      ],
      [
        "100",
        "0000"
      ],
      [
        "01",
        "100"
      ],
      [
        "1",
        "01"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "0101"
      ],
      [
        "0001",
        "0"
      ],
      [
        "0001",
        "1"
      ],
      [
        "00",
        "1"
      ],
      [
        "00",
        "100"
      ],
      [
        "100",
        "01"
      ],
      [
        "0000",
        "01100"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "000001100",
        "1000"
      ],
      [
        "00",
        "0100"
      ],
      [
        "00",
        "1000"
      ],
      [
        "100",
        "001"
      ],
      [
        "11",
        "11"
      ],
      [
        "1000101",
        "11"
      ],
      [
        "00",
        "1100"
      ],
      [
        "11",
        "1100"
      ],
      [
        "00",
        "11"
      ],
      [
        "100",
        "0100"
      ],
      [
        "01",
        "1"
      ],
      [
        "11",
        "1000000"
      ],
      [
        "1100",
        "000"
      ],
      [
        "10100",
        "000"
      ],
      [
        "10001",
        "1111"
      ],
      [
        "1",
        "0"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "0001"
      ],
      [
        "01",
        "0100"
      ],
      [
        "0000",
        "0100"
      ],
      [
        "0000",
        "0101"
      ],
      [
        "11",
        "0100"
      ],
      [
        "10100",
        "0000"
      ],
      [
        "10100",
        "011"
      ],
      [
        "101",
        "1000"
      ],
      [
        "1",
        "0101"
      ],
      [
        "1",
        "01100"
      ],
      [
        "100",
        "1000000"
      ],
      [
        "01",
        "0"
      ],
      [
        "0000",
        "01"
      ],
      [
        "11",
        "10001"
      ],
      [
        "11",
        "10101"
      ],
      [
        "0100",
        "010"
      ],
      [
        "1100",
        "00"
      ],
      [
        "100100",
        "10100000"
      ],
      [
        "1000101",
        "10"
      ],
      [
        "01",
        "1000"
      ],
      [
        "0000",
        "1"
      ],
      [
        "0000",
        "00100"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "0000",
        "00000100"
      ],
      [
        "11",
        "100100"
      ],
      [
        "0100",
        "000"
      ],
      [
        "1100",
        "100"
      ],
      [
        "1100",
        "10100011"
      ],
      [
        "0101",
        "01"
      ],
      [
        "10100",
        "0"
      ],
      [
        "10100",
        "00100"
      ],
      [
        "10100",
        "000100"
      ],
      [
        "101",
        "11"
      ],
      [
        "101",
        "0100"
      ],
      [
        "101",
        "1100"
      ],
      [
        "101",
        "1000000"
      ],
      [
        "100100",
        "100001"
      ],
      [
        "001100",
        "1000"
      ],
      [
        "111100",
        "00100"
      ],
      [
        "111000000",
        "00"
      ],
      [
        "111000000",
        "01"
      ],
      [
        "110100",
        "100001"
      ],
      [
        "101000000",
        "0"
      ],
      [
        "101000000",
        "00"
      ],
      [
        "1001000000",
        "01"
      ],
      [
        "000001",
        "1011000"
      ],
      [
        "1110101",
        "11"
      ],
      [
        "110000",
        "10100011"
      ],
      [
        "000000100",
        "1000"
      ],
      [
        "000000000100",
        "0"
      ],
      [
        "11100100",
        "000"
      ],
      [
        "00",
        "1111"
      ],
      [
        "00",
        "1011000"
      ],
      [
        "100",
        "11"
      ],
      [
        "100",
        "1000"
      ],
      [
        "100",
        "01100"
      ]
    ]
  }
}