{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "11": 7,
      "0000": 8,
      "1000000": 9,
      "1100": 10,
      "0100": 11,
      "0001": 12,
      "010000": 13,
      "101": 14,
      "1000": 15,
      "011": 16,
      "1111": 17,
      "10001": 18,
      "000100": 19,
      "0100000": 20,
      "110000": 21,
      "000": 22,
      "00010": 23,
      "000001": 24,
      "00011": 25,
      "0111": 26,
      "100000": 27,
      "00000001": 28,
      "11000000": 29,
      "10000001": 30,
      "10100": 31,
      "011111": 32,
      "1010000": 33,
      "001100": 34,
      "1001100": 35,
      "100001": 36,
      "10000000100000": 37,
      "01000001": 38,
      "101100": 39,
      "1011100": 40,
      "01000000": 41,
      "0101": 42,
      "1000001": 43,
      "000000": 44,
      "0100011": 45,
      "101011111": 46,
      "0110": 47,
      "100010111": 48,
      "101000000": 49,
      "100100": 50,
      "1001000": 51,
      "010": 52,
      "100000000": 53,
      "10000011": 54,
      "111000000": 55,
      "11100000": 56,
      "1111000000": 57,
      "000101": 58,
      "0111000000": 59,
      "100010100011": 60,
      "100010110": 61,
      "1100001": 62,
      "10100001": 63,
      "1011000100": 64,
      "10000010100000": 65,
      "100101": 66,
      "1001111": 67,
      "100110000": 68,
      "10010000001": 69,
      "100001111": 70,
      "10000000001": 71,
      "11100": 72,
      "11101": 73,
      "11011": 74,
      "11100000000": 75,
      "00000000": 76,
      "0000000": 77,
      "110010000001": 78,
      "110010100001": 79,
      "01000111": 80,
      "0100001": 81,
      "10101": 82,
      "100010": 83,
      "11000011100000": 84,
      "00000101": 85,
      "0000011001100": 86,
      "0000011001000": 87,
      "11000000100000": 88,
      "10100010": 89,
      "10100000000": 90,
      "11100000001": 91,
      "11000010100000": 92,
      "1001011011100": 93,
      "100111111": 94,
      "111011111": 95,
      "00110000": 96,
      "0010000001": 97,
      "001001100": 98,
      "0001000001": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "10000",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "0",
        "100"
      ],
      [
        "00",
        "01"
      ],
      [
        "0",
        "10000"
      ],
      [
        "1",
        "01"
      ],
      [
        "100",
        "0"
      ],
      [
        "01",
        "1"
      ],
      [
        "11",
        "11"
      ],
      [
        "100",
        "01"
      ],
      [
        "00",
        "0100"
      ],
      [
        "010000",
        "0"
      ],
      [
        "1",
        "10000"
      ],
      [
        "00",
        "0"
      ],
      [
        "0001",
        "0"
      ],
      [
        "0000",
        "01"
      ],
      [
        "0001",
        "1"
      ],
      [
        "01",
        "11"
      ],
      [
        "10000",
        "0"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "1",
        "1000000"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "1",
        "0100"
      ],
      [
        "01",
        "1111"
      ],
      [
        "1",
        "010000"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "1100"
      ],
      [
        "10000",
        "1"
      ],
      [
        "1000000",
        "0100000"
      ],
      [
        "010000",
        "01"
      ],
      [
        "101",
        "100"
      ],
      [
        "101",
        "1100"
      ],
      [
        "0",
        "1000000"
      ],
      [
        "01",
        "01"
      ],
      [
        "10000",
        "01"
      ],
      [
        "0000",
        "00"
      ],
      [
        "0100",
        "011"
      ],
      [
        "101",
        "011111"
      ],
      [
        "011",
        "0"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "1",
        "01000000"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "1000"
      ],
      [
        "01",
        "0"
      ],
      [
        "10000",
        "0000"
      ],
      [
        "10000",
        "011"
      ],
      [
        "11",
        "1000000"
      ],
      [
        "11",
        "100000"
      ],
      [
        "11",
        "11000000"
      ],
      [
        "0001",
        "01"
      ],
      [
        "011",
        "1000000"
      ],
      [
        "10001",
        "0100011"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "110000",
        "1"
      ],
      [
        "1010000",
        "1"
      ],
      [
        "101100",
        "0100"
      ],
      [
        "1000001",
        "0100000"
      ],
      [
        "100",
        "101"
      ],
      [
        "100",
        "1111"
      ],
      [
        "100",
        "110000"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "10000",
        "1111"
      ],
      [
        "10000",
        "000001"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "101"
      ],
      [
        "11",
        "011"
      ],
      [
        "11",
        "100000000"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0000",
        "000"
      ],
      [
        "1100",
        "10000001"
      ],
      [
        "1100",
        "10100001"
      ],
      [
        "0100",
        "0111"
      ],
      [
        "010000",
        "1"
      ],
      [
        "101",
        "01"
      ],
      [
        "10001",
        "0"
      ],
      [
        "110000",
        "11100000"
      ],
      [
        "000001",
        "01"
      ],
      [
        "000001",
        "1001100"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "11000000",
        "100000"
      ],
      [
        "10100",
        "010"
      ],
      [
        "1010000",
        "0000"
      ],
      [
        "111000000",
        "01"
      ],
      [
        "1100001",
        "0100000"
      ],
      [
        "100101",
        "1011100"
      ],
      [
        "1001111",
        "11"
      ],
      [
        "11101",
        "1111"
      ],
      [
        "00",
        "110000"
      ],
      [
        "00",
        "10000001"
      ],
      [
        "00",
        "1001100"
      ],
      [
        "00",
        "01000001"
      ]
    ]
  }
}