{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "11": 7,
      "0000": 8,
      "1100": 9,
      "010": 10,
      "0101": 11,
      "110000": 12,
      "10": 13,
      "000": 14,
      "1000": 15,
      "1000000": 16,
      "00010": 17,
      "011": 18,
      "0111": 19,
      "100000": 20,
      "000000": 21,
      "000100": 22,
      "1001100": 23,
      "100000000": 24,
      "10101": 25,
      "101": 26,
      "1000001": 27,
      "100010": 28,
      "1000101": 29,
      "10000000": 30,
      "10000011": 31,
      "1111": 32,
      "1100000": 33,
      "000101": 34,
      "1000111": 35,
      "011001100": 36,
      "1100000000": 37,
      "11000010": 38,
      "10000000001": 39,
      "0110": 40,
      "1100010": 41,
      "0101000000": 42,
      "11000000": 43,
      "10000000100000": 44,
      "01000001": 45,
      "001100": 46,
      "00011": 47,
      "100100": 48,
      "100001": 49,
      "10000010": 50,
      "00000101": 51,
      "0000011001100": 52,
      "10000000011": 53,
      "100011111": 54,
      "110000000011": 55,
      "1001000": 56,
      "110010000011": 57,
      "11000001": 58,
      "11000011": 59,
      "101000000": 60,
      "00000011": 61,
      "0000001001000": 62,
      "101011111": 63,
      "101010110": 64,
      "10000011100000": 65,
      "100010111": 66,
      "1111100": 67,
      "11000010100010": 68,
      "10100000001": 69,
      "0100": 70,
      "10111": 71,
      "10011": 72,
      "100011": 73,
      "1000011": 74,
      "1000010": 75,
      "11100000": 76,
      "1111000000": 77,
      "00000111": 78,
      "110010": 79,
      "1100011": 80,
      "100010000010": 81,
      "00000001": 82,
      "0000001001100": 83,
      "101010111": 84,
      "10110000011": 85,
      "10111000000": 86,
      "100010110": 87,
      "0001011001100": 88,
      "0001011111100": 89,
      "110000000010": 90,
      "11000010100000": 91,
      "100100100001": 92,
      "11100000100000": 93,
      "01000": 94,
      "01000101": 95,
      "0100001": 96,
      "01000011": 97,
      "10101000000": 98,
      "0011": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "01",
        "0"
      ],
      [
        "01",
        "01"
      ],
      [
        "1",
        "10000"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "0"
      ],
      [
        "100",
        "0"
      ],
      [
        "10000",
        "00"
      ],
      [
        "00",
        "010"
      ],
      [
        "01",
        "1"
      ],
      [
        "01",
        "11"
      ],
      [
        "10000",
        "0"
      ],
      [
        "0000",
        "00"
      ],
      [
        "000",
        "100"
      ],
      [
        "100",
        "1100"
      ],
      [
        "10000",
        "0000"
      ],
      [
        "1",
        "0101"
      ],
      [
        "1",
        "01"
      ],
      [
        "10000",
        "01"
      ],
      [
        "100",
        "010"
      ],
      [
        "100",
        "0101"
      ],
      [
        "10000",
        "000"
      ],
      [
        "10000",
        "011"
      ],
      [
        "11",
        "11"
      ],
      [
        "110000",
        "0"
      ],
      [
        "00",
        "0101"
      ],
      [
        "100",
        "0111"
      ],
      [
        "01",
        "1001100"
      ],
      [
        "110000",
        "0000"
      ],
      [
        "110000",
        "10"
      ],
      [
        "100000000",
        "01"
      ],
      [
        "01",
        "10"
      ],
      [
        "1100",
        "010"
      ],
      [
        "010",
        "1000000"
      ],
      [
        "110000",
        "00"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "0",
        "1000001"
      ],
      [
        "00",
        "1100"
      ],
      [
        "00",
        "011"
      ],
      [
        "100",
        "100"
      ],
      [
        "10000",
        "1"
      ],
      [
        "10000",
        "010"
      ],
      [
        "0000",
        "0101"
      ],
      [
        "0000",
        "011001100"
      ],
      [
        "100000000",
        "11"
      ],
      [
        "1000111",
        "11"
      ],
      [
        "1100000000",
        "11"
      ],
      [
        "100",
        "1000"
      ],
      [
        "1100",
        "10000011"
      ],
      [
        "110000",
        "01"
      ],
      [
        "110000",
        "11"
      ],
      [
        "10",
        "1000000"
      ],
      [
        "000000",
        "11"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "10101",
        "1111"
      ],
      [
        "10101",
        "0110"
      ],
      [
        "1000001",
        "1100000"
      ],
      [
        "1000101",
        "11"
      ],
      [
        "1111",
        "100"
      ],
      [
        "11000010",
        "100010"
      ],
      [
        "101000000",
        "01"
      ],
      [
        "0",
        "100"
      ],
      [
        "1",
        "0111"
      ],
      [
        "100",
        "11"
      ],
      [
        "100",
        "011"
      ],
      [
        "10000",
        "11"
      ],
      [
        "10000",
        "10"
      ],
      [
        "11",
        "100000"
      ],
      [
        "11",
        "11000000"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "1100",
        "10"
      ],
      [
        "1100",
        "011"
      ],
      [
        "1000",
        "10000010"
      ],
      [
        "000000",
        "01"
      ],
      [
        "000000",
        "1001100"
      ],
      [
        "10101",
        "0111"
      ],
      [
        "101",
        "10000011"
      ],
      [
        "101",
        "11000000"
      ],
      [
        "1000101",
        "10"
      ],
      [
        "000101",
        "1001100"
      ],
      [
        "000101",
        "1111100"
      ],
      [
        "1100000000",
        "10"
      ],
      [
        "11000010",
        "100000"
      ],
      [
        "100100",
        "100001"
      ],
      [
        "11100000",
        "100000"
      ],
      [
        "0",
        "1000"
      ],
      [
        "0",
        "1000101"
      ],
      [
        "0",
        "100001"
      ],
      [
        "0",
        "1000011"
      ],
      [
        "1",
        "0101000000"
      ],
      [
        "00",
        "11"
      ]
    ]
  }
}