{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "0000": 6,
      "10": 7,
      "000": 8,
      "1100": 9,
      "1000": 10,
      "100000": 11,
      "110": 12,
      "1000000": 13,
      "1011": 14,
      "00010": 15,
      "00100": 16,
      "00000": 17,
      "101100": 18,
      "100100": 19,
      "100011": 20,
      "001100": 21,
      "001000": 22,
      "10100": 23,
      "00011": 24,
      "10111": 25,
      "0011": 26,
      "0001": 27,
      "100010111": 28,
      "001": 29,
      "11100000": 30,
      "000000100": 31,
      "1100000": 32,
      "100010": 33,
      "01100": 34,
      "111": 35,
      "00000001": 36,
      "0000001001000": 37,
      "100110": 38,
      "1111": 39,
      "000000": 40,
      "000000000": 41,
      "000100": 42,
      "110100": 43,
      "00000100": 44,
      "011000": 45,
      "100110111": 46,
      "0000000001000": 47,
      "0100": 48,
      "100001": 49,
      "111100": 50,
      "11100100": 51,
      "101011": 52,
      "10100010": 53,
      "11001000": 54,
      "11000011": 55,
      "10000011100000": 56,
      "10000001": 57,
      "10000000011": 58,
      "0000011001000": 59,
      "0011001000": 60,
      "0100000": 61,
      "0110": 62,
      "00001": 63,
      "0000110": 64,
      "10100000": 65,
      "101000000": 66,
      "1010100": 67,
      "110000": 68,
      "110010": 69,
      "10000011": 70,
      "10000000100000": 71,
      "1011100": 72,
      "1011000": 73,
      "10110000000": 74,
      "101100100001": 75,
      "100100100011": 76,
      "100010110": 77,
      "11111000": 78,
      "0000001011100": 79,
      "11100100100": 80,
      "101011110": 81,
      "0110100000": 82,
      "00001101": 83,
      "011": 84,
      "0100011": 85,
      "011100000": 86,
      "0100010": 87,
      "0010": 88,
      "1000011001000": 89,
      "11100": 90,
      "111000": 91,
      "111000000": 92,
      "11101100": 93,
      "11100011": 94,
      "1110100": 95,
      "11111": 96,
      "11100110": 97,
      "1110000001": 98,
      "00000000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "100",
        "0"
      ],
      [
        "100",
        "000"
      ],
      [
        "11",
        "0"
      ],
      [
        "100",
        "0000"
      ],
      [
        "10",
        "11"
      ],
      [
        "000",
        "10"
      ],
      [
        "00",
        "100"
      ],
      [
        "0000",
        "0"
      ],
      [
        "10",
        "1100"
      ],
      [
        "100",
        "100"
      ],
      [
        "1000",
        "11"
      ],
      [
        "00",
        "1100"
      ],
      [
        "00",
        "1000"
      ],
      [
        "10",
        "100"
      ],
      [
        "000",
        "11"
      ],
      [
        "1011",
        "1"
      ],
      [
        "00",
        "11"
      ],
      [
        "000",
        "1"
      ],
      [
        "1000",
        "10111"
      ],
      [
        "00",
        "1"
      ],
      [
        "11",
        "100000"
      ],
      [
        "0000",
        "00100"
      ],
      [
        "1100",
        "000"
      ],
      [
        "1000",
        "10"
      ],
      [
        "0",
        "1100"
      ],
      [
        "11",
        "1"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "000000100",
        "1000"
      ],
      [
        "100",
        "110"
      ],
      [
        "11",
        "11"
      ],
      [
        "0000",
        "00"
      ],
      [
        "0000",
        "00000"
      ],
      [
        "000",
        "100"
      ],
      [
        "110",
        "100"
      ],
      [
        "00000",
        "100"
      ],
      [
        "01100",
        "0"
      ],
      [
        "100110",
        "111"
      ],
      [
        "000000000",
        "1000"
      ],
      [
        "0",
        "100"
      ],
      [
        "100",
        "001"
      ],
      [
        "11",
        "1100"
      ],
      [
        "11",
        "100100"
      ],
      [
        "10",
        "1011"
      ],
      [
        "10",
        "100010"
      ],
      [
        "1100",
        "1000"
      ],
      [
        "1100",
        "0011"
      ],
      [
        "100000",
        "11100000"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "1000000",
        "0011"
      ],
      [
        "00000",
        "11001000"
      ],
      [
        "001100",
        "1000"
      ],
      [
        "0",
        "100000"
      ],
      [
        "0",
        "110"
      ],
      [
        "0000",
        "1"
      ],
      [
        "0000",
        "110"
      ],
      [
        "10",
        "100000"
      ],
      [
        "10",
        "1000000"
      ],
      [
        "10",
        "10100"
      ],
      [
        "1100",
        "00"
      ],
      [
        "1100",
        "10"
      ],
      [
        "100000",
        "11"
      ],
      [
        "1000000",
        "0100000"
      ],
      [
        "1011",
        "100"
      ],
      [
        "101100",
        "0"
      ],
      [
        "101100",
        "00000"
      ],
      [
        "101100",
        "100001"
      ],
      [
        "100100",
        "100011"
      ],
      [
        "100010",
        "110"
      ],
      [
        "1111",
        "1000"
      ],
      [
        "000000",
        "1011100"
      ],
      [
        "11100100",
        "100"
      ],
      [
        "101011",
        "110"
      ],
      [
        "0110",
        "100000"
      ],
      [
        "0000110",
        "1"
      ],
      [
        "0",
        "11"
      ],
      [
        "0",
        "100011"
      ],
      [
        "0",
        "11100000"
      ],
      [
        "0",
        "100010"
      ],
      [
        "00",
        "10"
      ],
      [
        "100",
        "0011001000"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "1000"
      ],
      [
        "11",
        "1000000"
      ],
      [
        "11",
        "101100"
      ],
      [
        "11",
        "100011"
      ],
      [
        "11",
        "10100"
      ],
      [
        "11",
        "111"
      ],
      [
        "11",
        "100110"
      ],
      [
        "11",
        "10000001"
      ],
      [
        "0000",
        "0000"
      ]
    ]
  }
}