{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "11": 7,
      "0001": 8,
      "1000": 9,
      "010000": 10,
      "0000": 11,
      "1100": 12,
      "10001": 13,
      "000": 14,
      "101": 15,
      "1000000": 16,
      "0111": 17,
      "000001": 18,
      "10": 19,
      "1001000": 20,
      "0100000": 21,
      "110000": 22,
      "1101": 23,
      "00011": 24,
      "00010": 25,
      "10011": 26,
      "1000001": 27,
      "000000": 28,
      "1010000": 29,
      "100100": 30,
      "100010111": 31,
      "0000011001000": 32,
      "001000": 33,
      "0101": 34,
      "011000": 35,
      "0110": 36,
      "10000000": 37,
      "1110001": 38,
      "1100000": 39,
      "010001": 40,
      "10100000": 41,
      "0010000": 42,
      "100000": 43,
      "00010101": 44,
      "00000001": 45,
      "100010110": 46,
      "1011000": 47,
      "10100": 48,
      "100110111": 49,
      "10000010100000": 50,
      "0000001001000": 51,
      "01000": 52,
      "0011": 53,
      "1001000000": 54,
      "100001": 55,
      "1111": 56,
      "11101": 57,
      "1110000000": 58,
      "0100001": 59,
      "10000000100000": 60,
      "00000101": 61,
      "00000111": 62,
      "10000011": 63,
      "0100": 64,
      "11000000": 65,
      "001100": 66,
      "1001100": 67,
      "100101": 68,
      "10010100": 69,
      "011100": 70,
      "0111000000": 71,
      "111100": 72,
      "111101": 73,
      "11100000": 74,
      "00010111": 75,
      "1100100": 76,
      "10001010001": 77,
      "10110000000": 78,
      "10100100": 79,
      "11000010100000": 80,
      "0001010001": 81,
      "0000001": 82,
      "0000001011000": 83,
      "10100000000": 84,
      "100100100001": 85,
      "11100010": 86,
      "0010000100": 87,
      "10010000001": 88,
      "111010110": 89,
      "0000011101000": 90,
      "010011": 91,
      "0010010100": 92,
      "10010000": 93,
      "10010100100": 94,
      "010": 95,
      "0110000": 96,
      "0110000000": 97,
      "010100": 98,
      "01100101": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "01"
      ],
      [
        "100",
        "0"
      ],
      [
        "0",
        "10000"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "100",
        "01"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "10000",
        "00"
      ],
      [
        "01",
        "11"
      ],
      [
        "00",
        "0001"
      ],
      [
        "1",
        "0"
      ],
      [
        "100",
        "1000"
      ],
      [
        "010000",
        "0"
      ],
      [
        "1",
        "10000"
      ],
      [
        "11",
        "01"
      ],
      [
        "0001",
        "1"
      ],
      [
        "0001",
        "0"
      ],
      [
        "100",
        "11"
      ],
      [
        "10000",
        "01"
      ],
      [
        "0000",
        "00"
      ],
      [
        "1",
        "010000"
      ],
      [
        "100",
        "100"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "00",
        "1000"
      ],
      [
        "01",
        "01"
      ],
      [
        "01",
        "1000"
      ],
      [
        "01",
        "10"
      ],
      [
        "10000",
        "000"
      ],
      [
        "11",
        "10001"
      ],
      [
        "110000",
        "0"
      ],
      [
        "0",
        "10001"
      ],
      [
        "1",
        "0100000"
      ],
      [
        "00",
        "10000"
      ],
      [
        "10000",
        "0"
      ],
      [
        "0001",
        "0101"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "101",
        "1000"
      ],
      [
        "10",
        "100"
      ],
      [
        "10011",
        "0111"
      ],
      [
        "1000001",
        "0100000"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "0",
        "1000"
      ],
      [
        "00",
        "11"
      ],
      [
        "100",
        "1000000"
      ],
      [
        "10000",
        "1"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "101"
      ],
      [
        "11",
        "10000000"
      ],
      [
        "010000",
        "1"
      ],
      [
        "1000000",
        "0100000"
      ],
      [
        "000001",
        "01"
      ],
      [
        "000001",
        "11"
      ],
      [
        "1000001",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "1",
        "1000000"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "101"
      ],
      [
        "100",
        "10100"
      ],
      [
        "01",
        "1100"
      ],
      [
        "01",
        "11000000"
      ],
      [
        "11",
        "1100"
      ],
      [
        "11",
        "1101"
      ],
      [
        "11",
        "100000"
      ],
      [
        "0001",
        "0111"
      ],
      [
        "1100",
        "100"
      ],
      [
        "10001",
        "010001"
      ],
      [
        "101",
        "10000000"
      ],
      [
        "10",
        "100100"
      ],
      [
        "110000",
        "10100000"
      ],
      [
        "00010",
        "10001"
      ],
      [
        "000000",
        "1"
      ],
      [
        "000000",
        "1011000"
      ],
      [
        "1010000",
        "0000"
      ],
      [
        "100100",
        "100001"
      ],
      [
        "1110001",
        "0"
      ],
      [
        "0010000",
        "100"
      ],
      [
        "1001000000",
        "1"
      ],
      [
        "11101",
        "0110"
      ],
      [
        "00000111",
        "01000"
      ],
      [
        "0",
        "10011"
      ],
      [
        "00",
        "10010100"
      ],
      [
        "100",
        "10000"
      ],
      [
        "100",
        "10100100"
      ],
      [
        "01",
        "0"
      ],
      [
        "01",
        "10000"
      ],
      [
        "01",
        "10000000"
      ],
      [
        "01",
        "0100"
      ],
      [
        "01",
        "100101"
      ]
    ]
  }
}