{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "000": 6,
      "10": 7,
      "0000": 8,
      "1000": 9,
      "1100": 10,
      "100000": 11,
      "110": 12,
      "00010": 13,
      "1000000": 14,
      "100010": 15,
      "10000": 16,
      "000000": 17,
      "111": 18,
      "00000": 19,
      "1110": 20,
      "11000": 21,
      "1001000": 22,
      "110000": 23,
      "10000011": 24,
      "100010110": 25,
      "1100000": 26,
      "00000011": 27,
      "0000001001000": 28,
      "101": 29,
      "100011": 30,
      "11000000": 31,
      "10010": 32,
      "11100000": 33,
      "000100": 34,
      "10000010": 35,
      "1101": 36,
      "10000001": 37,
      "100010111": 38,
      "01": 39,
      "0011": 40,
      "001000": 41,
      "111000": 42,
      "1010": 43,
      "10000001100000": 44,
      "11101000": 45,
      "0000010": 46,
      "0010000001": 47,
      "1001100": 48,
      "10011100000": 49,
      "11100": 50,
      "1110000": 51,
      "0001": 52,
      "00011": 53,
      "101000": 54,
      "10111": 55,
      "110000000": 56,
      "10000010000": 57,
      "000001100": 58,
      "00000111": 59,
      "10000010100000": 60,
      "00000101": 61,
      "011000": 62,
      "1100010": 63,
      "0011000": 64,
      "0011101000": 65,
      "10010000011": 66,
      "10010011100000": 67,
      "1111": 68,
      "1111000000": 69,
      "0001000": 70,
      "101000000": 71,
      "1010000": 72,
      "1011000000": 73,
      "00000000": 74,
      "100010000011": 75,
      "110010": 76,
      "110010000011": 77,
      "11011100": 78,
      "00010101": 79,
      "10000000001": 80,
      "100001": 81,
      "1000011000": 82,
      "10000111000": 83,
      "0000000001000": 84,
      "111011": 85,
      "10000011100000": 86,
      "11000000100000": 87,
      "0011110000": 88,
      "0000011001000": 89,
      "0011000100": 90,
      "10000110001": 91,
      "010": 92,
      "0100000": 93,
      "010000": 94,
      "011100": 95,
      "0110000000": 96,
      "0010": 97,
      "001100": 98,
      "001001100": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "100",
        "000"
      ],
      [
        "11",
        "0"
      ],
      [
        "000",
        "10"
      ],
      [
        "100",
        "0000"
      ],
      [
        "1000",
        "10"
      ],
      [
        "100",
        "00"
      ],
      [
        "0000",
        "00"
      ],
      [
        "11",
        "1"
      ],
      [
        "00",
        "000"
      ],
      [
        "11",
        "10"
      ],
      [
        "1",
        "1000"
      ],
      [
        "100",
        "1000"
      ],
      [
        "1100",
        "00"
      ],
      [
        "100000",
        "11"
      ],
      [
        "100010",
        "110"
      ],
      [
        "1100",
        "000"
      ],
      [
        "000000",
        "11"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "10",
        "1"
      ],
      [
        "1000",
        "11"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "100",
        "10"
      ],
      [
        "11",
        "100000"
      ],
      [
        "000",
        "100"
      ],
      [
        "100000",
        "10"
      ],
      [
        "110",
        "1"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "100010",
        "111"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "11"
      ],
      [
        "00",
        "1000"
      ],
      [
        "11",
        "1000"
      ],
      [
        "10",
        "10"
      ],
      [
        "1000000",
        "1100000"
      ],
      [
        "1110",
        "1000"
      ],
      [
        "00",
        "00010"
      ],
      [
        "00",
        "10000001"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "11100000"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "10000"
      ],
      [
        "000",
        "1"
      ],
      [
        "000",
        "11"
      ],
      [
        "10",
        "1000"
      ],
      [
        "10",
        "111"
      ],
      [
        "1100",
        "00000"
      ],
      [
        "100000",
        "10000"
      ],
      [
        "00000",
        "1100"
      ],
      [
        "00000",
        "111"
      ],
      [
        "10000010",
        "100000"
      ],
      [
        "0000010",
        "1"
      ],
      [
        "0",
        "11000"
      ],
      [
        "1",
        "100010"
      ],
      [
        "00",
        "11000"
      ],
      [
        "00",
        "11101000"
      ],
      [
        "100",
        "10000011"
      ],
      [
        "100",
        "10011100000"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "11000000"
      ],
      [
        "000",
        "1000"
      ],
      [
        "10",
        "1000000"
      ],
      [
        "10",
        "10000"
      ],
      [
        "10",
        "11000000"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "1000",
        "10000011"
      ],
      [
        "1100",
        "10"
      ],
      [
        "1100",
        "10000011"
      ],
      [
        "110",
        "11100"
      ],
      [
        "00010",
        "101"
      ],
      [
        "1000000",
        "0001"
      ],
      [
        "10000",
        "1"
      ],
      [
        "10000",
        "11000"
      ],
      [
        "10000",
        "111000"
      ],
      [
        "000000",
        "0001000"
      ],
      [
        "1110",
        "11"
      ],
      [
        "10000011",
        "100000"
      ],
      [
        "11000000",
        "100000"
      ],
      [
        "0011",
        "110000"
      ],
      [
        "000001100",
        "1000"
      ],
      [
        "0011000",
        "100"
      ],
      [
        "1000011000",
        "1"
      ],
      [
        "0",
        "10"
      ],
      [
        "0",
        "100000"
      ],
      [
        "0",
        "10000"
      ],
      [
        "0",
        "11100"
      ],
      [
        "0",
        "110000000"
      ],
      [
        "00",
        "10"
      ],
      [
        "00",
        "1100"
      ],
      [
        "00",
        "1001100"
      ]
    ]
  }
}