{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "0000": 6,
      "000": 7,
      "10": 8,
      "1100": 9,
      "1000": 10,
      "100000": 11,
      "10000": 12,
      "1000000": 13,
      "110": 14,
      "100001": 15,
      "111": 16,
      "00000": 17,
      "1010": 18,
      "000000": 19,
      "00011": 20,
      "100100": 21,
      "11100000": 22,
      "001000": 23,
      "0001": 24,
      "001100": 25,
      "1001000": 26,
      "110000": 27,
      "100011": 28,
      "100010": 29,
      "1110": 30,
      "00010": 31,
      "00000001": 32,
      "110100001": 33,
      "101010": 34,
      "0000001001000": 35,
      "1001100": 36,
      "000100": 37,
      "101": 38,
      "11001000": 39,
      "111000000": 40,
      "000000000": 41,
      "101100": 42,
      "0000011001000": 43,
      "00000011": 44,
      "100011111": 45,
      "101010111": 46,
      "0000000001000": 47,
      "100110": 48,
      "11100": 49,
      "111100": 50,
      "11100010": 51,
      "1000001": 52,
      "10000011100000": 53,
      "10000100": 54,
      "100100100001": 55,
      "1100001110": 56,
      "100010110": 57,
      "100110111": 58,
      "11000011101000": 59,
      "0110100001": 60,
      "0010000100": 61,
      "1001000000": 62,
      "100110100001": 63,
      "11110": 64,
      "111010": 65,
      "00000000": 66,
      "101110": 67,
      "1100100": 68,
      "1000100": 69,
      "100000100001": 70,
      "10000001": 71,
      "10000000001": 72,
      "00000101": 73,
      "0000001001100": 74,
      "100100100": 75,
      "10010011100000": 76,
      "11100000100": 77,
      "11000011": 78,
      "11000011100000": 79,
      "100010111": 80,
      "11100000000": 81,
      "10110000000": 82,
      "11100010100000": 83,
      "01": 84,
      "010": 85,
      "01100": 86,
      "01010": 87,
      "01000001": 88,
      "00100001": 89,
      "001001100": 90,
      "10010": 91,
      "100100000": 92,
      "100100001": 93,
      "11100011": 94,
      "11110100001": 95,
      "111001100": 96,
      "11111000000": 97,
      "11111100": 98,
      "11111010": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "100",
        "0"
      ],
      [
        "100",
        "000"
      ],
      [
        "100",
        "00"
      ],
      [
        "100",
        "0000"
      ],
      [
        "11",
        "0"
      ],
      [
        "10000",
        "1"
      ],
      [
        "11",
        "1"
      ],
      [
        "0000",
        "0"
      ],
      [
        "10",
        "10"
      ],
      [
        "0000",
        "00"
      ],
      [
        "000",
        "11"
      ],
      [
        "100",
        "100"
      ],
      [
        "11",
        "100000"
      ],
      [
        "00",
        "1000"
      ],
      [
        "000",
        "1"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "1000"
      ],
      [
        "1100",
        "00"
      ],
      [
        "1000",
        "11"
      ],
      [
        "1000",
        "10"
      ],
      [
        "11",
        "10"
      ],
      [
        "000",
        "10"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "110",
        "100001"
      ],
      [
        "1010",
        "10"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "100",
        "1100"
      ],
      [
        "000",
        "100"
      ],
      [
        "10",
        "1"
      ],
      [
        "1100",
        "1000"
      ],
      [
        "11",
        "1000000"
      ],
      [
        "0000",
        "00000"
      ],
      [
        "10",
        "1100"
      ],
      [
        "00000",
        "11001000"
      ],
      [
        "000000",
        "11"
      ],
      [
        "100011",
        "111"
      ],
      [
        "101010",
        "111"
      ],
      [
        "000000000",
        "1000"
      ],
      [
        "100",
        "110"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "1100"
      ],
      [
        "11",
        "100010"
      ],
      [
        "100000",
        "1"
      ],
      [
        "100000",
        "11100000"
      ],
      [
        "10000",
        "100"
      ],
      [
        "100100",
        "100001"
      ],
      [
        "110000",
        "1110"
      ],
      [
        "100010",
        "110"
      ],
      [
        "100110",
        "111"
      ],
      [
        "1100001110",
        "1000"
      ],
      [
        "0",
        "110100001"
      ],
      [
        "00",
        "10000100"
      ],
      [
        "100",
        "1000000"
      ],
      [
        "100",
        "110100001"
      ],
      [
        "11",
        "110"
      ],
      [
        "11",
        "1010"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "10",
        "1110"
      ],
      [
        "1100",
        "100"
      ],
      [
        "1000",
        "100"
      ],
      [
        "100000",
        "100001"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "1000000",
        "0001"
      ],
      [
        "00000",
        "101"
      ],
      [
        "000000",
        "1001100"
      ],
      [
        "100100",
        "100"
      ],
      [
        "100100",
        "11100000"
      ],
      [
        "11100000",
        "100"
      ],
      [
        "110000",
        "11"
      ],
      [
        "110000",
        "11100000"
      ],
      [
        "100010",
        "111"
      ],
      [
        "111000000",
        "00"
      ],
      [
        "101100",
        "00000"
      ],
      [
        "11100010",
        "100000"
      ],
      [
        "0",
        "1"
      ],
      [
        "0",
        "10"
      ],
      [
        "0",
        "1100"
      ],
      [
        "0",
        "1010"
      ],
      [
        "0",
        "1000001"
      ],
      [
        "00",
        "100001"
      ],
      [
        "00",
        "1001100"
      ],
      [
        "100",
        "10"
      ],
      [
        "100",
        "100000"
      ],
      [
        "100",
        "100001"
      ],
      [
        "11",
        "100011"
      ],
      [
        "11",
        "110100001"
      ],
      [
        "11",
        "1001100"
      ],
      [
        "11",
        "111000000"
      ],
      [
        "11",
        "111100"
      ],
      [
        "11",
        "111010"
      ]
    ]
  }
}