{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "0000": 6,
      "1100": 7,
      "10": 8,
      "000": 9,
      "0100": 10,
      "0011": 11,
      "00100": 12,
      "001100": 13,
      "011": 14,
      "010": 15,
      "1001": 16,
      "00011": 17,
      "0011000100": 18,
      "0000100": 19,
      "1011": 20,
      "00000011": 21,
      "11000": 22,
      "0000000": 23,
      "000100": 24,
      "000011000": 25,
      "0010": 26,
      "001": 27,
      "1000000": 28,
      "1100100": 29,
      "0011100": 30,
      "110": 31,
      "000010000": 32,
      "101011": 33,
      "00010": 34,
      "0100011": 35,
      "00110100011": 36,
      "1000": 37,
      "100010": 38,
      "1000010": 39,
      "000000": 40,
      "1100000": 41,
      "1100011": 42,
      "00100011": 43,
      "001000011100": 44,
      "00110000011": 45,
      "0101100": 46,
      "01100": 47,
      "100100": 48,
      "100110": 49,
      "11100": 50,
      "1111": 51,
      "1010": 52,
      "0001": 53,
      "0001100": 54,
      "0100100": 55,
      "010011": 56,
      "0010000100": 57,
      "001000101100": 58,
      "0000100010011": 59,
      "110001": 60,
      "0000000110001": 61,
      "10010": 62,
      "1000011": 63,
      "10000011": 64,
      "110100": 65,
      "11010": 66,
      "00001": 67,
      "00001100": 68,
      "110011": 69,
      "101": 70,
      "01000010": 71,
      "00110": 72,
      "00111100011": 73,
      "00100100": 74,
      "001000000100": 75,
      "001000001100": 76,
      "00110000001": 77,
      "01110": 78,
      "01010": 79,
      "000111001": 80,
      "000111000": 81,
      "0001111100": 82,
      "0000100101011": 83,
      "10111100011": 84,
      "10111000011": 85,
      "0000000101011": 86,
      "000100010": 87,
      "100000011": 88,
      "000011001": 89,
      "01": 90,
      "01100100": 91,
      "001011": 92,
      "10011": 93,
      "100000": 94,
      "10000100": 95,
      "100011": 96,
      "1000100100": 97,
      "111100": 98,
      "1110": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "0"
      ],
      [
        "0",
        "100"
      ],
      [
        "00",
        "11"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "1100"
      ],
      [
        "0",
        "11"
      ],
      [
        "0",
        "10"
      ],
      [
        "100",
        "1"
      ],
      [
        "000",
        "11"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "0000",
        "100"
      ],
      [
        "10",
        "11"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "1100",
        "0"
      ],
      [
        "0000",
        "000"
      ],
      [
        "000",
        "100"
      ],
      [
        "0000",
        "11000"
      ],
      [
        "00",
        "10"
      ],
      [
        "00",
        "1"
      ],
      [
        "100",
        "0000"
      ],
      [
        "1100",
        "100"
      ],
      [
        "0011",
        "100"
      ],
      [
        "11",
        "0"
      ],
      [
        "0000100",
        "00"
      ],
      [
        "10",
        "1011"
      ],
      [
        "000",
        "10"
      ],
      [
        "0100",
        "011"
      ],
      [
        "0011",
        "0100011"
      ],
      [
        "100",
        "0"
      ],
      [
        "100",
        "010"
      ],
      [
        "100",
        "0010"
      ],
      [
        "0000",
        "00"
      ],
      [
        "1100",
        "000"
      ],
      [
        "1100",
        "011"
      ],
      [
        "00100",
        "011"
      ],
      [
        "00100",
        "0011100"
      ],
      [
        "001100",
        "00011"
      ],
      [
        "010",
        "1100"
      ],
      [
        "0",
        "1100"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "110"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "11"
      ],
      [
        "10",
        "10"
      ],
      [
        "000",
        "1"
      ],
      [
        "000",
        "1100"
      ],
      [
        "0100",
        "100"
      ],
      [
        "0100",
        "11"
      ],
      [
        "00100",
        "00100"
      ],
      [
        "00100",
        "0101100"
      ],
      [
        "0000100",
        "010011"
      ],
      [
        "11000",
        "1"
      ],
      [
        "0000000",
        "110001"
      ],
      [
        "100",
        "10"
      ],
      [
        "100",
        "0011"
      ],
      [
        "100",
        "00011"
      ],
      [
        "11",
        "0100"
      ],
      [
        "11",
        "010"
      ],
      [
        "0000",
        "1"
      ],
      [
        "0000",
        "1100"
      ],
      [
        "1100",
        "11"
      ],
      [
        "10",
        "1"
      ],
      [
        "0100",
        "0010"
      ],
      [
        "0011",
        "0"
      ],
      [
        "0011",
        "1100011"
      ],
      [
        "00100",
        "100"
      ],
      [
        "00100",
        "0000100"
      ],
      [
        "00100",
        "0001100"
      ],
      [
        "001100",
        "00001"
      ],
      [
        "011",
        "10"
      ],
      [
        "010",
        "10"
      ],
      [
        "00011",
        "1001"
      ],
      [
        "00011",
        "1000"
      ],
      [
        "00011",
        "11100"
      ],
      [
        "0000100",
        "101011"
      ],
      [
        "1011",
        "1100011"
      ],
      [
        "1011",
        "1000011"
      ],
      [
        "0000000",
        "101011"
      ],
      [
        "000100",
        "010"
      ],
      [
        "1000000",
        "11"
      ],
      [
        "00001100",
        "1"
      ],
      [
        "0",
        "1"
      ],
      [
        "0",
        "1100100"
      ],
      [
        "00",
        "1011"
      ],
      [
        "100",
        "11"
      ],
      [
        "100",
        "000"
      ],
      [
        "100",
        "00100"
      ],
      [
        "100",
        "011"
      ],
      [
        "100",
        "0100100"
      ],
      [
        "11",
        "1100"
      ],
      [
        "11",
        "10"
      ]
    ]
  }
}