{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "0000": 6,
      "01": 7,
      "10000": 8,
      "011": 9,
      "1001": 10,
      "001": 11,
      "00001": 12,
      "010000": 13,
      "0011": 14,
      "1000": 15,
      "100100": 16,
      "010": 17,
      "10000011": 18,
      "10": 19,
      "0010000": 20,
      "000011": 21,
      "01100": 22,
      "00110000011": 23,
      "00010000": 24,
      "100101": 25,
      "00100": 26,
      "000011000": 27,
      "10011": 28,
      "1000010": 29,
      "00010000100100": 30,
      "101": 31,
      "0000010": 32,
      "00000011": 33,
      "01000011": 34,
      "000": 35,
      "11100": 36,
      "000010000": 37,
      "01101": 38,
      "01001": 39,
      "10000001": 40,
      "1000011": 41,
      "0011100101": 42,
      "001110011": 43,
      "001000001100": 44,
      "001000011100": 45,
      "00011": 46,
      "1000000": 47,
      "100011": 48,
      "1101": 49,
      "0000100": 50,
      "0111": 51,
      "00110000001": 52,
      "000010": 53,
      "001000000100": 54,
      "0011100111": 55,
      "01000": 56,
      "101101": 57,
      "00010": 58,
      "100010": 59,
      "000000010": 60,
      "01010000": 61,
      "0101100": 62,
      "001000101100": 63,
      "0000000101001": 64,
      "11000011": 65,
      "10001": 66,
      "00000": 67,
      "000000001": 68,
      "000010011": 69,
      "011101": 70,
      "00101": 71,
      "0011000": 72,
      "0011100100": 73,
      "00111000011": 74,
      "1000100101": 75,
      "1000001101001": 76,
      "101001": 77,
      "101000": 78,
      "0010000101001": 79,
      "000011100": 80,
      "01100011": 81,
      "0001000001001": 82,
      "100110": 83,
      "1000000011101": 84,
      "1000110": 85,
      "11011000100101": 86,
      "0111100101": 87,
      "01010000100100": 88,
      "0000100111001": 89,
      "0011000100": 90,
      "1011": 91,
      "110001": 92,
      "0001": 93,
      "001000": 94,
      "11010000": 95,
      "0000000011": 96,
      "0000000": 97,
      "000000011": 98,
      "0101": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "0",
        "11"
      ],
      [
        "100",
        "1"
      ],
      [
        "00",
        "1"
      ],
      [
        "0000",
        "1"
      ],
      [
        "0",
        "10000"
      ],
      [
        "00",
        "11"
      ],
      [
        "100",
        "0"
      ],
      [
        "100",
        "100"
      ],
      [
        "01",
        "0"
      ],
      [
        "10000",
        "011"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "10000"
      ],
      [
        "0000",
        "11"
      ],
      [
        "01",
        "100"
      ],
      [
        "001",
        "10000011"
      ],
      [
        "00",
        "010000"
      ],
      [
        "1001",
        "01"
      ],
      [
        "00",
        "100"
      ],
      [
        "00001",
        "1000"
      ],
      [
        "100",
        "11"
      ],
      [
        "10000",
        "10"
      ],
      [
        "00010000",
        "100100"
      ],
      [
        "1",
        "01"
      ],
      [
        "0000",
        "010"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "010000",
        "11"
      ],
      [
        "00",
        "0"
      ],
      [
        "11",
        "100"
      ],
      [
        "0000",
        "10000"
      ],
      [
        "011",
        "01"
      ],
      [
        "0",
        "1001"
      ],
      [
        "100",
        "00001"
      ],
      [
        "10000",
        "11"
      ],
      [
        "0011",
        "100101"
      ],
      [
        "0011",
        "10011"
      ],
      [
        "0010000",
        "01100"
      ],
      [
        "0010000",
        "11100"
      ],
      [
        "00",
        "011"
      ],
      [
        "100",
        "0000"
      ],
      [
        "100",
        "011"
      ],
      [
        "11",
        "01"
      ],
      [
        "0000",
        "100"
      ],
      [
        "011",
        "1"
      ],
      [
        "001",
        "10000001"
      ],
      [
        "00001",
        "0"
      ],
      [
        "00100",
        "0000100"
      ],
      [
        "001110011",
        "1"
      ],
      [
        "0",
        "1000"
      ],
      [
        "1",
        "01101"
      ],
      [
        "00",
        "010"
      ],
      [
        "100",
        "010"
      ],
      [
        "0000",
        "00010"
      ],
      [
        "01",
        "010000"
      ],
      [
        "01",
        "01100"
      ],
      [
        "00100",
        "0101100"
      ],
      [
        "000000010",
        "1001"
      ],
      [
        "1",
        "1000011"
      ],
      [
        "100",
        "01"
      ],
      [
        "0000",
        "0"
      ],
      [
        "0000",
        "00001"
      ],
      [
        "0000",
        "10011"
      ],
      [
        "011",
        "101"
      ],
      [
        "001",
        "01"
      ],
      [
        "001",
        "1000"
      ],
      [
        "0011",
        "100100"
      ],
      [
        "0011",
        "1000011"
      ],
      [
        "1000",
        "100101"
      ],
      [
        "10000011",
        "01001"
      ],
      [
        "10",
        "1001"
      ],
      [
        "10",
        "1000"
      ],
      [
        "0010000",
        "101001"
      ],
      [
        "000011",
        "100"
      ],
      [
        "01100",
        "011"
      ],
      [
        "00010000",
        "01001"
      ],
      [
        "10011",
        "0"
      ],
      [
        "1000000",
        "011101"
      ],
      [
        "100011",
        "0"
      ],
      [
        "1101",
        "1000100101"
      ],
      [
        "0111",
        "100101"
      ],
      [
        "01010000",
        "100100"
      ],
      [
        "000010011",
        "1001"
      ],
      [
        "0011000",
        "100"
      ],
      [
        "1",
        "011"
      ],
      [
        "1",
        "10001"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "1000"
      ],
      [
        "11",
        "010000"
      ],
      [
        "0000",
        "000011"
      ],
      [
        "0000",
        "000"
      ],
      [
        "0000",
        "00011"
      ],
      [
        "01",
        "01"
      ]
    ]
  }
}