{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "001": 6,
      "011": 7,
      "00100": 8,
      "0100": 9,
      "001100": 10,
      "0000": 11,
      "1001": 12,
      "0011": 13,
      "00011": 14,
      "01100": 15,
      "11": 16,
      "00001": 17,
      "0000100": 18,
      "10": 19,
      "00001100": 20,
      "010": 21,
      "0011100": 22,
      "100110": 23,
      "000011000": 24,
      "1100": 25,
      "0001100": 26,
      "0011000100": 27,
      "00110000011": 28,
      "0001": 29,
      "000100": 30,
      "01011": 31,
      "0110": 32,
      "00100011": 33,
      "00000011": 34,
      "0010000100": 35,
      "01001": 36,
      "000110": 37,
      "000": 38,
      "100001": 39,
      "01010": 40,
      "00110000001": 41,
      "00111000011": 42,
      "1000010": 43,
      "10000001": 44,
      "0101100": 45,
      "001000001100": 46,
      "001000101100": 47,
      "0011000110": 48,
      "0000010": 49,
      "000010": 50,
      "00001001": 51,
      "000010000": 52,
      "100011": 53,
      "1000100": 54,
      "1000000": 55,
      "10000011": 56,
      "1000110": 57,
      "0101": 58,
      "010100": 59,
      "01110": 60,
      "001000000100": 61,
      "01000": 62,
      "00000001": 63,
      "111": 64,
      "0000100001": 65,
      "000011001": 66,
      "0001100100": 67,
      "10100": 68,
      "000011100": 69,
      "1000": 70,
      "100010": 71,
      "01100110": 72,
      "011100": 73,
      "01111": 74,
      "01000011": 75,
      "01000001100100": 76,
      "00110011": 77,
      "00000000": 78,
      "000111000": 79,
      "01100100": 80,
      "0011100100": 81,
      "11000": 82,
      "00010001100110": 83,
      "001000111100": 84,
      "0000100101001": 85,
      "010100001": 86,
      "0000000101001": 87,
      "0000100001011": 88,
      "101": 89,
      "11001": 90,
      "101100": 91,
      "1011100": 92,
      "000011": 93,
      "00010": 94,
      "100100": 95,
      "1000000100001": 96,
      "0101011": 97,
      "00101": 98,
      "01101": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "1"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "100"
      ],
      [
        "0",
        "100"
      ],
      [
        "001",
        "100"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "1"
      ],
      [
        "001",
        "1"
      ],
      [
        "00",
        "011"
      ],
      [
        "01",
        "100"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "001"
      ],
      [
        "00",
        "00100"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "001100"
      ],
      [
        "01",
        "0"
      ],
      [
        "0011",
        "100"
      ],
      [
        "1001",
        "10"
      ],
      [
        "00001100",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "01100"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "001100",
        "00011"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "0100"
      ],
      [
        "01",
        "011"
      ],
      [
        "011",
        "0"
      ],
      [
        "00100",
        "011"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "00100",
        "00100"
      ],
      [
        "0100",
        "1"
      ],
      [
        "00011",
        "0"
      ],
      [
        "00",
        "0"
      ],
      [
        "100",
        "001"
      ],
      [
        "01",
        "010"
      ],
      [
        "001100",
        "00001"
      ],
      [
        "0011100",
        "0011"
      ],
      [
        "100001",
        "0"
      ],
      [
        "100",
        "00001"
      ],
      [
        "01",
        "01100"
      ],
      [
        "00100",
        "0001100"
      ],
      [
        "00100",
        "0101100"
      ],
      [
        "001100",
        "0110"
      ],
      [
        "0000",
        "010"
      ],
      [
        "00001",
        "0"
      ],
      [
        "0000100",
        "1"
      ],
      [
        "0000100",
        "00"
      ],
      [
        "100",
        "011"
      ],
      [
        "100",
        "0100"
      ],
      [
        "100",
        "0000"
      ],
      [
        "100",
        "00011"
      ],
      [
        "100",
        "0110"
      ],
      [
        "01",
        "01"
      ],
      [
        "01",
        "0100"
      ],
      [
        "011",
        "10"
      ],
      [
        "00100",
        "0000100"
      ],
      [
        "0100",
        "0"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "11",
        "1"
      ],
      [
        "0000100",
        "001"
      ],
      [
        "00001100",
        "1"
      ],
      [
        "0001100",
        "100"
      ],
      [
        "1",
        "0100"
      ],
      [
        "00",
        "0011100"
      ],
      [
        "100",
        "0"
      ],
      [
        "100",
        "010"
      ],
      [
        "01",
        "100110"
      ],
      [
        "011",
        "100"
      ],
      [
        "011",
        "11"
      ],
      [
        "0100",
        "0011"
      ],
      [
        "0100",
        "0001100100"
      ],
      [
        "001100",
        "11"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "00011",
        "1000"
      ],
      [
        "01100",
        "100"
      ],
      [
        "0011100",
        "100"
      ],
      [
        "1100",
        "0"
      ],
      [
        "000100",
        "01100110"
      ],
      [
        "00100011",
        "1100"
      ],
      [
        "00001001",
        "01001"
      ],
      [
        "010100",
        "001"
      ],
      [
        "00000001",
        "01001"
      ],
      [
        "0000100001",
        "011"
      ],
      [
        "1",
        "01"
      ],
      [
        "1",
        "1001"
      ],
      [
        "1",
        "01100"
      ],
      [
        "1",
        "011100"
      ],
      [
        "00",
        "0011"
      ],
      [
        "00",
        "010"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "0000100001"
      ],
      [
        "01",
        "01011"
      ],
      [
        "001",
        "01"
      ],
      [
        "011",
        "01"
      ]
    ]
  }
}