{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "11": 7,
      "0100": 8,
      "1100": 9,
      "0001": 10,
      "1000000": 11,
      "0101": 12,
      "000": 13,
      "10100": 14,
      "1000": 15,
      "000000": 16,
      "00010": 17,
      "101": 18,
      "000100": 19,
      "10001": 20,
      "1000001": 21,
      "1000101": 22,
      "1111": 23,
      "110100": 24,
      "001": 25,
      "1100000": 26,
      "00011": 27,
      "100010111": 28,
      "001100": 29,
      "10": 30,
      "000001": 31,
      "10000001": 32,
      "10101": 33,
      "0011": 34,
      "1001100": 35,
      "00000101": 36,
      "0100000": 37,
      "1001000": 38,
      "010": 39,
      "011100": 40,
      "00000000": 41,
      "1101": 42,
      "1110001": 43,
      "100000001": 44,
      "10100000000": 45,
      "00000011": 46,
      "100011111": 47,
      "00100": 48,
      "011": 49,
      "010100": 50,
      "011000000": 51,
      "00000001": 52,
      "11100": 53,
      "1110101": 54,
      "01000": 55,
      "110010100": 56,
      "000101": 57,
      "10000000001": 58,
      "0000001001100": 59,
      "1011100": 60,
      "10000011100000": 61,
      "10000010100000": 62,
      "0000000001000": 63,
      "11100010": 64,
      "001000000": 65,
      "00101": 66,
      "0010000001": 67,
      "1000100": 68,
      "100000100": 69,
      "100001": 70,
      "10010000001": 71,
      "100100000001": 72,
      "0111": 73,
      "00000": 74,
      "000011": 75,
      "110101": 76,
      "1110100": 77,
      "01000111": 78,
      "11000101": 79,
      "11000011": 80,
      "1100010": 81,
      "10000000011": 82,
      "10000000100000": 83,
      "1010000000": 84,
      "0000001001000": 85,
      "1011000": 86,
      "100010100": 87,
      "10000011": 88,
      "1000001110100": 89,
      "100010110": 90,
      "11111110100": 91,
      "11010011100": 92,
      "110100000011": 93,
      "0011000100": 94,
      "0011000001": 95,
      "0000011001000": 96,
      "1101100": 97,
      "0110000000": 98,
      "111010110": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "01"
      ],
      [
        "100",
        "0000"
      ],
      [
        "01",
        "01"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0100"
      ],
      [
        "100",
        "0"
      ],
      [
        "0000",
        "00"
      ],
      [
        "0001",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "00",
        "0100"
      ],
      [
        "100",
        "01"
      ],
      [
        "100",
        "0001"
      ],
      [
        "100",
        "0101"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "0100"
      ],
      [
        "00",
        "1"
      ],
      [
        "1100",
        "000"
      ],
      [
        "0001",
        "1"
      ],
      [
        "1000101",
        "11"
      ],
      [
        "00",
        "1100"
      ],
      [
        "1",
        "0"
      ],
      [
        "0000",
        "01"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "1",
        "0101"
      ],
      [
        "00",
        "11"
      ],
      [
        "100",
        "1100"
      ],
      [
        "0000",
        "0101"
      ],
      [
        "0100",
        "000"
      ],
      [
        "100",
        "1000"
      ],
      [
        "01",
        "0"
      ],
      [
        "01",
        "1100"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "11",
        "01"
      ],
      [
        "11",
        "10001"
      ],
      [
        "1000000",
        "01"
      ],
      [
        "10100",
        "000000"
      ],
      [
        "000000",
        "11"
      ],
      [
        "10001",
        "1111"
      ],
      [
        "00",
        "100"
      ],
      [
        "01",
        "1"
      ],
      [
        "01",
        "0100"
      ],
      [
        "01",
        "1000000"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "10101"
      ],
      [
        "0100",
        "0"
      ],
      [
        "1100",
        "10100"
      ],
      [
        "0001",
        "01"
      ],
      [
        "1000000",
        "0001"
      ],
      [
        "000000",
        "1001100"
      ],
      [
        "101",
        "1100"
      ],
      [
        "1000001",
        "1100000"
      ],
      [
        "1000001",
        "0100000"
      ],
      [
        "00000000",
        "01000"
      ],
      [
        "1110001",
        "0"
      ],
      [
        "00",
        "1000000"
      ],
      [
        "00",
        "101"
      ],
      [
        "00",
        "10000001"
      ],
      [
        "100",
        "0100"
      ],
      [
        "100",
        "000100"
      ],
      [
        "100",
        "001"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "100",
        "100000001"
      ],
      [
        "01",
        "11"
      ],
      [
        "0000",
        "0"
      ],
      [
        "0000",
        "11"
      ],
      [
        "11",
        "0101"
      ],
      [
        "11",
        "10100"
      ],
      [
        "0100",
        "0111"
      ],
      [
        "1100",
        "0101"
      ],
      [
        "1100",
        "0011"
      ],
      [
        "1100",
        "010"
      ],
      [
        "1000000",
        "0011"
      ],
      [
        "1000000",
        "0100000"
      ],
      [
        "10100",
        "00000"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "101",
        "1000"
      ],
      [
        "10001",
        "0100"
      ],
      [
        "1000001",
        "1"
      ],
      [
        "1000001",
        "110100"
      ],
      [
        "1000101",
        "10"
      ],
      [
        "1111",
        "1110100"
      ],
      [
        "110100",
        "11100"
      ],
      [
        "110100",
        "000011"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "001100",
        "0001"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "1101",
        "100"
      ],
      [
        "011000000",
        "0"
      ],
      [
        "1110101",
        "10"
      ]
    ]
  }
}