{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "11": 7,
      "0100": 8,
      "1100": 9,
      "0001": 10,
      "0101": 11,
      "01100": 12,
      "00100": 13,
      "000": 14,
      "10100": 15,
      "1000101": 16,
      "00011": 17,
      "011000000": 18,
      "001": 19,
      "0111": 20,
      "00010": 21,
      "000100": 22,
      "1000": 23,
      "1000000": 24,
      "1000100": 25,
      "11100": 26,
      "001100": 27,
      "100010111": 28,
      "0110000000": 29,
      "10": 30,
      "0011": 31,
      "010": 32,
      "011100": 33,
      "00000000": 34,
      "01000": 35,
      "11000000": 36,
      "100010110": 37,
      "100100": 38,
      "100001": 39,
      "00000101": 40,
      "000000100": 41,
      "0100000": 42,
      "101000000": 43,
      "0110000001": 44,
      "100000100": 45,
      "000001100": 46,
      "00000111": 47,
      "110111": 48,
      "0000000001000": 49,
      "101100": 50,
      "10110000001": 51,
      "010100": 52,
      "110100": 53,
      "001000": 54,
      "0010000100": 55,
      "10000000100000": 56,
      "011100000": 57,
      "0000001001000": 58,
      "0000011001000": 59,
      "10111": 60,
      "10110000000": 61,
      "1000001": 62,
      "1000111": 63,
      "100110111": 64,
      "00000001": 65,
      "111": 66,
      "111100": 67,
      "110101": 68,
      "1101100": 69,
      "1110100": 70,
      "110000": 71,
      "000101": 72,
      "101000": 73,
      "10100000101": 74,
      "100010000010": 75,
      "11100010": 76,
      "11100011100000": 77,
      "00111": 78,
      "110000000011": 79,
      "10010000011": 80,
      "1000010": 81,
      "10000101": 82,
      "0000001001100": 83,
      "10100000000": 84,
      "10100000001": 85,
      "100000100001": 86,
      "010100001": 87,
      "100011111": 88,
      "11101001": 89,
      "10101": 90,
      "1011000000": 91,
      "1011100": 92,
      "100000": 93,
      "10010100": 94,
      "10000011": 95,
      "1001000000": 96,
      "100001100": 97,
      "10000111": 98,
      "100010100001": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "01"
      ],
      [
        "01",
        "01"
      ],
      [
        "01",
        "100"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0100"
      ],
      [
        "100",
        "0101"
      ],
      [
        "0001",
        "1"
      ],
      [
        "01100",
        "0000"
      ],
      [
        "00",
        "1"
      ],
      [
        "01",
        "11"
      ],
      [
        "0001",
        "0"
      ],
      [
        "00",
        "0100"
      ],
      [
        "100",
        "0"
      ],
      [
        "100",
        "0000"
      ],
      [
        "100",
        "0100"
      ],
      [
        "11",
        "100"
      ],
      [
        "00",
        "1100"
      ],
      [
        "1000101",
        "11"
      ],
      [
        "011000000",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "11"
      ],
      [
        "01",
        "0"
      ],
      [
        "01",
        "1100"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0100",
        "0"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "1000101",
        "10"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "001"
      ],
      [
        "0000",
        "0101"
      ],
      [
        "0000",
        "00100"
      ],
      [
        "0100",
        "000"
      ],
      [
        "10100",
        "0000"
      ],
      [
        "011000000",
        "1"
      ],
      [
        "100",
        "000100"
      ],
      [
        "0000",
        "01100"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "11",
        "0111"
      ],
      [
        "00000000",
        "01000"
      ],
      [
        "1",
        "01100"
      ],
      [
        "1",
        "0110000001"
      ],
      [
        "01",
        "0100"
      ],
      [
        "11",
        "0100"
      ],
      [
        "00100",
        "0"
      ],
      [
        "00100",
        "00100"
      ],
      [
        "1000000",
        "0100000"
      ],
      [
        "011100",
        "000"
      ],
      [
        "000000100",
        "1000"
      ],
      [
        "000001100",
        "1000"
      ],
      [
        "1",
        "0111"
      ],
      [
        "1",
        "0110000000"
      ],
      [
        "100",
        "0001"
      ],
      [
        "100",
        "0111"
      ],
      [
        "100",
        "110111"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "11",
        "1"
      ],
      [
        "11",
        "1100"
      ],
      [
        "11",
        "0101"
      ],
      [
        "11",
        "01100"
      ],
      [
        "11",
        "10100"
      ],
      [
        "1100",
        "00"
      ],
      [
        "0001",
        "01"
      ],
      [
        "10100",
        "0"
      ],
      [
        "10100",
        "000101"
      ],
      [
        "1000100",
        "00010"
      ],
      [
        "11100",
        "010"
      ],
      [
        "11100",
        "011100000"
      ],
      [
        "0011",
        "1"
      ],
      [
        "11000000",
        "0011"
      ],
      [
        "100100",
        "00011"
      ],
      [
        "100001",
        "0"
      ],
      [
        "100001",
        "01"
      ],
      [
        "000000100",
        "1100"
      ],
      [
        "101000000",
        "00"
      ],
      [
        "101000000",
        "01"
      ],
      [
        "100000100",
        "001"
      ],
      [
        "010100",
        "001"
      ],
      [
        "1000111",
        "11"
      ],
      [
        "1110100",
        "1"
      ],
      [
        "1",
        "0101"
      ],
      [
        "1",
        "011000000"
      ],
      [
        "1",
        "011100"
      ],
      [
        "100",
        "000"
      ],
      [
        "100",
        "10100"
      ],
      [
        "100",
        "00011"
      ],
      [
        "100",
        "1000000"
      ],
      [
        "100",
        "001100"
      ],
      [
        "100",
        "00111"
      ],
      [
        "100",
        "010100001"
      ]
    ]
  }
}