{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "1100": 7,
      "011": 8,
      "0100": 9,
      "1001": 10,
      "10000": 11,
      "001100": 12,
      "11": 13,
      "10": 14,
      "000": 15,
      "01100": 16,
      "00011": 17,
      "010": 18,
      "11100": 19,
      "00100": 20,
      "011100": 21,
      "00001": 22,
      "000000": 23,
      "0011000100": 24,
      "11000": 25,
      "0010000": 26,
      "0000100": 27,
      "0011": 28,
      "01011": 29,
      "000011000": 30,
      "00110000001": 31,
      "000110": 32,
      "0110": 33,
      "00100011": 34,
      "000100": 35,
      "000010000": 36,
      "10000011": 37,
      "1000010": 38,
      "101": 39,
      "0011100": 40,
      "01010": 41,
      "101100": 42,
      "001": 43,
      "1000000": 44,
      "010100": 45,
      "011001": 46,
      "000010": 47,
      "0000000": 48,
      "00110000011": 49,
      "001000000100": 50,
      "0111001": 51,
      "001000001100": 52,
      "00111000011": 53,
      "1011100": 54,
      "00011100": 55,
      "100010": 56,
      "00001001": 57,
      "0000010": 58,
      "110001": 59,
      "01000": 60,
      "10011": 61,
      "0011000110": 62,
      "0110001": 63,
      "0000000111001": 64,
      "0000100110001": 65,
      "10111000011": 66,
      "000111000": 67,
      "001001": 68,
      "0001100": 69,
      "00010": 70,
      "000011100": 71,
      "1100010": 72,
      "01110": 73,
      "01001": 74,
      "0100100": 75,
      "01001001": 76,
      "010000011": 77,
      "100110": 78,
      "100000": 79,
      "111": 80,
      "1110": 81,
      "001000100100": 82,
      "00000011": 83,
      "000000010100": 84,
      "0000000110001": 85,
      "0010000100": 86,
      "001000011100": 87,
      "0000000101001": 88,
      "0001": 89,
      "0010": 90,
      "00011001": 91,
      "1000100": 92,
      "10000001": 93,
      "1000110": 94,
      "0101": 95,
      "0101100": 96,
      "00000000": 97,
      "00001100": 98,
      "0000000110": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "01",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "100",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "00",
        "1100"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "0"
      ],
      [
        "01",
        "100"
      ],
      [
        "00",
        "011"
      ],
      [
        "01",
        "0"
      ],
      [
        "1",
        "1100"
      ],
      [
        "00",
        "100"
      ],
      [
        "01",
        "1100"
      ],
      [
        "0000",
        "1"
      ],
      [
        "0000",
        "00"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "1100",
        "0"
      ],
      [
        "00",
        "10000"
      ],
      [
        "0000",
        "100"
      ],
      [
        "00",
        "11"
      ],
      [
        "01",
        "011"
      ],
      [
        "0000",
        "11000"
      ],
      [
        "001100",
        "00001"
      ],
      [
        "00011",
        "0"
      ],
      [
        "011",
        "0"
      ],
      [
        "00100",
        "011"
      ],
      [
        "00",
        "0100"
      ],
      [
        "0000",
        "10000"
      ],
      [
        "10000",
        "011"
      ],
      [
        "10000",
        "10"
      ],
      [
        "1",
        "01"
      ],
      [
        "00",
        "11100"
      ],
      [
        "01",
        "010"
      ],
      [
        "1",
        "01100"
      ],
      [
        "00",
        "1"
      ],
      [
        "100",
        "0000"
      ],
      [
        "01",
        "0100"
      ],
      [
        "01",
        "1001"
      ],
      [
        "0000",
        "10"
      ],
      [
        "0000",
        "000"
      ],
      [
        "001100",
        "00011"
      ],
      [
        "00100",
        "0000100"
      ],
      [
        "011100",
        "1"
      ],
      [
        "0010000",
        "01100"
      ],
      [
        "0011100",
        "0011"
      ],
      [
        "1",
        "011100"
      ],
      [
        "00",
        "011100"
      ],
      [
        "100",
        "010"
      ],
      [
        "0000",
        "1001"
      ],
      [
        "0000",
        "010"
      ],
      [
        "1100",
        "01"
      ],
      [
        "0100",
        "0"
      ],
      [
        "1001",
        "1"
      ],
      [
        "001100",
        "0110"
      ],
      [
        "01100",
        "01"
      ],
      [
        "000000",
        "0111001"
      ],
      [
        "0000100",
        "110001"
      ],
      [
        "1011100",
        "0011"
      ],
      [
        "00011100",
        "0"
      ],
      [
        "00",
        "1001"
      ],
      [
        "00",
        "01100"
      ],
      [
        "00",
        "010"
      ],
      [
        "0000",
        "11100"
      ],
      [
        "1100",
        "010"
      ],
      [
        "011",
        "10"
      ],
      [
        "0100",
        "1"
      ],
      [
        "0100",
        "100"
      ],
      [
        "0100",
        "1001"
      ],
      [
        "0100",
        "00011"
      ],
      [
        "1001",
        "10"
      ],
      [
        "10000",
        "0"
      ],
      [
        "11",
        "1"
      ],
      [
        "11",
        "10"
      ],
      [
        "00100",
        "0100100"
      ],
      [
        "000000",
        "11"
      ],
      [
        "000000",
        "010100"
      ],
      [
        "000000",
        "0110001"
      ],
      [
        "0010000",
        "100"
      ],
      [
        "0010000",
        "11100"
      ],
      [
        "000000010100",
        "1"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "10"
      ],
      [
        "00",
        "011001"
      ],
      [
        "100",
        "0100"
      ],
      [
        "100",
        "00001"
      ],
      [
        "100",
        "0110"
      ],
      [
        "01",
        "01"
      ],
      [
        "01",
        "01100"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0000",
        "1100"
      ],
      [
        "0000",
        "000110"
      ]
    ]
  }
}