{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "001": 6,
      "011": 7,
      "00100": 8,
      "1001": 9,
      "10000": 10,
      "0100": 11,
      "0000": 12,
      "11": 13,
      "001100": 14,
      "01100": 15,
      "0000100": 16,
      "0011": 17,
      "00110000": 18,
      "010": 19,
      "0110": 20,
      "00100011": 21,
      "10": 22,
      "00110000011": 23,
      "0011000100": 24,
      "000010000": 25,
      "000": 26,
      "00001": 27,
      "100001": 28,
      "100110": 29,
      "01100011": 30,
      "0011100": 31,
      "01001": 32,
      "1100": 33,
      "101": 34,
      "00011": 35,
      "01100100": 36,
      "1000010": 37,
      "00001100": 38,
      "000110": 39,
      "100010": 40,
      "1000110": 41,
      "0010000100": 42,
      "00110000001": 43,
      "000011000": 44,
      "0001": 45,
      "1000100": 46,
      "100000": 47,
      "0000010": 48,
      "1101": 49,
      "0011000110": 50,
      "000010011": 51,
      "001000111100": 52,
      "000100": 53,
      "0001100": 54,
      "1000": 55,
      "100100": 56,
      "10001001": 57,
      "01100000": 58,
      "01101": 59,
      "00100001": 60,
      "001000001100": 61,
      "1000000100001": 62,
      "00000": 63,
      "00000011": 64,
      "11100": 65,
      "000111000": 66,
      "1011": 67,
      "110000": 68,
      "00010": 69,
      "010100": 70,
      "0101100100": 71,
      "01110": 72,
      "001001001": 73,
      "001000000100": 74,
      "001000011100": 75,
      "001001000100": 76,
      "100111": 77,
      "1000000": 78,
      "10000011": 79,
      "10000001100": 80,
      "01000": 81,
      "0000000": 82,
      "00000001": 83,
      "01100001": 84,
      "001000111101": 85,
      "000011001": 86,
      "0011100100": 87,
      "00111000011": 88,
      "0000100111001": 89,
      "11100011": 90,
      "01010001100100": 91,
      "10000001100100": 92,
      "010000": 93,
      "11001": 94,
      "000011100": 95,
      "0001100100": 96,
      "10001": 97,
      "10010000": 98,
      "1000011": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "1"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "100"
      ],
      [
        "100",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "0",
        "100"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "001",
        "100"
      ],
      [
        "01",
        "100"
      ],
      [
        "00",
        "00100"
      ],
      [
        "001",
        "1"
      ],
      [
        "001",
        "10000"
      ],
      [
        "01",
        "0"
      ],
      [
        "011",
        "0"
      ],
      [
        "00100",
        "011"
      ],
      [
        "1",
        "0"
      ],
      [
        "00110000",
        "011"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "0000100",
        "00"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "001"
      ],
      [
        "100",
        "001"
      ],
      [
        "1001",
        "10"
      ],
      [
        "01100",
        "011"
      ],
      [
        "0011",
        "100"
      ],
      [
        "0",
        "1001"
      ],
      [
        "1",
        "100"
      ],
      [
        "1",
        "01"
      ],
      [
        "00",
        "011"
      ],
      [
        "01100",
        "100"
      ],
      [
        "100001",
        "0"
      ],
      [
        "00",
        "001100"
      ],
      [
        "00",
        "0110"
      ],
      [
        "100",
        "010"
      ],
      [
        "100",
        "0110"
      ],
      [
        "00100",
        "00100"
      ],
      [
        "00110000",
        "001"
      ],
      [
        "00001100",
        "0"
      ],
      [
        "00",
        "01"
      ],
      [
        "100",
        "0100"
      ],
      [
        "10000",
        "0"
      ],
      [
        "0000",
        "010"
      ],
      [
        "11",
        "01"
      ],
      [
        "001100",
        "0110"
      ],
      [
        "0000100",
        "11"
      ],
      [
        "00100011",
        "1100"
      ],
      [
        "00",
        "0100"
      ],
      [
        "00",
        "01100"
      ],
      [
        "100",
        "0"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "01001"
      ],
      [
        "01",
        "100000"
      ],
      [
        "011",
        "01"
      ],
      [
        "00100",
        "001"
      ],
      [
        "00100",
        "0001100"
      ],
      [
        "10000",
        "00100001"
      ],
      [
        "0000",
        "0"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "11",
        "100"
      ],
      [
        "00011",
        "1000"
      ],
      [
        "1",
        "011"
      ],
      [
        "1",
        "10000"
      ],
      [
        "00",
        "010"
      ],
      [
        "01",
        "0100"
      ],
      [
        "01",
        "01100100"
      ],
      [
        "011",
        "10"
      ],
      [
        "00100",
        "1001"
      ],
      [
        "00100",
        "0000100"
      ],
      [
        "00100",
        "0011100"
      ],
      [
        "00100",
        "1000100"
      ],
      [
        "1001",
        "11"
      ],
      [
        "10000",
        "00"
      ],
      [
        "10000",
        "011"
      ],
      [
        "10000",
        "001100"
      ],
      [
        "0100",
        "0"
      ],
      [
        "0000",
        "000"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "01100",
        "001"
      ],
      [
        "00100011",
        "1101"
      ],
      [
        "00001",
        "1001"
      ],
      [
        "0011100",
        "100"
      ],
      [
        "0011100",
        "0011"
      ],
      [
        "000010011",
        "1001"
      ],
      [
        "11100",
        "011"
      ],
      [
        "010100",
        "01100100"
      ],
      [
        "10000001100",
        "100"
      ],
      [
        "0",
        "10000"
      ],
      [
        "1",
        "1001"
      ],
      [
        "00",
        "0011100"
      ],
      [
        "00",
        "01100100"
      ],
      [
        "100",
        "01"
      ],
      [
        "100",
        "10000"
      ],
      [
        "100",
        "0011"
      ]
    ]
  }
}