{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "11": 7,
      "0000": 8,
      "10001": 9,
      "1100": 10,
      "0001": 11,
      "110000": 12,
      "10": 13,
      "1000": 14,
      "1000000": 15,
      "000001": 16,
      "1000001": 17,
      "010001": 18,
      "00010": 19,
      "000000": 20,
      "101": 21,
      "100000": 22,
      "0111": 23,
      "100001": 24,
      "10000001": 25,
      "1100000": 26,
      "11000001": 27,
      "01000": 28,
      "000": 29,
      "1000111": 30,
      "0011000001": 31,
      "10011": 32,
      "1001100": 33,
      "00011": 34,
      "10000000": 35,
      "110001": 36,
      "001100": 37,
      "100010111": 38,
      "1001": 39,
      "10010000001": 40,
      "0110": 41,
      "1000010": 42,
      "10000000001": 43,
      "10000010001": 44,
      "1101000": 45,
      "100011": 46,
      "000101": 47,
      "00000101": 48,
      "01000101": 49,
      "100011110": 50,
      "10010": 51,
      "1001000": 52,
      "1000011": 53,
      "00000000": 54,
      "100010110": 55,
      "11000000": 56,
      "11000011": 57,
      "10000011100000": 58,
      "01000111": 59,
      "100000100001": 60,
      "100011111": 61,
      "1001101": 62,
      "10000000100000": 63,
      "1100010": 64,
      "100000100011": 65,
      "0000000001000": 66,
      "01000001": 67,
      "01001101": 68,
      "0010000001": 69,
      "1001001": 70,
      "0111000000": 71,
      "10000000000": 72,
      "1101": 73,
      "1110001": 74,
      "1101000101": 75,
      "10001010001": 76,
      "11001000001": 77,
      "1100001": 78,
      "10100000": 79,
      "101001": 80,
      "10001000001": 81,
      "00000111": 82,
      "0000011001100": 83,
      "00000011": 84,
      "0000001001100": 85,
      "0000001101000": 86,
      "1011100": 87,
      "1010111": 88,
      "10110000000": 89,
      "000100": 90,
      "0001000001": 91,
      "10010100001": 92,
      "100000000001": 93,
      "0100000": 94,
      "010010": 95,
      "01000011": 96,
      "001": 97,
      "0011": 98,
      "001000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "01"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "01"
      ],
      [
        "1",
        "10000"
      ],
      [
        "1",
        "0"
      ],
      [
        "100",
        "0"
      ],
      [
        "10000",
        "00"
      ],
      [
        "0000",
        "01"
      ],
      [
        "10000",
        "01"
      ],
      [
        "0",
        "10001"
      ],
      [
        "0001",
        "0"
      ],
      [
        "0000",
        "00"
      ],
      [
        "1",
        "01"
      ],
      [
        "10000",
        "0"
      ],
      [
        "01",
        "11"
      ],
      [
        "10000",
        "1"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "110000",
        "0"
      ],
      [
        "110000",
        "01"
      ],
      [
        "0",
        "1000"
      ],
      [
        "00",
        "0"
      ],
      [
        "10001",
        "11"
      ],
      [
        "00",
        "11000001"
      ],
      [
        "100",
        "11"
      ],
      [
        "100",
        "1100"
      ],
      [
        "0001",
        "1"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "1",
        "10001"
      ],
      [
        "00",
        "1100"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "100",
        "1"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "01",
        "10"
      ],
      [
        "10000",
        "10"
      ],
      [
        "10000",
        "000001"
      ],
      [
        "10000",
        "010001"
      ],
      [
        "11",
        "01000"
      ],
      [
        "10001",
        "1"
      ],
      [
        "0001",
        "01"
      ],
      [
        "000001",
        "01"
      ],
      [
        "010001",
        "01"
      ],
      [
        "1000111",
        "10"
      ],
      [
        "100",
        "10"
      ],
      [
        "100",
        "1000"
      ],
      [
        "10000",
        "11"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "110000",
        "00"
      ],
      [
        "110000",
        "11"
      ],
      [
        "1000001",
        "1100000"
      ],
      [
        "010001",
        "11"
      ],
      [
        "100000",
        "100001"
      ],
      [
        "1000111",
        "11"
      ],
      [
        "10011",
        "01"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "110001",
        "0"
      ],
      [
        "10000010001",
        "1"
      ],
      [
        "00000000",
        "01000"
      ],
      [
        "0",
        "1000001"
      ],
      [
        "0",
        "1001101"
      ],
      [
        "00",
        "10000001"
      ],
      [
        "100",
        "1001"
      ],
      [
        "01",
        "11000000"
      ],
      [
        "10000",
        "000000"
      ],
      [
        "11",
        "01"
      ],
      [
        "11",
        "10001"
      ],
      [
        "11",
        "01000101"
      ],
      [
        "10001",
        "010001"
      ],
      [
        "1100",
        "1000001"
      ],
      [
        "110000",
        "1"
      ],
      [
        "10",
        "100000"
      ],
      [
        "10",
        "1001"
      ],
      [
        "1000",
        "1000001"
      ],
      [
        "000001",
        "11"
      ],
      [
        "000001",
        "1001100"
      ],
      [
        "000000",
        "11"
      ],
      [
        "000000",
        "1001100"
      ],
      [
        "000000",
        "1101000"
      ],
      [
        "101",
        "1100"
      ],
      [
        "101",
        "0111"
      ],
      [
        "101",
        "10000000"
      ],
      [
        "000",
        "100"
      ],
      [
        "000",
        "1000001"
      ],
      [
        "10010",
        "100001"
      ],
      [
        "10000000000",
        "1"
      ],
      [
        "0",
        "100000"
      ],
      [
        "0",
        "10010"
      ],
      [
        "0",
        "1000011"
      ],
      [
        "00",
        "1"
      ],
      [
        "00",
        "11"
      ],
      [
        "00",
        "1000"
      ]
    ]
  }
}