{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "11": 7,
      "0100": 8,
      "1100": 9,
      "0001": 10,
      "000": 11,
      "1000000": 12,
      "1000": 13,
      "101": 14,
      "10001": 15,
      "000000": 16,
      "00010": 17,
      "10100": 18,
      "10": 19,
      "0111": 20,
      "10000": 21,
      "1000001": 22,
      "1001000": 23,
      "000001": 24,
      "111100": 25,
      "1000100": 26,
      "010": 27,
      "0110": 28,
      "00000011": 29,
      "00011": 30,
      "10000000": 31,
      "0000001001000": 32,
      "000100": 33,
      "001100": 34,
      "100100": 35,
      "100000": 36,
      "00000001": 37,
      "1111": 38,
      "01000": 39,
      "0100000": 40,
      "100010110": 41,
      "10000011100": 42,
      "0011": 43,
      "1001100": 44,
      "011": 45,
      "010100": 46,
      "1101": 47,
      "101100": 48,
      "100001": 49,
      "1000010": 50,
      "1111000000": 51,
      "001000": 52,
      "011000": 53,
      "0110000000": 54,
      "00000000": 55,
      "11101": 56,
      "1110001": 57,
      "1110": 58,
      "1100100": 59,
      "11000011": 60,
      "100010111": 61,
      "100011110": 62,
      "101000000": 63,
      "10100000001": 64,
      "0000011001000": 65,
      "10000011100010": 66,
      "0000000001000": 67,
      "010110": 68,
      "0000000": 69,
      "00000111": 70,
      "111000000": 71,
      "1110000000": 72,
      "11100000": 73,
      "1101000": 74,
      "010000": 75,
      "0100010": 76,
      "0100011": 77,
      "1100000": 78,
      "1100101": 79,
      "10000001": 80,
      "10000000100000": 81,
      "10111": 82,
      "1010100": 83,
      "1011000100": 84,
      "101010110": 85,
      "0000001001100": 86,
      "10100000000": 87,
      "10100100000": 88,
      "10100011": 89,
      "10000011": 90,
      "100100100001": 91,
      "10000011100000": 92,
      "110110111": 93,
      "11110000001": 94,
      "111010111": 95,
      "1010000000": 96,
      "00100": 97,
      "0010100": 98,
      "001001100": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "0"
      ],
      [
        "100",
        "0000"
      ],
      [
        "100",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "100",
        "01"
      ],
      [
        "0000",
        "00"
      ],
      [
        "0001",
        "0"
      ],
      [
        "1",
        "0100"
      ],
      [
        "1",
        "0"
      ],
      [
        "01",
        "11"
      ],
      [
        "100",
        "00"
      ],
      [
        "100",
        "0001"
      ],
      [
        "100",
        "1000"
      ],
      [
        "0000",
        "01"
      ],
      [
        "11",
        "1100"
      ],
      [
        "100",
        "0100"
      ],
      [
        "01",
        "0"
      ],
      [
        "01",
        "10"
      ],
      [
        "000000",
        "11"
      ],
      [
        "0001",
        "1"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "00",
        "0100"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "000"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "11",
        "11"
      ],
      [
        "0100",
        "0"
      ],
      [
        "0100",
        "000"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "1000001",
        "1100"
      ],
      [
        "00",
        "11"
      ],
      [
        "100",
        "1100"
      ],
      [
        "01",
        "1"
      ],
      [
        "01",
        "0100"
      ],
      [
        "11",
        "01"
      ],
      [
        "101",
        "100"
      ],
      [
        "10000",
        "1"
      ],
      [
        "10000",
        "10"
      ],
      [
        "111100",
        "0000"
      ],
      [
        "00",
        "1000"
      ],
      [
        "01",
        "1000"
      ],
      [
        "01",
        "10000000"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "11",
        "101"
      ],
      [
        "11",
        "10001"
      ],
      [
        "11",
        "10"
      ],
      [
        "1100",
        "100"
      ],
      [
        "1100",
        "0011"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "10001",
        "1110"
      ],
      [
        "10100",
        "0000"
      ],
      [
        "10100",
        "000001"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "10000011100",
        "010"
      ],
      [
        "00000000",
        "01000"
      ],
      [
        "01",
        "0110"
      ],
      [
        "0000",
        "000"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "11",
        "1000000"
      ],
      [
        "11",
        "10000000"
      ],
      [
        "11",
        "100000"
      ],
      [
        "11",
        "01000"
      ],
      [
        "0100",
        "00"
      ],
      [
        "0100",
        "010"
      ],
      [
        "0100",
        "011"
      ],
      [
        "1100",
        "000"
      ],
      [
        "1100",
        "101"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "1000000",
        "0100000"
      ],
      [
        "101",
        "11"
      ],
      [
        "101",
        "0100"
      ],
      [
        "101",
        "1000100"
      ],
      [
        "101",
        "010110"
      ],
      [
        "000000",
        "1001100"
      ],
      [
        "10100",
        "000000"
      ],
      [
        "10100",
        "100000"
      ],
      [
        "10100",
        "011"
      ],
      [
        "1000001",
        "1"
      ],
      [
        "100100",
        "100001"
      ],
      [
        "10000011100",
        "000"
      ],
      [
        "1101",
        "10111"
      ],
      [
        "1111000000",
        "1"
      ],
      [
        "11101",
        "0111"
      ],
      [
        "101000000",
        "0"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "10100"
      ],
      [
        "00",
        "1001100"
      ]
    ]
  }
}