{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "01": 4,
      "0000": 5,
      "11": 6,
      "100": 7,
      "10000": 8,
      "0001": 9,
      "000": 10,
      "101": 11,
      "0101": 12,
      "1101": 13,
      "1100": 14,
      "1000": 15,
      "00000": 16,
      "00010": 17,
      "000001": 18,
      "1000001": 19,
      "1000101": 20,
      "100000001": 21,
      "000000": 22,
      "10001": 23,
      "1101000": 24,
      "10": 25,
      "1100000": 26,
      "00011": 27,
      "100010111": 28,
      "001000": 29,
      "00000101": 30,
      "10000000100000": 31,
      "0011": 32,
      "1001000": 33,
      "1100101": 34,
      "00000111": 35,
      "1000000": 36,
      "100000101": 37,
      "00101": 38,
      "001101": 39,
      "0010001": 40,
      "010000": 41,
      "00001": 42,
      "1111": 43,
      "1001101": 44,
      "100000000": 45,
      "1010": 46,
      "0000011001000": 47,
      "100010110": 48,
      "10000000100010": 49,
      "011000": 50,
      "00000001": 51,
      "110001": 52,
      "10011": 53,
      "11001000001": 54,
      "0000001101000": 55,
      "10001000001": 56,
      "10000010100000": 57,
      "0010001000": 58,
      "100110111": 59,
      "10000000011": 60,
      "001000000": 61,
      "010001": 62,
      "00000000": 63,
      "0000000": 64,
      "1110000": 65,
      "11000": 66,
      "11000000": 67,
      "100100": 68,
      "1001010": 69,
      "10000100": 70,
      "10100": 71,
      "10101": 72,
      "101100": 73,
      "1011000": 74,
      "1011000001": 75,
      "1100100": 76,
      "0000011001010": 77,
      "10000011100000": 78,
      "100000100001": 79,
      "110010111": 80,
      "0011010000": 81,
      "1111000": 82,
      "110010000010": 83,
      "100010000010": 84,
      "0010000001": 85,
      "01000101": 86,
      "10110000011": 87,
      "0010000100": 88,
      "0110000": 89,
      "01000": 90,
      "011100": 91,
      "0111000000": 92,
      "00001101": 93,
      "0000000001": 94,
      "000010011": 95,
      "111000": 96,
      "11100000001": 97,
      "1110": 98,
      "11100000000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "0000"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "01",
        "01"
      ],
      [
        "11",
        "01"
      ],
      [
        "11",
        "00"
      ],
      [
        "100",
        "0"
      ],
      [
        "0000",
        "0"
      ],
      [
        "0001",
        "0"
      ],
      [
        "0000",
        "01"
      ],
      [
        "10000",
        "01"
      ],
      [
        "100",
        "0101"
      ],
      [
        "10000",
        "0001"
      ],
      [
        "0000",
        "00"
      ],
      [
        "100",
        "01"
      ],
      [
        "1101",
        "000"
      ],
      [
        "1",
        "0"
      ],
      [
        "11",
        "00000"
      ],
      [
        "0001",
        "1"
      ],
      [
        "1000101",
        "11"
      ],
      [
        "00",
        "1000"
      ],
      [
        "0000",
        "0101"
      ],
      [
        "100000001",
        "00000"
      ],
      [
        "00",
        "11"
      ],
      [
        "100",
        "1000"
      ],
      [
        "1100",
        "101"
      ],
      [
        "000001",
        "11"
      ],
      [
        "10000",
        "00"
      ],
      [
        "10000",
        "0101"
      ],
      [
        "00",
        "101"
      ],
      [
        "00",
        "1101"
      ],
      [
        "00",
        "10001"
      ],
      [
        "01",
        "0000"
      ],
      [
        "0000",
        "1"
      ],
      [
        "11",
        "11"
      ],
      [
        "100",
        "1101"
      ],
      [
        "10000",
        "0000"
      ],
      [
        "101",
        "0"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "1000101",
        "10"
      ],
      [
        "100000001",
        "00010"
      ],
      [
        "01",
        "1000"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "11",
        "0001"
      ],
      [
        "100",
        "11"
      ],
      [
        "1100",
        "1000001"
      ],
      [
        "000000",
        "1101000"
      ],
      [
        "10001",
        "000001"
      ],
      [
        "100000101",
        "00000"
      ],
      [
        "0010001",
        "000"
      ],
      [
        "1001101",
        "11"
      ],
      [
        "100000000",
        "11"
      ],
      [
        "00",
        "1000000"
      ],
      [
        "01",
        "0001"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0000",
        "000"
      ],
      [
        "11",
        "10000"
      ],
      [
        "11",
        "000"
      ],
      [
        "11",
        "000000"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "1010"
      ],
      [
        "10000",
        "100"
      ],
      [
        "101",
        "00"
      ],
      [
        "101",
        "01"
      ],
      [
        "101",
        "100"
      ],
      [
        "101",
        "1000"
      ],
      [
        "101",
        "1000001"
      ],
      [
        "1100",
        "100"
      ],
      [
        "000001",
        "1001010"
      ],
      [
        "1000001",
        "1100000"
      ],
      [
        "1000001",
        "00001"
      ],
      [
        "1100101",
        "11"
      ],
      [
        "001101",
        "0000"
      ],
      [
        "1111",
        "000"
      ],
      [
        "11001000001",
        "0"
      ],
      [
        "10001000001",
        "0"
      ],
      [
        "001000000",
        "1"
      ],
      [
        "010001",
        "01"
      ],
      [
        "1011000001",
        "1"
      ],
      [
        "00",
        "10000100"
      ],
      [
        "01",
        "10000"
      ],
      [
        "01",
        "000"
      ],
      [
        "01",
        "1100"
      ],
      [
        "01",
        "11000000"
      ],
      [
        "0000",
        "1101"
      ],
      [
        "0000",
        "000001"
      ],
      [
        "0000",
        "10011"
      ],
      [
        "11",
        "1000"
      ],
      [
        "11",
        "100000001"
      ],
      [
        "11",
        "10"
      ],
      [
        "11",
        "100000000"
      ]
    ]
  }
}