{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "11": 7,
      "0000": 8,
      "1000": 9,
      "1100": 10,
      "000": 11,
      "011": 12,
      "010": 13,
      "1000000": 14,
      "0111": 15,
      "100000": 16,
      "10": 17,
      "101": 18,
      "00011": 19,
      "10001": 20,
      "10011": 21,
      "100001": 22,
      "100100": 23,
      "011000": 24,
      "000000": 25,
      "010100": 26,
      "1001000": 27,
      "0101": 28,
      "00010": 29,
      "0110": 30,
      "100010111": 31,
      "0011": 32,
      "10000000": 33,
      "10100": 34,
      "100110111": 35,
      "110000": 36,
      "001000": 37,
      "1111": 38,
      "00000101": 39,
      "000100": 40,
      "010000": 41,
      "11000000": 42,
      "00100": 43,
      "10000100": 44,
      "11001000": 45,
      "1010000": 46,
      "1001": 47,
      "100010": 48,
      "011001000": 49,
      "1000011001000": 50,
      "00000": 51,
      "00000111": 52,
      "0000011001000": 53,
      "011100000": 54,
      "0101000000": 55,
      "10100000": 56,
      "10101": 57,
      "100010110": 58,
      "100110": 59,
      "00000001": 60,
      "0011010100": 61,
      "10000000100000": 62,
      "1100000": 63,
      "10110": 64,
      "001100": 65,
      "100011": 66,
      "1001000000": 67,
      "011100": 68,
      "0110000000": 69,
      "10000010100": 70,
      "100001111": 71,
      "10000011100000": 72,
      "111100": 73,
      "110111": 74,
      "0000000": 75,
      "1100100": 76,
      "011011100": 77,
      "011111": 78,
      "1011100": 79,
      "10110000100": 80,
      "100100100001": 81,
      "0000001001000": 82,
      "0011011000": 83,
      "11000010100000": 84,
      "11000000100000": 85,
      "10100000000": 86,
      "00000100": 87,
      "1000011111000": 88,
      "01000000": 89,
      "010001": 90,
      "11000": 91,
      "1011": 92,
      "10111": 93,
      "10101000000": 94,
      "0001": 95,
      "10010000": 96,
      "1001100": 97,
      "100101": 98,
      "100100001": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "0"
      ],
      [
        "01",
        "1"
      ],
      [
        "01",
        "0"
      ],
      [
        "10000",
        "00"
      ],
      [
        "01",
        "11"
      ],
      [
        "10000",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "00",
        "011"
      ],
      [
        "100",
        "01"
      ],
      [
        "100",
        "11"
      ],
      [
        "10000",
        "1"
      ],
      [
        "100",
        "100"
      ],
      [
        "01",
        "1000"
      ],
      [
        "0000",
        "00"
      ],
      [
        "010",
        "100"
      ],
      [
        "100",
        "1000"
      ],
      [
        "01",
        "01"
      ],
      [
        "00",
        "010"
      ],
      [
        "011",
        "0"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "00",
        "11"
      ],
      [
        "10000",
        "000"
      ],
      [
        "10",
        "100"
      ],
      [
        "10011",
        "0111"
      ],
      [
        "1",
        "10000"
      ],
      [
        "00",
        "1000"
      ],
      [
        "11",
        "11"
      ],
      [
        "0000",
        "0101"
      ],
      [
        "000",
        "100"
      ],
      [
        "0",
        "10000"
      ],
      [
        "1",
        "1000000"
      ],
      [
        "00",
        "100"
      ],
      [
        "10000",
        "100"
      ],
      [
        "1100",
        "1000"
      ],
      [
        "10",
        "10000"
      ],
      [
        "100",
        "1"
      ],
      [
        "100",
        "010"
      ],
      [
        "01",
        "1001000"
      ],
      [
        "10000",
        "11001000"
      ],
      [
        "0000",
        "0"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "0000",
        "011001000"
      ],
      [
        "011",
        "100000"
      ],
      [
        "010",
        "1000000"
      ],
      [
        "10",
        "100000"
      ],
      [
        "101",
        "01"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "10011",
        "0"
      ],
      [
        "000000",
        "01"
      ],
      [
        "0011",
        "010100"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "1",
        "100000"
      ],
      [
        "1",
        "0110"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "011"
      ],
      [
        "100",
        "1000000"
      ],
      [
        "01",
        "1100"
      ],
      [
        "01",
        "10000000"
      ],
      [
        "10000",
        "010100"
      ],
      [
        "10000",
        "1111"
      ],
      [
        "10000",
        "011100000"
      ],
      [
        "11",
        "1100"
      ],
      [
        "11",
        "0111"
      ],
      [
        "0000",
        "000"
      ],
      [
        "1100",
        "100"
      ],
      [
        "011",
        "011100"
      ],
      [
        "0111",
        "11"
      ],
      [
        "101",
        "1100"
      ],
      [
        "101",
        "10000100"
      ],
      [
        "100100",
        "100001"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "0011",
        "011000"
      ],
      [
        "110000",
        "10100000"
      ],
      [
        "11000000",
        "100000"
      ],
      [
        "1010000",
        "0000"
      ],
      [
        "00000",
        "100"
      ],
      [
        "100001111",
        "1000"
      ],
      [
        "0",
        "1000000"
      ],
      [
        "0",
        "10001"
      ],
      [
        "1",
        "1000"
      ],
      [
        "1",
        "011"
      ],
      [
        "1",
        "0111"
      ],
      [
        "1",
        "0101000000"
      ],
      [
        "00",
        "01"
      ],
      [
        "100",
        "10000"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "101"
      ],
      [
        "100",
        "100001"
      ]
    ]
  }
}