{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "11": 7,
      "0000": 8,
      "10001": 9,
      "10": 10,
      "000": 11,
      "1100": 12,
      "100000": 13,
      "010": 14,
      "1000": 15,
      "1000000": 16,
      "011": 17,
      "0111": 18,
      "100001": 19,
      "00010": 20,
      "1000111": 21,
      "0110": 22,
      "100000000": 23,
      "100010": 24,
      "10000000": 25,
      "000000": 26,
      "100011": 27,
      "00011": 28,
      "1000001": 29,
      "1000010": 30,
      "10000010": 31,
      "000100": 32,
      "101": 33,
      "1001100": 34,
      "1001000": 35,
      "000001": 36,
      "100010111": 37,
      "10000001": 38,
      "100011111": 39,
      "0110100001": 40,
      "0100": 41,
      "0110000000": 42,
      "1000011": 43,
      "10000011": 44,
      "1101": 45,
      "1111": 46,
      "1000101": 47,
      "100011110": 48,
      "01000101": 49,
      "100100": 50,
      "011100": 51,
      "10000100001": 52,
      "111100": 53,
      "000011": 54,
      "000010": 55,
      "0000011": 56,
      "100010110": 57,
      "101000000": 58,
      "100000100011": 59,
      "10000000011": 60,
      "10000000100000": 61,
      "10000010100000": 62,
      "10000010100010": 63,
      "0100000": 64,
      "01000111": 65,
      "110000": 66,
      "1100000": 67,
      "10111": 68,
      "11000111": 69,
      "1100010": 70,
      "11000001": 71,
      "001000": 72,
      "00100000000": 73,
      "11101": 74,
      "00000111": 75,
      "10100000000": 76,
      "10100011": 77,
      "010100": 78,
      "0101000001": 79,
      "0111000000": 80,
      "0110100000": 81,
      "10000000001": 82,
      "0000001001000": 83,
      "00000101": 84,
      "10000001100000": 85,
      "10000011100000": 86,
      "1101100": 87,
      "100100100000": 88,
      "11110011": 89,
      "0000111001000": 90,
      "0000101001100": 91,
      "0000011011100": 92,
      "10100000011": 93,
      "01000": 94,
      "01000010": 95,
      "1010": 96,
      "1100001": 97,
      "1100000000": 98,
      "11000010": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "01"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "10000",
        "0"
      ],
      [
        "01",
        "0"
      ],
      [
        "100",
        "0"
      ],
      [
        "10000",
        "00"
      ],
      [
        "01",
        "1"
      ],
      [
        "01",
        "11"
      ],
      [
        "10000",
        "1"
      ],
      [
        "00",
        "010"
      ],
      [
        "10001",
        "11"
      ],
      [
        "01",
        "10"
      ],
      [
        "10000",
        "0000"
      ],
      [
        "10001",
        "0"
      ],
      [
        "10000",
        "000"
      ],
      [
        "0000",
        "00"
      ],
      [
        "10001",
        "1"
      ],
      [
        "00",
        "011"
      ],
      [
        "10000",
        "01"
      ],
      [
        "10000",
        "10"
      ],
      [
        "10000",
        "010"
      ],
      [
        "000",
        "100"
      ],
      [
        "1",
        "01"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "1000"
      ],
      [
        "0000",
        "01"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "1000111",
        "11"
      ],
      [
        "0110",
        "100001"
      ],
      [
        "0",
        "100"
      ],
      [
        "01",
        "10000000"
      ],
      [
        "10000",
        "11"
      ],
      [
        "10000",
        "011"
      ],
      [
        "11",
        "01"
      ],
      [
        "11",
        "11"
      ],
      [
        "10001",
        "01"
      ],
      [
        "1000111",
        "10"
      ],
      [
        "0",
        "1000101"
      ],
      [
        "100",
        "100"
      ],
      [
        "01",
        "1100"
      ],
      [
        "10000",
        "100001"
      ],
      [
        "11",
        "1100"
      ],
      [
        "0000",
        "11"
      ],
      [
        "0000",
        "10"
      ],
      [
        "0000",
        "011"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "10",
        "1000000"
      ],
      [
        "100000",
        "100011"
      ],
      [
        "100000000",
        "11"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "10000010",
        "100000"
      ],
      [
        "10000010",
        "100010"
      ],
      [
        "0",
        "100000"
      ],
      [
        "0",
        "1000111"
      ],
      [
        "1",
        "10000"
      ],
      [
        "1",
        "100000"
      ],
      [
        "1",
        "0111"
      ],
      [
        "1",
        "1000111"
      ],
      [
        "1",
        "100010"
      ],
      [
        "1",
        "1000001"
      ],
      [
        "00",
        "1000"
      ],
      [
        "00",
        "100000000"
      ],
      [
        "11",
        "101"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "10",
        "100000000"
      ],
      [
        "10",
        "100011"
      ],
      [
        "010",
        "100"
      ],
      [
        "010",
        "1000001"
      ],
      [
        "011",
        "1000000"
      ],
      [
        "0110",
        "100000"
      ],
      [
        "100000000",
        "01"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "000001",
        "01"
      ],
      [
        "10000001",
        "100000"
      ],
      [
        "10000011",
        "100000"
      ],
      [
        "1101",
        "100"
      ],
      [
        "100100",
        "100000"
      ],
      [
        "111100",
        "11"
      ],
      [
        "000011",
        "1001000"
      ],
      [
        "000010",
        "1001100"
      ],
      [
        "0000011",
        "011100"
      ],
      [
        "101000000",
        "11"
      ],
      [
        "0",
        "1000"
      ],
      [
        "0",
        "1000010"
      ],
      [
        "1",
        "010"
      ],
      [
        "1",
        "100001"
      ],
      [
        "1",
        "100000000"
      ],
      [
        "1",
        "1000010"
      ]
    ]
  }
}