{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "11": 7,
      "0001": 8,
      "10001": 9,
      "000": 10,
      "110000": 11,
      "1100": 12,
      "0000": 13,
      "1000": 14,
      "10": 15,
      "101": 16,
      "1100000": 17,
      "0111": 18,
      "00010": 19,
      "000100": 20,
      "100000": 21,
      "000001": 22,
      "1000001": 23,
      "1000000": 24,
      "100010": 25,
      "100010111": 26,
      "000000": 27,
      "100001": 28,
      "100011": 29,
      "1000111": 30,
      "100100": 31,
      "1001100": 32,
      "10000000": 33,
      "100000000": 34,
      "1000101": 35,
      "1011100": 36,
      "10000011100000": 37,
      "10000001": 38,
      "10000000100000": 39,
      "01000101": 40,
      "0011": 41,
      "10000100": 42,
      "00011": 43,
      "000101": 44,
      "11000001": 45,
      "1000100": 46,
      "00000111": 47,
      "10000000011": 48,
      "0100000": 49,
      "1001000": 50,
      "10010000001": 51,
      "01100": 52,
      "0101": 53,
      "100000001": 54,
      "10100000": 55,
      "10100010": 56,
      "10100000001": 57,
      "00000101": 58,
      "0000011001000": 59,
      "10000011": 60,
      "100010100011": 61,
      "00000011": 62,
      "100011110": 63,
      "0100": 64,
      "01000001": 65,
      "0011000001": 66,
      "010111": 67,
      "10000000001": 68,
      "110": 69,
      "11100": 70,
      "1111": 71,
      "11101": 72,
      "11100010": 73,
      "1101100": 74,
      "1100001": 75,
      "11000000": 76,
      "1100000000": 77,
      "110000100010": 78,
      "110000100001": 79,
      "110010000011": 80,
      "00000001": 81,
      "1010111": 82,
      "101010111": 83,
      "0001001001100": 84,
      "0001001011100": 85,
      "0001001101100": 86,
      "10000010100000": 87,
      "100000011": 88,
      "0000001011100": 89,
      "100011111": 90,
      "10010010100000": 91,
      "110000000010": 92,
      "101011110": 93,
      "010000": 94,
      "11000111": 95,
      "001100": 96,
      "0010": 97,
      "00000100": 98,
      "0010000001": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "01"
      ],
      [
        "100",
        "01"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "10000"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "110000",
        "0"
      ],
      [
        "01",
        "11"
      ],
      [
        "0001",
        "0"
      ],
      [
        "000",
        "100"
      ],
      [
        "10000",
        "0"
      ],
      [
        "00",
        "0001"
      ],
      [
        "10000",
        "01"
      ],
      [
        "10000",
        "00"
      ],
      [
        "10001",
        "0"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "0000",
        "00"
      ],
      [
        "10000",
        "1"
      ],
      [
        "10001",
        "1"
      ],
      [
        "10001",
        "11"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "1100"
      ],
      [
        "10000",
        "000"
      ],
      [
        "10000",
        "0000"
      ],
      [
        "10001",
        "01"
      ],
      [
        "101",
        "1100"
      ],
      [
        "1000001",
        "1100000"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "0",
        "1000101"
      ],
      [
        "00",
        "11"
      ],
      [
        "10000",
        "100"
      ],
      [
        "0001",
        "1"
      ],
      [
        "0001",
        "01"
      ],
      [
        "110000",
        "01"
      ],
      [
        "1000",
        "100"
      ],
      [
        "000001",
        "11"
      ],
      [
        "100000000",
        "11"
      ],
      [
        "0",
        "100000"
      ],
      [
        "100",
        "1000"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "01",
        "100"
      ],
      [
        "01",
        "01"
      ],
      [
        "10000",
        "0001"
      ],
      [
        "10",
        "100000"
      ],
      [
        "10",
        "100010"
      ],
      [
        "10",
        "100000001"
      ],
      [
        "000001",
        "01"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "1000001",
        "1"
      ],
      [
        "100010",
        "100011"
      ],
      [
        "000000",
        "11"
      ],
      [
        "1000111",
        "10"
      ],
      [
        "0",
        "100"
      ],
      [
        "0",
        "1000001"
      ],
      [
        "00",
        "11000001"
      ],
      [
        "01",
        "0111"
      ],
      [
        "10000",
        "000001"
      ],
      [
        "11",
        "0"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "101"
      ],
      [
        "11",
        "100010"
      ],
      [
        "11",
        "01100"
      ],
      [
        "110000",
        "1"
      ],
      [
        "110000",
        "00"
      ],
      [
        "110000",
        "0000"
      ],
      [
        "110000",
        "100010"
      ],
      [
        "110000",
        "100001"
      ],
      [
        "1100",
        "10000011"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "101",
        "0111"
      ],
      [
        "101",
        "010111"
      ],
      [
        "000100",
        "1001100"
      ],
      [
        "000100",
        "1011100"
      ],
      [
        "000100",
        "1101100"
      ],
      [
        "1000001",
        "0100000"
      ],
      [
        "1000000",
        "11"
      ],
      [
        "000000",
        "1011100"
      ],
      [
        "1000111",
        "11"
      ],
      [
        "100100",
        "10100000"
      ],
      [
        "1100000000",
        "10"
      ],
      [
        "1010111",
        "10"
      ],
      [
        "0",
        "10000"
      ],
      [
        "1",
        "1000111"
      ],
      [
        "00",
        "1100"
      ],
      [
        "00",
        "10"
      ],
      [
        "00",
        "000100"
      ],
      [
        "00",
        "10000001"
      ]
    ]
  }
}