{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "0000": 6,
      "01": 7,
      "1100": 8,
      "0100": 9,
      "011": 10,
      "1000000": 11,
      "1000": 12,
      "001": 13,
      "000": 14,
      "0111": 15,
      "00011": 16,
      "000100": 17,
      "10001": 18,
      "0101": 19,
      "11100": 20,
      "10100": 21,
      "001100": 22,
      "00100": 23,
      "0001": 24,
      "1111": 25,
      "01100": 26,
      "011100": 27,
      "100010111": 28,
      "001000": 29,
      "00000000": 30,
      "00000101": 31,
      "110000": 32,
      "10000001": 33,
      "100100": 34,
      "11000000": 35,
      "0100001": 36,
      "0100000": 37,
      "11000011100": 38,
      "100011": 39,
      "100001": 40,
      "00000111": 41,
      "000000100": 42,
      "000001100": 43,
      "1100001": 44,
      "01000": 45,
      "0110": 46,
      "100010110": 47,
      "00010": 48,
      "10001111": 49,
      "0000001001000": 50,
      "101": 51,
      "10111": 52,
      "0011": 53,
      "000101": 54,
      "10011": 55,
      "100001100": 56,
      "111100": 57,
      "110010000001": 58,
      "0001001100": 59,
      "101000000": 60,
      "11000011100001": 61,
      "0000011001100": 62,
      "100011110": 63,
      "101100": 64,
      "1000100": 65,
      "1001111": 66,
      "1101": 67,
      "1110001": 68,
      "1111100": 69,
      "0000011": 70,
      "0000000": 71,
      "00000011": 72,
      "11001100": 73,
      "010001100": 74,
      "10000000": 75,
      "10000000101": 76,
      "0001000100": 77,
      "000100001": 78,
      "10100000101": 79,
      "0011000100": 80,
      "00100001": 81,
      "0111000100": 82,
      "0000000001000": 83,
      "100100100001": 84,
      "11000011100000": 85,
      "11000010100001": 86,
      "10110000000": 87,
      "101110100001": 88,
      "100110111": 89,
      "1000011001000": 90,
      "1111000100": 91,
      "10100000001": 92,
      "100111111": 93,
      "11111000100": 94,
      "110011000001": 95,
      "0100011001000": 96,
      "1001100": 97,
      "1001000000": 98,
      "1001000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "1",
        "100"
      ],
      [
        "0",
        "100"
      ],
      [
        "0",
        "11"
      ],
      [
        "100",
        "0000"
      ],
      [
        "100",
        "0"
      ],
      [
        "00",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "011",
        "1"
      ],
      [
        "00",
        "011"
      ],
      [
        "00",
        "0100"
      ],
      [
        "100",
        "01"
      ],
      [
        "01",
        "01"
      ],
      [
        "11",
        "100"
      ],
      [
        "1",
        "0100"
      ],
      [
        "00",
        "1100"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "01"
      ],
      [
        "11",
        "11"
      ],
      [
        "01",
        "100"
      ],
      [
        "011",
        "100"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "00",
        "1000"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0000",
        "0101"
      ],
      [
        "1100",
        "00"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "100",
        "100"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "0100",
        "001"
      ],
      [
        "0100",
        "000"
      ],
      [
        "110000",
        "11100"
      ],
      [
        "100",
        "011"
      ],
      [
        "100",
        "001"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "0000",
        "00100"
      ],
      [
        "0000",
        "01100"
      ],
      [
        "1100",
        "001"
      ],
      [
        "0100",
        "0"
      ],
      [
        "011",
        "0"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "0001",
        "0"
      ],
      [
        "100011",
        "11"
      ],
      [
        "000000100",
        "1000"
      ],
      [
        "1",
        "01"
      ],
      [
        "1",
        "0111"
      ],
      [
        "00",
        "11"
      ],
      [
        "00",
        "0101"
      ],
      [
        "100",
        "11"
      ],
      [
        "100",
        "001100"
      ],
      [
        "11",
        "1100"
      ],
      [
        "1100",
        "10000001"
      ],
      [
        "000100",
        "1100"
      ],
      [
        "10100",
        "0000"
      ],
      [
        "11000011100",
        "001"
      ],
      [
        "000001100",
        "1100"
      ],
      [
        "10001111",
        "0"
      ],
      [
        "1",
        "01100"
      ],
      [
        "100",
        "0100"
      ],
      [
        "100",
        "1111"
      ],
      [
        "11",
        "01"
      ],
      [
        "11",
        "10001"
      ],
      [
        "11",
        "11100"
      ],
      [
        "0000",
        "011"
      ],
      [
        "0000",
        "000"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "1100",
        "1100"
      ],
      [
        "0100",
        "01100"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "1000000",
        "0101"
      ],
      [
        "000100",
        "0100"
      ],
      [
        "000100",
        "001"
      ],
      [
        "10100",
        "000101"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "00100",
        "001"
      ],
      [
        "011100",
        "0100"
      ],
      [
        "00000000",
        "01000"
      ],
      [
        "100100",
        "100001"
      ],
      [
        "11000011100",
        "000"
      ],
      [
        "1100001",
        "0100001"
      ],
      [
        "101",
        "10000000"
      ],
      [
        "10111",
        "0100001"
      ],
      [
        "10011",
        "0111"
      ],
      [
        "100001100",
        "1000"
      ],
      [
        "111100",
        "0100"
      ],
      [
        "101000000",
        "01"
      ],
      [
        "1001111",
        "11"
      ],
      [
        "1111100",
        "0100"
      ],
      [
        "11001100",
        "0001"
      ],
      [
        "010001100",
        "1000"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "1000000"
      ],
      [
        "100",
        "1000"
      ]
    ]
  }
}