{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "000": 6,
      "10": 7,
      "1100": 8,
      "0000": 9,
      "1000": 10,
      "100000": 11,
      "10000": 12,
      "110": 13,
      "111": 14,
      "00000": 15,
      "1000000": 16,
      "100001": 17,
      "00011": 18,
      "100010": 19,
      "10000000": 20,
      "1001000": 21,
      "1110": 22,
      "000000": 23,
      "00010": 24,
      "1100000": 25,
      "000100": 26,
      "0000000": 27,
      "11100000": 28,
      "1010": 29,
      "100010111": 30,
      "00000001": 31,
      "011": 32,
      "001000": 33,
      "100100": 34,
      "1001100": 35,
      "100110": 36,
      "11000000": 37,
      "110100": 38,
      "10000000100000": 39,
      "0000001001000": 40,
      "01100": 41,
      "10100000": 42,
      "10111": 43,
      "100000100001": 44,
      "00000111": 45,
      "100000000": 46,
      "100010110": 47,
      "111100": 48,
      "111110": 49,
      "101": 50,
      "10100": 51,
      "101100": 52,
      "101000": 53,
      "10110": 54,
      "1000100": 55,
      "100011": 56,
      "1101100": 57,
      "000001100": 58,
      "00000101": 59,
      "100100011": 60,
      "11101000": 61,
      "101010111": 62,
      "100110111": 63,
      "110100100001": 64,
      "00100": 65,
      "0011": 66,
      "001100": 67,
      "00110": 68,
      "100100100011": 69,
      "11100": 70,
      "1111": 71,
      "11100000000": 72,
      "1010000000": 73,
      "10100000000": 74,
      "11000": 75,
      "00000000": 76,
      "1000001": 77,
      "10000011100000": 78,
      "1101000": 79,
      "10000001100000": 80,
      "10000000100": 81,
      "0000001101000": 82,
      "0111000000": 83,
      "11000000100000": 84,
      "011000": 85,
      "111110100001": 86,
      "10110000000": 87,
      "10110100001": 88,
      "0000011001000": 89,
      "01": 90,
      "0100010": 91,
      "010100": 92,
      "01000001": 93,
      "0010": 94,
      "1001000000": 95,
      "100101100": 96,
      "11110": 97,
      "11100010": 98,
      "1110000000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "0"
      ],
      [
        "100",
        "000"
      ],
      [
        "100",
        "00"
      ],
      [
        "11",
        "0"
      ],
      [
        "11",
        "1"
      ],
      [
        "00",
        "000"
      ],
      [
        "100",
        "0000"
      ],
      [
        "10000",
        "1"
      ],
      [
        "000",
        "11"
      ],
      [
        "1000",
        "10"
      ],
      [
        "10000",
        "000"
      ],
      [
        "100",
        "1000"
      ],
      [
        "11",
        "10"
      ],
      [
        "0000",
        "00"
      ],
      [
        "000",
        "10"
      ],
      [
        "1100",
        "000"
      ],
      [
        "000",
        "100"
      ],
      [
        "0000",
        "000"
      ],
      [
        "11",
        "100000"
      ],
      [
        "10",
        "10"
      ],
      [
        "100010",
        "111"
      ],
      [
        "0000000",
        "1"
      ],
      [
        "0",
        "11"
      ],
      [
        "00",
        "1000"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "110"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "110",
        "100"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "0",
        "1100"
      ],
      [
        "10",
        "100000"
      ],
      [
        "10",
        "111"
      ],
      [
        "100000",
        "100001"
      ],
      [
        "00000",
        "111"
      ],
      [
        "1000000",
        "00"
      ],
      [
        "100010",
        "110"
      ],
      [
        "11",
        "1100"
      ],
      [
        "11",
        "1110"
      ],
      [
        "10",
        "1"
      ],
      [
        "10",
        "100"
      ],
      [
        "10",
        "1100"
      ],
      [
        "10",
        "1000"
      ],
      [
        "10",
        "110"
      ],
      [
        "1000",
        "100"
      ],
      [
        "1000",
        "11"
      ],
      [
        "110",
        "1100"
      ],
      [
        "00000",
        "1100"
      ],
      [
        "00000",
        "101"
      ],
      [
        "1001000",
        "11"
      ],
      [
        "1110",
        "1000"
      ],
      [
        "1010",
        "10111"
      ],
      [
        "100110",
        "111"
      ],
      [
        "110100",
        "100001"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "11"
      ],
      [
        "00",
        "1100"
      ],
      [
        "00",
        "110"
      ],
      [
        "100",
        "100100011"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "100000000"
      ],
      [
        "10",
        "10000000"
      ],
      [
        "10",
        "100000000"
      ],
      [
        "1100",
        "0"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "100000",
        "1"
      ],
      [
        "100000",
        "11100000"
      ],
      [
        "110",
        "1000"
      ],
      [
        "1000000",
        "1100000"
      ],
      [
        "10000000",
        "100"
      ],
      [
        "000000",
        "1101000"
      ],
      [
        "011",
        "1000000"
      ],
      [
        "11000000",
        "100000"
      ],
      [
        "01100",
        "0"
      ],
      [
        "111110",
        "100001"
      ],
      [
        "101100",
        "00000"
      ],
      [
        "10110",
        "100001"
      ],
      [
        "000001100",
        "1000"
      ],
      [
        "0",
        "1"
      ],
      [
        "0",
        "100010"
      ],
      [
        "0",
        "10100"
      ],
      [
        "0",
        "1000001"
      ],
      [
        "00",
        "10"
      ],
      [
        "100",
        "1000000"
      ],
      [
        "100",
        "101100"
      ],
      [
        "11",
        "110"
      ],
      [
        "11",
        "100010"
      ],
      [
        "11",
        "10000000"
      ]
    ]
  }
}