{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "0000": 4,
      "01": 5,
      "00000000": 6,
      "0001": 7,
      "001": 8,
      "000001": 9,
      "0010000": 10,
      "00000001": 11,
      "000": 12,
      "000000001": 13,
      "00001": 14,
      "000000000001": 15,
      "0000000001": 16,
      "0000001": 17,
      "0000000000000000": 18,
      "000000": 19,
      "11": 20,
      "101": 21,
      "00000010000": 22,
      "000000000": 23,
      "00010000": 24,
      "001000000": 25,
      "00100000000": 26,
      "10": 27,
      "01001": 28,
      "0000000000000001": 29,
      "000100": 30,
      "001000000001": 31,
      "000001000": 32,
      "00100001": 33,
      "00000": 34,
      "00010": 35,
      "0101": 36,
      "00000010000001000000": 37,
      "0000000000001": 38,
      "0001000000000": 39,
      "1001": 40,
      "00000000000001": 41,
      "0001000001": 42,
      "0000000000010000000000000000": 43,
      "0000001000": 44,
      "00000000001": 45,
      "000001000001": 46,
      "000010": 47,
      "00100": 48,
      "0010000000000001": 49,
      "00100001000000": 50,
      "0000010000000000010000000000000000": 51,
      "0000000000011": 52,
      "00000010001": 53,
      "00000100000000000100000000000000000000": 54,
      "00011": 55,
      "0000000101": 56,
      "100000001": 57,
      "10010000000000001": 58,
      "0100110": 59,
      "000100000000": 60,
      "001001": 61,
      "00000000100010000": 62,
      "00100000000000": 63,
      "011": 64,
      "00000000000000001": 65,
      "000110": 66,
      "00000100000001": 67,
      "000001000001000000": 68,
      "00000010001001000000": 69,
      "000100000001": 70,
      "0010000001": 71,
      "00100000010000": 72,
      "00100000000111": 73,
      "01000001": 74,
      "000000000000": 75,
      "00000000000": 76,
      "0000000111": 77,
      "00000000010": 78,
      "000000000101": 79,
      "1001000000000000100000000": 80,
      "0100000010000001000000": 81,
      "00010000001": 82,
      "000100010000": 83,
      "00101": 84,
      "00000001000000": 85,
      "000000000001000000000001": 86,
      "000000000000000000000001": 87,
      "00100001000010": 88,
      "010111": 89,
      "10000000000001": 90,
      "0100000001": 91,
      "0100010": 92,
      "010001000001": 93,
      "0000000000000": 94,
      "000100001": 95,
      "00100010000": 96,
      "00100000001": 97,
      "00000001000": 98,
      "101001": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "00",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "1"
      ],
      [
        "0000",
        "01"
      ],
      [
        "001",
        "0000"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "00",
        "0"
      ],
      [
        "00000000",
        "1"
      ],
      [
        "0000",
        "1"
      ],
      [
        "00000000",
        "0001"
      ],
      [
        "00000000",
        "01"
      ],
      [
        "0000",
        "001"
      ],
      [
        "00000000",
        "00000000"
      ],
      [
        "0000",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "01"
      ],
      [
        "0000",
        "0010000"
      ],
      [
        "00000000",
        "0"
      ],
      [
        "0001",
        "0000"
      ],
      [
        "0010000",
        "00"
      ],
      [
        "001",
        "00000000"
      ],
      [
        "1",
        "0"
      ],
      [
        "01",
        "001"
      ],
      [
        "00000000",
        "00000001"
      ],
      [
        "0001",
        "00"
      ],
      [
        "001",
        "000000001"
      ],
      [
        "000001",
        "000"
      ],
      [
        "0010000",
        "1"
      ],
      [
        "0000",
        "0"
      ],
      [
        "0001",
        "0"
      ],
      [
        "01",
        "01"
      ],
      [
        "00000010000",
        "001000000"
      ],
      [
        "00000000",
        "00001"
      ],
      [
        "0001",
        "000000000"
      ],
      [
        "1",
        "001"
      ],
      [
        "00000000",
        "000001"
      ],
      [
        "0001",
        "000001"
      ],
      [
        "000000000001",
        "0000000000000000"
      ],
      [
        "0000001",
        "000"
      ],
      [
        "00000000",
        "001"
      ],
      [
        "000001",
        "000001"
      ],
      [
        "00001",
        "0"
      ],
      [
        "001",
        "00"
      ],
      [
        "00100000000",
        "00001"
      ],
      [
        "00100001",
        "000000"
      ],
      [
        "000001",
        "0000000000010000000000000000"
      ],
      [
        "000000000001",
        "1"
      ],
      [
        "0000001",
        "0001"
      ],
      [
        "0000010000000000010000000000000000",
        "0000"
      ],
      [
        "0001",
        "1"
      ],
      [
        "00000001",
        "01"
      ],
      [
        "1",
        "00000001"
      ],
      [
        "1",
        "0010000000000001"
      ],
      [
        "01001",
        "10"
      ],
      [
        "0001",
        "00000000"
      ],
      [
        "001",
        "001"
      ],
      [
        "000000001",
        "00010000"
      ],
      [
        "00100000000",
        "000"
      ],
      [
        "01",
        "1"
      ],
      [
        "00000000",
        "000000001"
      ],
      [
        "0001",
        "10"
      ],
      [
        "000001",
        "00000001"
      ],
      [
        "000001000001",
        "000000"
      ],
      [
        "00000010001",
        "001000000"
      ],
      [
        "0001",
        "00000001"
      ],
      [
        "0010000",
        "001"
      ],
      [
        "0010000",
        "0010000"
      ],
      [
        "001000000001",
        "11"
      ],
      [
        "01",
        "000001"
      ],
      [
        "00000000",
        "0000"
      ],
      [
        "00000000",
        "000"
      ],
      [
        "00000001",
        "11"
      ],
      [
        "0000000001",
        "0"
      ],
      [
        "0000000001",
        "01"
      ],
      [
        "10010000000000001",
        "00000000"
      ],
      [
        "01",
        "00000010000001000000"
      ],
      [
        "0001",
        "0000001"
      ],
      [
        "0001",
        "00010000"
      ],
      [
        "001",
        "01"
      ],
      [
        "00000001",
        "000000"
      ],
      [
        "000000000001",
        "000000000001"
      ],
      [
        "0000000000000000",
        "00000001"
      ],
      [
        "00100001",
        "000010"
      ],
      [
        "0101",
        "11"
      ],
      [
        "1",
        "0000000000001"
      ],
      [
        "01",
        "00000001"
      ],
      [
        "01",
        "00010"
      ],
      [
        "01",
        "0001000001"
      ],
      [
        "00000000",
        "00000"
      ],
      [
        "0001",
        "00001"
      ],
      [
        "001",
        "00010000"
      ],
      [
        "0010000",
        "0001"
      ],
      [
        "00000001",
        "000"
      ],
      [
        "101",
        "001"
      ]
    ]
  }
}