{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "01": 4,
      "0000": 5,
      "11": 6,
      "0001": 7,
      "10000": 8,
      "100": 9,
      "0111": 10,
      "10001": 11,
      "010000": 12,
      "000": 13,
      "000001": 14,
      "1100": 15,
      "00010": 16,
      "1000000": 17,
      "1000": 18,
      "101": 19,
      "110000": 20,
      "011": 21,
      "00011": 22,
      "0101": 23,
      "000000": 24,
      "0100001": 25,
      "00000111": 26,
      "1101": 27,
      "100000001": 28,
      "010001": 29,
      "00000": 30,
      "000100": 31,
      "100010111": 32,
      "10000000100000": 33,
      "1010000": 34,
      "100001": 35,
      "11000011": 36,
      "0110": 37,
      "1000001": 38,
      "10011": 39,
      "011100": 40,
      "100010110": 41,
      "01000001": 42,
      "01000101": 43,
      "10000001": 44,
      "10101": 45,
      "010100": 46,
      "0000001": 47,
      "0011": 48,
      "0101000001": 49,
      "000011": 50,
      "1110001": 51,
      "100000000001": 52,
      "1001101": 53,
      "0111000000": 54,
      "1000111": 55,
      "10001000001": 56,
      "0100000": 57,
      "00000101": 58,
      "10110000001": 59,
      "1100000": 60,
      "10100000": 61,
      "10100001": 62,
      "001100": 63,
      "001000": 64,
      "001001101": 65,
      "01000": 66,
      "0100011": 67,
      "00000001": 68,
      "111100": 69,
      "000101": 70,
      "000111": 71,
      "0001000001": 72,
      "0001011": 73,
      "100000": 74,
      "1000011": 75,
      "10000011": 76,
      "100000100001": 77,
      "10000100001": 78,
      "1001000": 79,
      "10011000011": 80,
      "0111000100": 81,
      "100010": 82,
      "100010100001": 83,
      "1011000": 84,
      "01010": 85,
      "0000011101000": 86,
      "01000111": 87,
      "10100000000": 88,
      "1000010": 89,
      "11000011100000": 90,
      "11000011100010": 91,
      "100000100010": 92,
      "10011000001": 93,
      "0011100001": 94,
      "100011111": 95,
      "0010011011000": 96,
      "0001011011100": 97,
      "10": 98,
      "10111": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "01"
      ],
      [
        "1",
        "0000"
      ],
      [
        "1",
        "00"
      ],
      [
        "01",
        "11"
      ],
      [
        "1",
        "0001"
      ],
      [
        "01",
        "0000"
      ],
      [
        "00",
        "0"
      ],
      [
        "0000",
        "01"
      ],
      [
        "11",
        "00"
      ],
      [
        "0001",
        "0"
      ],
      [
        "10000",
        "00"
      ],
      [
        "100",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "11",
        "0000"
      ],
      [
        "01",
        "1"
      ],
      [
        "0001",
        "1"
      ],
      [
        "01",
        "01"
      ],
      [
        "0000",
        "00"
      ],
      [
        "010000",
        "1"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "11",
        "01"
      ],
      [
        "10000",
        "0001"
      ],
      [
        "01",
        "0001"
      ],
      [
        "0000",
        "0"
      ],
      [
        "0001",
        "00"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "100000001",
        "00000"
      ],
      [
        "1",
        "010000"
      ],
      [
        "10000",
        "1"
      ],
      [
        "110000",
        "11"
      ],
      [
        "011",
        "0"
      ],
      [
        "10000",
        "01"
      ],
      [
        "100",
        "11"
      ],
      [
        "0111",
        "00"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "010000",
        "01"
      ],
      [
        "010001",
        "01"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "101",
        "01"
      ],
      [
        "0101",
        "00"
      ],
      [
        "000000",
        "1"
      ],
      [
        "00",
        "11"
      ],
      [
        "01",
        "01000001"
      ],
      [
        "0000",
        "11"
      ],
      [
        "11",
        "10001"
      ],
      [
        "10000",
        "0000001"
      ],
      [
        "100",
        "1101"
      ],
      [
        "0111",
        "000000"
      ],
      [
        "10001",
        "11"
      ],
      [
        "10001",
        "000001"
      ],
      [
        "010000",
        "0"
      ],
      [
        "000001",
        "01"
      ],
      [
        "101",
        "10000001"
      ],
      [
        "110000",
        "0"
      ],
      [
        "1010000",
        "0"
      ],
      [
        "1",
        "0100001"
      ],
      [
        "00",
        "1100"
      ],
      [
        "00",
        "1000"
      ],
      [
        "00",
        "1001101"
      ],
      [
        "01",
        "000"
      ],
      [
        "01",
        "00011"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "11",
        "1100"
      ],
      [
        "0001",
        "01"
      ],
      [
        "0001",
        "11"
      ],
      [
        "0001",
        "000001"
      ],
      [
        "0001",
        "011"
      ],
      [
        "10000",
        "0"
      ],
      [
        "10000",
        "11"
      ],
      [
        "10000",
        "011"
      ],
      [
        "10000",
        "0100001"
      ],
      [
        "10000",
        "100001"
      ],
      [
        "100",
        "1000"
      ],
      [
        "100",
        "11000011"
      ],
      [
        "0111",
        "000100"
      ],
      [
        "10001",
        "0"
      ],
      [
        "10001",
        "0100001"
      ],
      [
        "101",
        "1000"
      ],
      [
        "0101",
        "0"
      ],
      [
        "00000111",
        "01000"
      ],
      [
        "010001",
        "11"
      ],
      [
        "1010000",
        "0000"
      ],
      [
        "100001",
        "0"
      ],
      [
        "11000011",
        "100000"
      ],
      [
        "11000011",
        "100010"
      ],
      [
        "1000001",
        "00010"
      ],
      [
        "10011",
        "000001"
      ],
      [
        "0011",
        "100001"
      ],
      [
        "1000111",
        "11"
      ],
      [
        "001001101",
        "1000"
      ],
      [
        "0001011",
        "011100"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "0111"
      ]
    ]
  }
}