{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "000": 6,
      "10": 7,
      "1000": 8,
      "0000": 9,
      "1100": 10,
      "100000": 11,
      "110": 12,
      "100010": 13,
      "00000": 14,
      "1000000": 15,
      "111": 16,
      "00010": 17,
      "00100": 18,
      "100011": 19,
      "10000": 20,
      "10100": 21,
      "001000": 22,
      "0001": 23,
      "100010111": 24,
      "00011": 25,
      "0011": 26,
      "001100": 27,
      "11100": 28,
      "101": 29,
      "000000100": 30,
      "000001": 31,
      "100001": 32,
      "0000001001000": 33,
      "100100": 34,
      "11100000": 35,
      "1110": 36,
      "111100": 37,
      "000100": 38,
      "10100000": 39,
      "00000001": 40,
      "110100": 41,
      "1111": 42,
      "11000000": 43,
      "11000011": 44,
      "00000101": 45,
      "10000001": 46,
      "100000000": 47,
      "0100010": 48,
      "11100010": 49,
      "1010": 50,
      "10100000000": 51,
      "1000100": 52,
      "100011110": 53,
      "100100000001": 54,
      "01000101": 55,
      "01000": 56,
      "1001000": 57,
      "100110": 58,
      "10010000001": 59,
      "11111": 60,
      "101100": 61,
      "10110": 62,
      "10100010": 63,
      "000000000": 64,
      "000010100": 65,
      "11001000": 66,
      "11001100": 67,
      "10000011": 68,
      "100000100011": 69,
      "100000100001": 70,
      "110110": 71,
      "11011100": 72,
      "00000111": 73,
      "10000000001": 74,
      "0001011011100": 75,
      "100011111": 76,
      "1000010": 77,
      "1010000000": 78,
      "1010000100": 79,
      "0010001000": 80,
      "0011000001": 81,
      "1111001110": 82,
      "110100100011": 83,
      "11010011100000": 84,
      "110000001": 85,
      "11000011100001": 86,
      "01000111": 87,
      "0000000001000": 88,
      "0000101001100": 89,
      "01": 90,
      "011": 91,
      "01100": 92,
      "0100000": 93,
      "0111": 94,
      "010000": 95,
      "011100": 96,
      "010100000": 97,
      "01010": 98,
      "0100110": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "100",
        "0"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "100",
        "000"
      ],
      [
        "11",
        "0"
      ],
      [
        "1000",
        "10"
      ],
      [
        "00",
        "000"
      ],
      [
        "100",
        "0000"
      ],
      [
        "11",
        "1"
      ],
      [
        "000",
        "10"
      ],
      [
        "00",
        "100"
      ],
      [
        "1000",
        "11"
      ],
      [
        "100",
        "00"
      ],
      [
        "10",
        "100"
      ],
      [
        "00",
        "1000"
      ],
      [
        "000",
        "1"
      ],
      [
        "100010",
        "111"
      ],
      [
        "000",
        "11"
      ],
      [
        "00",
        "11"
      ],
      [
        "00",
        "1100"
      ],
      [
        "11",
        "100"
      ],
      [
        "10",
        "1"
      ],
      [
        "0000",
        "00100"
      ],
      [
        "00000",
        "1"
      ],
      [
        "10000",
        "1"
      ],
      [
        "000000100",
        "1000"
      ],
      [
        "100",
        "100"
      ],
      [
        "11",
        "100000"
      ],
      [
        "11",
        "10"
      ],
      [
        "11",
        "1100"
      ],
      [
        "000",
        "100"
      ],
      [
        "10",
        "100000"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "110",
        "100"
      ],
      [
        "11",
        "11"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "1100",
        "0011"
      ],
      [
        "00000",
        "101"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "1000000",
        "00"
      ],
      [
        "0",
        "100010"
      ],
      [
        "11",
        "100010"
      ],
      [
        "10",
        "10"
      ],
      [
        "10",
        "100000000"
      ],
      [
        "1000",
        "100"
      ],
      [
        "100011",
        "110"
      ],
      [
        "100100",
        "000001"
      ],
      [
        "0100010",
        "1"
      ],
      [
        "0",
        "1000"
      ],
      [
        "100",
        "1000"
      ],
      [
        "100",
        "110"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "11",
        "111"
      ],
      [
        "10",
        "1100"
      ],
      [
        "10",
        "110"
      ],
      [
        "10",
        "100010"
      ],
      [
        "0000",
        "00000"
      ],
      [
        "0000",
        "10100"
      ],
      [
        "1100",
        "1000"
      ],
      [
        "1100",
        "1100"
      ],
      [
        "100000",
        "11"
      ],
      [
        "100000",
        "100011"
      ],
      [
        "100000",
        "100001"
      ],
      [
        "110",
        "110"
      ],
      [
        "110",
        "11100"
      ],
      [
        "00000",
        "111"
      ],
      [
        "1000000",
        "0001"
      ],
      [
        "00010",
        "11011100"
      ],
      [
        "100011",
        "111"
      ],
      [
        "10000",
        "10"
      ],
      [
        "10100",
        "00000"
      ],
      [
        "10100",
        "00100"
      ],
      [
        "001000",
        "1000"
      ],
      [
        "001100",
        "0001"
      ],
      [
        "111100",
        "1110"
      ],
      [
        "110100",
        "100011"
      ],
      [
        "110100",
        "11100000"
      ],
      [
        "11000000",
        "1"
      ],
      [
        "11000011",
        "100001"
      ],
      [
        "01000",
        "111"
      ],
      [
        "000000000",
        "1000"
      ],
      [
        "000010100",
        "1100"
      ],
      [
        "0",
        "1"
      ],
      [
        "0",
        "11"
      ],
      [
        "0",
        "1100"
      ],
      [
        "0",
        "100000"
      ],
      [
        "0",
        "111"
      ],
      [
        "0",
        "10000"
      ],
      [
        "0",
        "11100"
      ],
      [
        "0",
        "10100000"
      ],
      [
        "0",
        "1010"
      ],
      [
        "0",
        "100110"
      ]
    ]
  }
}