{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "0000": 6,
      "1100": 7,
      "011": 8,
      "10": 9,
      "10000": 10,
      "1001": 11,
      "000": 12,
      "001100": 13,
      "010": 14,
      "00011": 15,
      "0100": 16,
      "00001": 17,
      "01100": 18,
      "1000000": 19,
      "11000": 20,
      "0011": 21,
      "100011": 22,
      "000011000": 23,
      "1000011": 24,
      "100100": 25,
      "000010000": 26,
      "10011": 27,
      "000010": 28,
      "0000000": 29,
      "00110000011": 30,
      "0011000100": 31,
      "001": 32,
      "0000010": 33,
      "0110": 34,
      "1011": 35,
      "00100011": 36,
      "1000100": 37,
      "000000011": 38,
      "110011": 39,
      "1000010": 40,
      "000100": 41,
      "00110000001": 42,
      "0011000110": 43,
      "0010000": 44,
      "001000000": 45,
      "0000100": 46,
      "000011": 47,
      "1100000": 48,
      "10000100100": 49,
      "01100011": 50,
      "110001": 51,
      "0000000111001": 52,
      "001000000100": 53,
      "01": 54,
      "01001": 55,
      "11100011": 56,
      "00000011": 57,
      "1100100": 58,
      "01110": 59,
      "101001": 60,
      "0101100": 61,
      "01010": 62,
      "01010000100100": 63,
      "01000": 64,
      "00111000011": 65,
      "000011100": 66,
      "01000011": 67,
      "00100": 68,
      "001001": 69,
      "001000011": 70,
      "001000100": 71,
      "1000": 72,
      "1101100": 73,
      "1101": 74,
      "11000011": 75,
      "011110011": 76,
      "1000010011": 77,
      "000110": 78,
      "000111000": 79,
      "1000000101001": 80,
      "0011100100": 81,
      "100100010": 82,
      "100110": 83,
      "0000000110001": 84,
      "10111000011": 85,
      "001000001100": 86,
      "0000100110001": 87,
      "11000001100000": 88,
      "001000101100": 89,
      "001000011100": 90,
      "001000100100": 91,
      "010000": 92,
      "0010": 93,
      "10010": 94,
      "10010000100100": 95,
      "111": 96,
      "111100": 97,
      "1110": 98,
      "111001": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "0",
        "11"
      ],
      [
        "1",
        "0"
      ],
      [
        "100",
        "00"
      ],
      [
        "100",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "1100"
      ],
      [
        "0",
        "10"
      ],
      [
        "00",
        "011"
      ],
      [
        "0",
        "100"
      ],
      [
        "0000",
        "1"
      ],
      [
        "0",
        "1100"
      ],
      [
        "100",
        "0000"
      ],
      [
        "1100",
        "0"
      ],
      [
        "00",
        "11"
      ],
      [
        "100",
        "011"
      ],
      [
        "0000",
        "11000"
      ],
      [
        "10000",
        "11"
      ],
      [
        "100",
        "100"
      ],
      [
        "0000",
        "10000"
      ],
      [
        "100",
        "11"
      ],
      [
        "0000",
        "10"
      ],
      [
        "0000",
        "000"
      ],
      [
        "001100",
        "00011"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "00",
        "1"
      ],
      [
        "0000",
        "010"
      ],
      [
        "011",
        "0"
      ],
      [
        "1",
        "011"
      ],
      [
        "00",
        "100011"
      ],
      [
        "100",
        "0100"
      ],
      [
        "0000",
        "00011"
      ],
      [
        "1100",
        "11"
      ],
      [
        "10000",
        "10"
      ],
      [
        "000",
        "100"
      ],
      [
        "001100",
        "00001"
      ],
      [
        "001100",
        "0110"
      ],
      [
        "00",
        "10000"
      ],
      [
        "00",
        "1000000"
      ],
      [
        "0000",
        "100"
      ],
      [
        "0000",
        "11"
      ],
      [
        "1100",
        "000"
      ],
      [
        "10000",
        "100100"
      ],
      [
        "01100",
        "011"
      ],
      [
        "11000",
        "1"
      ],
      [
        "000000011",
        "1001"
      ],
      [
        "001000000",
        "100"
      ],
      [
        "0",
        "1"
      ],
      [
        "0",
        "1001"
      ],
      [
        "11",
        "100011"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "1100",
        "100"
      ],
      [
        "011",
        "10"
      ],
      [
        "10",
        "1001"
      ],
      [
        "010",
        "1100"
      ],
      [
        "010",
        "10"
      ],
      [
        "010",
        "10000100100"
      ],
      [
        "0100",
        "0"
      ],
      [
        "0011",
        "1000011"
      ],
      [
        "000011",
        "100"
      ],
      [
        "0",
        "1000011"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "1001"
      ],
      [
        "00",
        "1000011"
      ],
      [
        "00",
        "1000100"
      ],
      [
        "100",
        "0"
      ],
      [
        "11",
        "01100"
      ],
      [
        "11",
        "01"
      ],
      [
        "1100",
        "0011"
      ],
      [
        "011",
        "110011"
      ],
      [
        "10000",
        "10011"
      ],
      [
        "00011",
        "0"
      ],
      [
        "00011",
        "1000"
      ],
      [
        "1000000",
        "101001"
      ],
      [
        "0011",
        "100100"
      ],
      [
        "100100",
        "010"
      ],
      [
        "10011",
        "0"
      ],
      [
        "0000000",
        "110001"
      ],
      [
        "1011",
        "1000011"
      ],
      [
        "0010000",
        "01100"
      ],
      [
        "0000100",
        "110001"
      ],
      [
        "1100000",
        "1100000"
      ],
      [
        "00100",
        "0101100"
      ],
      [
        "001000011",
        "100"
      ],
      [
        "001000100",
        "100"
      ],
      [
        "0",
        "10000"
      ],
      [
        "00",
        "10"
      ],
      [
        "100",
        "10"
      ],
      [
        "100",
        "10000100100"
      ],
      [
        "11",
        "1"
      ],
      [
        "11",
        "1100"
      ],
      [
        "11",
        "10"
      ],
      [
        "11",
        "1001"
      ]
    ]
  }
}