{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "001": 6,
      "011": 7,
      "00100": 8,
      "0100": 9,
      "1001": 10,
      "00001": 11,
      "0000": 12,
      "001100": 13,
      "11": 14,
      "00011": 15,
      "01100": 16,
      "1100": 17,
      "0000100": 18,
      "000": 19,
      "1000100": 20,
      "010": 21,
      "10": 22,
      "1000": 23,
      "0010000100": 24,
      "000100": 25,
      "0101": 26,
      "000011000": 27,
      "00110000011": 28,
      "100110": 29,
      "10100": 30,
      "0001": 31,
      "0000001": 32,
      "100011": 33,
      "0011100": 34,
      "00100011": 35,
      "00000011": 36,
      "0001100": 37,
      "0010": 38,
      "000011001": 39,
      "0011000100": 40,
      "000110": 41,
      "1011": 42,
      "1000010": 43,
      "0101100": 44,
      "0011": 45,
      "01001": 46,
      "0100100": 47,
      "100111": 48,
      "000010": 49,
      "00000": 50,
      "00110000001": 51,
      "11100011": 52,
      "1100110": 53,
      "00010": 54,
      "10000001": 55,
      "01011": 56,
      "001011": 57,
      "0110": 58,
      "001000000100": 59,
      "0000010": 60,
      "0011000110": 61,
      "00111000011": 62,
      "1000000": 63,
      "010100": 64,
      "011001": 65,
      "01010": 66,
      "00111": 67,
      "001000001100": 68,
      "001000101100": 69,
      "001000100100": 70,
      "01000": 71,
      "00000000": 72,
      "000111000": 73,
      "01100011": 74,
      "110001": 75,
      "000010000": 76,
      "0000100001011": 77,
      "0000100110001": 78,
      "100010010100": 79,
      "0101011": 80,
      "10100011": 81,
      "00011001": 82,
      "1000110": 83,
      "1000000101001": 84,
      "1000100101001": 85,
      "11001": 86,
      "101100": 87,
      "1010": 88,
      "000101": 89,
      "10000011": 90,
      "1000000100": 91,
      "100000": 92,
      "01100110": 93,
      "010100100": 94,
      "01100111": 95,
      "00101": 96,
      "00111100011": 97,
      "0010101011": 98,
      "01101": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "1"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "100"
      ],
      [
        "0",
        "100"
      ],
      [
        "100",
        "1"
      ],
      [
        "00",
        "001"
      ],
      [
        "00",
        "00"
      ],
      [
        "001",
        "100"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "011"
      ],
      [
        "01",
        "100"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "00100"
      ],
      [
        "00",
        "0"
      ],
      [
        "100",
        "0100"
      ],
      [
        "01",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "100",
        "0"
      ],
      [
        "00100",
        "00100"
      ],
      [
        "00",
        "0100"
      ],
      [
        "01",
        "01"
      ],
      [
        "00001",
        "1000"
      ],
      [
        "001100",
        "00011"
      ],
      [
        "1001",
        "10"
      ],
      [
        "1",
        "0100"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "00001"
      ],
      [
        "100",
        "011"
      ],
      [
        "001",
        "1100"
      ],
      [
        "00100",
        "011"
      ],
      [
        "0000001",
        "1"
      ],
      [
        "00",
        "01100"
      ],
      [
        "001",
        "0"
      ],
      [
        "00001",
        "1001"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "00011",
        "0"
      ],
      [
        "1",
        "011"
      ],
      [
        "100",
        "0010"
      ],
      [
        "01",
        "01100"
      ],
      [
        "001",
        "1"
      ],
      [
        "0100",
        "1"
      ],
      [
        "0100",
        "100"
      ],
      [
        "1001",
        "11"
      ],
      [
        "00001",
        "0"
      ],
      [
        "0000",
        "0"
      ],
      [
        "001100",
        "00001"
      ],
      [
        "11",
        "100011"
      ],
      [
        "1",
        "100110"
      ],
      [
        "00",
        "010"
      ],
      [
        "100",
        "00001"
      ],
      [
        "01",
        "011"
      ],
      [
        "001",
        "011"
      ],
      [
        "011",
        "0"
      ],
      [
        "00100",
        "0000100"
      ],
      [
        "0000",
        "010"
      ],
      [
        "001100",
        "0110"
      ],
      [
        "0011100",
        "0011"
      ],
      [
        "100",
        "0000"
      ],
      [
        "01",
        "0100"
      ],
      [
        "01",
        "1001"
      ],
      [
        "01",
        "010"
      ],
      [
        "001",
        "11"
      ],
      [
        "00100",
        "0001100"
      ],
      [
        "00100",
        "0101100"
      ],
      [
        "00100",
        "0100100"
      ],
      [
        "0100",
        "0"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "00011",
        "1000"
      ],
      [
        "01100",
        "011"
      ],
      [
        "1100",
        "01"
      ],
      [
        "0000100",
        "00"
      ],
      [
        "0000100",
        "001011"
      ],
      [
        "0000100",
        "110001"
      ],
      [
        "1000100",
        "10100"
      ],
      [
        "0101",
        "011"
      ],
      [
        "10100",
        "011"
      ],
      [
        "0001",
        "1001"
      ],
      [
        "100011",
        "0"
      ],
      [
        "10000001",
        "01001"
      ],
      [
        "100010010100",
        "1"
      ],
      [
        "1",
        "1001"
      ],
      [
        "1",
        "01100"
      ],
      [
        "1",
        "010"
      ],
      [
        "00",
        "0101"
      ],
      [
        "100",
        "00011"
      ],
      [
        "100",
        "0000100"
      ],
      [
        "100",
        "000"
      ],
      [
        "01",
        "100110"
      ],
      [
        "01",
        "0100100"
      ],
      [
        "01",
        "100111"
      ],
      [
        "001",
        "01"
      ],
      [
        "001",
        "11100011"
      ],
      [
        "001",
        "0101011"
      ],
      [
        "011",
        "01"
      ]
    ]
  }
}