{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "011": 7,
      "0000": 8,
      "11": 9,
      "1000": 10,
      "100000": 11,
      "101": 12,
      "1000000": 13,
      "1100": 14,
      "10001": 15,
      "000": 16,
      "0111": 17,
      "0100": 18,
      "000000": 19,
      "00011": 20,
      "100001": 21,
      "1001000": 22,
      "0001": 23,
      "0100000": 24,
      "001000": 25,
      "100011": 26,
      "0110": 27,
      "100010111": 28,
      "1011000": 29,
      "00010": 30,
      "100100001": 31,
      "000001": 32,
      "11100000": 33,
      "10000001": 34,
      "100010110": 35,
      "010001": 36,
      "10011": 37,
      "0000001001000": 38,
      "010000": 39,
      "10100": 40,
      "10000100": 41,
      "1000001": 42,
      "011100": 43,
      "011100000": 44,
      "1000100": 45,
      "100000100001": 46,
      "1010100": 47,
      "10000000": 48,
      "0100011001000": 49,
      "1011": 50,
      "1001": 51,
      "10010000": 52,
      "100100100001": 53,
      "00000111": 54,
      "1101": 55,
      "1110001": 56,
      "101100100001": 57,
      "10110000001": 58,
      "00000011": 59,
      "0000001011000": 60,
      "00000101": 61,
      "0000011001000": 62,
      "11100000100000": 63,
      "100110111": 64,
      "10100011100000": 65,
      "0100001": 66,
      "110000": 67,
      "10100000": 68,
      "10110": 69,
      "1010000": 70,
      "001100": 71,
      "10010000001": 72,
      "010": 73,
      "0101": 74,
      "011000": 75,
      "010100": 76,
      "1000011": 77,
      "10000000000": 78,
      "0111010100": 79,
      "0000000": 80,
      "1111": 81,
      "110100": 82,
      "11100011": 83,
      "1110000100": 84,
      "101100": 85,
      "10110000000": 86,
      "10000000100000": 87,
      "11100010100000": 88,
      "10100000000": 89,
      "100000000001": 90,
      "01000": 91,
      "11000000": 92,
      "11000001": 93,
      "0011": 94,
      "00100011": 95,
      "001001": 96,
      "0010010000": 97,
      "0011000001": 98,
      "1001100": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "100",
        "0"
      ],
      [
        "10000",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "10000",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "100",
        "01"
      ],
      [
        "00",
        "0"
      ],
      [
        "011",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "0000",
        "00"
      ],
      [
        "00",
        "011"
      ],
      [
        "10000",
        "1"
      ],
      [
        "100",
        "1000"
      ],
      [
        "00",
        "01"
      ],
      [
        "0",
        "100000"
      ],
      [
        "00",
        "1000"
      ],
      [
        "100",
        "011"
      ],
      [
        "011",
        "0"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "101",
        "1000"
      ],
      [
        "0001",
        "0"
      ],
      [
        "100",
        "100001"
      ],
      [
        "0000",
        "01"
      ],
      [
        "11",
        "100000"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "0",
        "10001"
      ],
      [
        "100",
        "11"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "0",
        "10000"
      ],
      [
        "1",
        "0100"
      ],
      [
        "10000",
        "100"
      ],
      [
        "10000",
        "01"
      ],
      [
        "011",
        "100"
      ],
      [
        "011",
        "100000"
      ],
      [
        "1000",
        "100"
      ],
      [
        "100000",
        "100001"
      ],
      [
        "101",
        "0100"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "010001",
        "1001000"
      ],
      [
        "1",
        "011"
      ],
      [
        "100",
        "1"
      ],
      [
        "100",
        "10000"
      ],
      [
        "100",
        "100100001"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "11",
        "01"
      ],
      [
        "11",
        "10001"
      ],
      [
        "101",
        "100100001"
      ],
      [
        "101",
        "10000001"
      ],
      [
        "000000",
        "11"
      ],
      [
        "000000",
        "1011000"
      ],
      [
        "000001",
        "01"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "11100000",
        "100000"
      ],
      [
        "10011",
        "0111"
      ],
      [
        "10100",
        "011100000"
      ],
      [
        "0",
        "100001"
      ],
      [
        "1",
        "10000"
      ],
      [
        "1",
        "0100000"
      ],
      [
        "1",
        "0110"
      ],
      [
        "1",
        "010000"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "01",
        "0"
      ],
      [
        "01",
        "01"
      ],
      [
        "01",
        "1000"
      ],
      [
        "01",
        "0100"
      ],
      [
        "10000",
        "11"
      ],
      [
        "10000",
        "000000"
      ],
      [
        "011",
        "1010100"
      ],
      [
        "0000",
        "000"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "0100"
      ],
      [
        "11",
        "100011"
      ],
      [
        "11",
        "10000100"
      ],
      [
        "101",
        "100"
      ],
      [
        "101",
        "10000000"
      ],
      [
        "1000000",
        "0100000"
      ],
      [
        "1110001",
        "0100000"
      ],
      [
        "1010000",
        "0000"
      ],
      [
        "10000000000",
        "1"
      ],
      [
        "0",
        "1000"
      ],
      [
        "1",
        "1000000"
      ],
      [
        "1",
        "1000001"
      ],
      [
        "00",
        "11"
      ],
      [
        "00",
        "100011"
      ],
      [
        "00",
        "1001"
      ],
      [
        "00",
        "10010000"
      ],
      [
        "00",
        "11000001"
      ],
      [
        "100",
        "1100"
      ]
    ]
  }
}