{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "000": 6,
      "10": 7,
      "0000": 8,
      "1000": 9,
      "1100": 10,
      "100000": 11,
      "110": 12,
      "000000": 13,
      "100010": 14,
      "10000": 15,
      "00010": 16,
      "111": 17,
      "1000000": 18,
      "10000000": 19,
      "1110": 20,
      "100011": 21,
      "11100000": 22,
      "1100000": 23,
      "1001000": 24,
      "0001": 25,
      "00000011": 26,
      "00011": 27,
      "1010": 28,
      "0000001001000": 29,
      "100010110": 30,
      "100010111": 31,
      "10000000100000": 32,
      "1100010": 33,
      "111100": 34,
      "1100100": 35,
      "110010": 36,
      "10000010": 37,
      "100001": 38,
      "0010": 39,
      "0000010": 40,
      "100100": 41,
      "0001000": 42,
      "10110": 43,
      "00000001": 44,
      "10000011100000": 45,
      "0000000001000": 46,
      "10000001100000": 47,
      "001000": 48,
      "100100000": 49,
      "1111": 50,
      "111000": 51,
      "11110": 52,
      "000100": 53,
      "1010000000": 54,
      "110000000011": 55,
      "110100": 56,
      "1101000": 57,
      "00000010": 58,
      "10000100": 59,
      "10000000001": 60,
      "110010111": 61,
      "00000101": 62,
      "10010000011": 63,
      "010": 64,
      "01000": 65,
      "011100000": 66,
      "001": 67,
      "00000": 68,
      "001100": 69,
      "0000011": 70,
      "11100": 71,
      "101100": 72,
      "100010000010": 73,
      "1100001": 74,
      "1000001110": 75,
      "1101100": 76,
      "1101000000": 77,
      "0000001101100": 78,
      "1000011": 79,
      "10000001101000": 80,
      "11101": 81,
      "110010100011": 82,
      "01000111": 83,
      "0111000001": 84,
      "00000111": 85,
      "0000011111100": 86,
      "10000011101000": 87,
      "110100000011": 88,
      "011": 89,
      "0100010": 90,
      "01110": 91,
      "01010": 92,
      "11000": 93,
      "00100": 94,
      "00110": 95,
      "0010000": 96,
      "001000000": 97,
      "00100001": 98,
      "0010000100": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "100",
        "000"
      ],
      [
        "11",
        "0"
      ],
      [
        "0000",
        "00"
      ],
      [
        "1000",
        "10"
      ],
      [
        "100",
        "00"
      ],
      [
        "000",
        "10"
      ],
      [
        "11",
        "1"
      ],
      [
        "100",
        "0000"
      ],
      [
        "10000",
        "000"
      ],
      [
        "11",
        "10"
      ],
      [
        "1000",
        "11"
      ],
      [
        "11",
        "100000"
      ],
      [
        "1100",
        "000"
      ],
      [
        "100",
        "1000"
      ],
      [
        "000",
        "1"
      ],
      [
        "000000",
        "11"
      ],
      [
        "000",
        "11"
      ],
      [
        "10",
        "10"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "100010",
        "110"
      ],
      [
        "100010",
        "111"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "1",
        "100010"
      ],
      [
        "11",
        "1100"
      ],
      [
        "1100",
        "100"
      ],
      [
        "1100",
        "10"
      ],
      [
        "100000",
        "10"
      ],
      [
        "10000",
        "1"
      ],
      [
        "00",
        "10"
      ],
      [
        "00",
        "00010"
      ],
      [
        "100",
        "100"
      ],
      [
        "000",
        "1000"
      ],
      [
        "10",
        "110"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "100000",
        "11100000"
      ],
      [
        "000000",
        "0001000"
      ],
      [
        "1000000",
        "1100000"
      ],
      [
        "00",
        "1000"
      ],
      [
        "100",
        "100000"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "1000"
      ],
      [
        "11",
        "110"
      ],
      [
        "000",
        "100"
      ],
      [
        "10",
        "10000000"
      ],
      [
        "1100",
        "00000011"
      ],
      [
        "110",
        "100"
      ],
      [
        "110",
        "1000"
      ],
      [
        "000000",
        "10"
      ],
      [
        "10000",
        "100"
      ],
      [
        "1000000",
        "0001"
      ],
      [
        "110010",
        "111"
      ],
      [
        "0000010",
        "1"
      ],
      [
        "100100000",
        "11"
      ],
      [
        "0",
        "10"
      ],
      [
        "0",
        "1000"
      ],
      [
        "0",
        "11100000"
      ],
      [
        "00",
        "1"
      ],
      [
        "00",
        "000"
      ],
      [
        "00",
        "1100"
      ],
      [
        "00",
        "00011"
      ],
      [
        "11",
        "100"
      ],
      [
        "10",
        "1100"
      ],
      [
        "1000",
        "10000010"
      ],
      [
        "1100",
        "001"
      ],
      [
        "100000",
        "1110"
      ],
      [
        "110",
        "1100"
      ],
      [
        "110",
        "1000000"
      ],
      [
        "000000",
        "1101100"
      ],
      [
        "10000",
        "11"
      ],
      [
        "1000000",
        "1101000"
      ],
      [
        "1110",
        "1"
      ],
      [
        "110010",
        "100011"
      ],
      [
        "01000",
        "111"
      ],
      [
        "011100000",
        "1"
      ],
      [
        "00000",
        "111"
      ],
      [
        "0000011",
        "111100"
      ],
      [
        "1000001110",
        "1000"
      ],
      [
        "1101000000",
        "11"
      ],
      [
        "0",
        "11"
      ],
      [
        "0",
        "100010"
      ],
      [
        "0",
        "1110"
      ],
      [
        "0",
        "1010"
      ],
      [
        "1",
        "1000"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "110"
      ],
      [
        "00",
        "10000"
      ],
      [
        "00",
        "1000000"
      ],
      [
        "00",
        "100001"
      ],
      [
        "00",
        "10000100"
      ]
    ]
  }
}