{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "11": 7,
      "1100": 8,
      "0100": 9,
      "000": 10,
      "0001": 11,
      "1000": 12,
      "0101": 13,
      "000000": 14,
      "10100": 15,
      "10000": 16,
      "0111": 17,
      "1000000": 18,
      "10": 19,
      "1000101": 20,
      "101": 21,
      "1001000": 22,
      "110100": 23,
      "00010": 24,
      "1100000": 25,
      "00011": 26,
      "0000001001000": 27,
      "11100": 28,
      "00000111": 29,
      "100010110": 30,
      "001000": 31,
      "100100": 32,
      "10001": 33,
      "00000100": 34,
      "100010111": 35,
      "1000001": 36,
      "00000101": 37,
      "110000": 38,
      "100001": 39,
      "11100000": 40,
      "10011": 41,
      "01100": 42,
      "011000": 43,
      "111100": 44,
      "1010000": 45,
      "10100000000": 46,
      "10000000100": 47,
      "1101000": 48,
      "100110111": 49,
      "10101": 50,
      "001100": 51,
      "010": 52,
      "011100": 53,
      "000000000100": 54,
      "1100100": 55,
      "1100010": 56,
      "010000": 57,
      "10100100": 58,
      "101000000": 59,
      "10000001100000": 60,
      "100011": 61,
      "10000000100000": 62,
      "0000000001000": 63,
      "000100": 64,
      "0010000": 65,
      "1000100": 66,
      "100000": 67,
      "1000111": 68,
      "00000001": 69,
      "110": 70,
      "00000011": 71,
      "000000101": 72,
      "0000001101000": 73,
      "101000": 74,
      "100000100": 75,
      "1000010": 76,
      "110100100000": 77,
      "10000011100010": 78,
      "11000011100000": 79,
      "10100000001": 80,
      "0010000100": 81,
      "0000001011000": 82,
      "0011": 83,
      "00101": 84,
      "0010001": 85,
      "00100001": 86,
      "0010100100": 87,
      "00100011": 88,
      "1001100": 89,
      "100101": 90,
      "100110100": 91,
      "10010101": 92,
      "10010100100": 93,
      "10000000011": 94,
      "011100000": 95,
      "00001": 96,
      "0000100001": 97,
      "111": 98,
      "1111": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "100"
      ],
      [
        "0",
        "100"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "01"
      ],
      [
        "100",
        "0"
      ],
      [
        "01",
        "01"
      ],
      [
        "0000",
        "00"
      ],
      [
        "1",
        "0100"
      ],
      [
        "100",
        "00"
      ],
      [
        "01",
        "11"
      ],
      [
        "100",
        "0000"
      ],
      [
        "1",
        "0"
      ],
      [
        "100",
        "0101"
      ],
      [
        "1",
        "01"
      ],
      [
        "100",
        "1000"
      ],
      [
        "11",
        "0100"
      ],
      [
        "0001",
        "0"
      ],
      [
        "1100",
        "000"
      ],
      [
        "0001",
        "1"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "11",
        "100"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "1000101",
        "10"
      ],
      [
        "00",
        "1000"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "01"
      ],
      [
        "0000",
        "0100"
      ],
      [
        "1000101",
        "11"
      ],
      [
        "100",
        "0001"
      ],
      [
        "0000",
        "0101"
      ],
      [
        "1100",
        "00"
      ],
      [
        "10000",
        "1"
      ],
      [
        "11100",
        "000"
      ],
      [
        "100",
        "11"
      ],
      [
        "01",
        "100"
      ],
      [
        "01",
        "1000"
      ],
      [
        "11",
        "1100"
      ],
      [
        "10100",
        "00"
      ],
      [
        "10100",
        "000000"
      ],
      [
        "1000000",
        "0100"
      ],
      [
        "110100",
        "0"
      ],
      [
        "10011",
        "0111"
      ],
      [
        "1",
        "0101"
      ],
      [
        "00",
        "1100"
      ],
      [
        "01",
        "0"
      ],
      [
        "01",
        "1100"
      ],
      [
        "0000",
        "00000100"
      ],
      [
        "1100",
        "100"
      ],
      [
        "1100",
        "010"
      ],
      [
        "0100",
        "00"
      ],
      [
        "10100",
        "100"
      ],
      [
        "10100",
        "0000"
      ],
      [
        "1000000",
        "1100000"
      ],
      [
        "10001",
        "1"
      ],
      [
        "10000000100",
        "000"
      ],
      [
        "000000000100",
        "0"
      ],
      [
        "00",
        "0100"
      ],
      [
        "00",
        "10000"
      ],
      [
        "100",
        "0100"
      ],
      [
        "100",
        "000"
      ],
      [
        "100",
        "0111"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "11",
        "0"
      ],
      [
        "000000",
        "11"
      ],
      [
        "000000",
        "101"
      ],
      [
        "000000",
        "1101000"
      ],
      [
        "10100",
        "0"
      ],
      [
        "10000",
        "0100"
      ],
      [
        "10000",
        "10"
      ],
      [
        "110100",
        "100000"
      ],
      [
        "1000001",
        "1100010"
      ],
      [
        "110000",
        "11100000"
      ],
      [
        "101000000",
        "01"
      ],
      [
        "0010000",
        "100"
      ],
      [
        "000000101",
        "1000"
      ],
      [
        "00",
        "11"
      ],
      [
        "00",
        "101"
      ],
      [
        "00",
        "10001"
      ],
      [
        "00",
        "100001"
      ],
      [
        "00",
        "10100100"
      ],
      [
        "00",
        "100011"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "101"
      ],
      [
        "100",
        "110100"
      ],
      [
        "100",
        "10101"
      ],
      [
        "100",
        "10100100"
      ],
      [
        "100",
        "00000011"
      ],
      [
        "01",
        "1100000"
      ],
      [
        "0000",
        "1"
      ],
      [
        "0000",
        "100001"
      ],
      [
        "11",
        "1"
      ],
      [
        "11",
        "11"
      ]
    ]
  }
}