{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "011": 7,
      "0100": 8,
      "001": 9,
      "1001": 10,
      "00100": 11,
      "010": 12,
      "001100": 13,
      "11": 14,
      "00011": 15,
      "0000100": 16,
      "1100": 17,
      "01100": 18,
      "0011000100": 19,
      "000": 20,
      "0011": 21,
      "000100": 22,
      "00001": 23,
      "100100": 24,
      "000000": 25,
      "01011": 26,
      "01010": 27,
      "00000011": 28,
      "11000": 29,
      "001001": 30,
      "1000100": 31,
      "011001": 32,
      "0111": 33,
      "001000000100": 34,
      "000011": 35,
      "000011000": 36,
      "00111": 37,
      "00110000011": 38,
      "000111": 39,
      "1100010": 40,
      "1000": 41,
      "1000000": 42,
      "011100": 43,
      "01000": 44,
      "0100100": 45,
      "0100011": 46,
      "0010": 47,
      "0010000100": 48,
      "00110000001": 49,
      "000110": 50,
      "000111010": 51,
      "10": 52,
      "101": 53,
      "101100": 54,
      "0001": 55,
      "00010": 56,
      "0001100": 57,
      "1000010": 58,
      "001011": 59,
      "100111": 60,
      "00100011": 61,
      "001000100100": 62,
      "0000100001001": 63,
      "0000100001011": 64,
      "00001011": 65,
      "01110100011": 66,
      "100011": 67,
      "10000011": 68,
      "100000": 69,
      "010100": 70,
      "0101011": 71,
      "00000": 72,
      "0000000011": 73,
      "011011": 74,
      "01001100": 75,
      "010000111": 76,
      "00101011": 77,
      "001001000100": 78,
      "000111000": 79,
      "000010000": 80,
      "0000100011001": 81,
      "00000001": 82,
      "01100110": 83,
      "01110": 84,
      "00111100011": 85,
      "0000000011011": 86,
      "01000011101000": 87,
      "1011": 88,
      "11001": 89,
      "1011100": 90,
      "0001100110": 91,
      "10000001": 92,
      "0101100": 93,
      "00000000": 94,
      "0000000": 95,
      "0000000111": 96,
      "0000100111": 97,
      "0110": 98,
      "01111": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "01",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "00",
        "1"
      ],
      [
        "100",
        "1"
      ],
      [
        "00",
        "100"
      ],
      [
        "01",
        "0"
      ],
      [
        "001",
        "100"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "011"
      ],
      [
        "0000",
        "100"
      ],
      [
        "1",
        "100"
      ],
      [
        "01",
        "100"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "00",
        "0"
      ],
      [
        "001",
        "1"
      ],
      [
        "00",
        "0100"
      ],
      [
        "0000",
        "1"
      ],
      [
        "100",
        "100"
      ],
      [
        "0000",
        "00"
      ],
      [
        "01",
        "011"
      ],
      [
        "01",
        "010"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "1100",
        "0"
      ],
      [
        "00",
        "1001"
      ],
      [
        "100",
        "0100"
      ],
      [
        "01",
        "1001"
      ],
      [
        "011",
        "1"
      ],
      [
        "00100",
        "0000100"
      ],
      [
        "0000",
        "11"
      ],
      [
        "0000",
        "11000"
      ],
      [
        "001",
        "11"
      ],
      [
        "001100",
        "00011"
      ],
      [
        "00011",
        "1"
      ],
      [
        "1100",
        "010"
      ],
      [
        "100",
        "0"
      ],
      [
        "100",
        "0000"
      ],
      [
        "011",
        "100"
      ],
      [
        "0100",
        "0"
      ],
      [
        "0100",
        "100"
      ],
      [
        "0100",
        "011"
      ],
      [
        "001",
        "0"
      ],
      [
        "00100",
        "00100"
      ],
      [
        "001100",
        "00001"
      ],
      [
        "00011",
        "0"
      ],
      [
        "000111",
        "010"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "1",
        "01100"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "010"
      ],
      [
        "00",
        "01100"
      ],
      [
        "100",
        "0010"
      ],
      [
        "001",
        "011"
      ],
      [
        "1001",
        "11"
      ],
      [
        "00100",
        "011"
      ],
      [
        "00100",
        "0100100"
      ],
      [
        "0000100",
        "001001"
      ],
      [
        "0000100",
        "001011"
      ],
      [
        "00001",
        "011"
      ],
      [
        "0111",
        "0100011"
      ],
      [
        "100",
        "011"
      ],
      [
        "100",
        "00011"
      ],
      [
        "100",
        "000"
      ],
      [
        "01",
        "0100"
      ],
      [
        "01",
        "01011"
      ],
      [
        "0000",
        "0"
      ],
      [
        "0000",
        "000011"
      ],
      [
        "011",
        "011"
      ],
      [
        "0100",
        "1100"
      ],
      [
        "0100",
        "00111"
      ],
      [
        "001",
        "01011"
      ],
      [
        "00100",
        "1000100"
      ],
      [
        "00011",
        "1000"
      ],
      [
        "0000100",
        "00"
      ],
      [
        "0000100",
        "011001"
      ],
      [
        "000000",
        "01"
      ],
      [
        "011001",
        "10"
      ],
      [
        "0111",
        "0"
      ],
      [
        "00111",
        "100011"
      ],
      [
        "0000000011",
        "011"
      ],
      [
        "010000111",
        "01000"
      ],
      [
        "1",
        "011"
      ],
      [
        "1",
        "1001"
      ],
      [
        "1",
        "011100"
      ],
      [
        "00",
        "01100110"
      ],
      [
        "100",
        "00001"
      ],
      [
        "01",
        "01100"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0000",
        "000"
      ],
      [
        "0000",
        "000111"
      ],
      [
        "0000",
        "100111"
      ],
      [
        "011",
        "0"
      ],
      [
        "011",
        "11"
      ]
    ]
  }
}