{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "11": 7,
      "0000": 8,
      "10": 9,
      "1000": 10,
      "10001": 11,
      "100000": 12,
      "000": 13,
      "0001": 14,
      "101": 15,
      "1100": 16,
      "0111": 17,
      "010000": 18,
      "00100": 19,
      "1000101": 20,
      "00010": 21,
      "100011": 22,
      "00000111": 23,
      "100010110": 24,
      "1000000": 25,
      "10000000": 26,
      "1101": 27,
      "000001": 28,
      "10100": 29,
      "1010000": 30,
      "11000": 31,
      "1000001": 32,
      "1000111": 33,
      "100010111": 34,
      "100000100011": 35,
      "00011": 36,
      "011000": 37,
      "11010000": 38,
      "000000100": 39,
      "1011000": 40,
      "0000001001000": 41,
      "0100": 42,
      "1100000": 43,
      "001000": 44,
      "001100": 45,
      "100100": 46,
      "1001000": 47,
      "00000000": 48,
      "10100000": 49,
      "0010010000": 50,
      "10000000100000": 51,
      "00000101": 52,
      "01000": 53,
      "0100000": 54,
      "01000111": 55,
      "110000": 56,
      "0011010000": 57,
      "10010": 58,
      "100001": 59,
      "1111": 60,
      "1110": 61,
      "10110000": 62,
      "10110100": 63,
      "0000011011000": 64,
      "10100001": 65,
      "10100000100000": 66,
      "010001": 67,
      "11000000": 68,
      "110000000": 69,
      "0011000": 70,
      "10011": 71,
      "10011010000": 72,
      "10010100001": 73,
      "01100": 74,
      "010100": 75,
      "11110000000": 76,
      "10100011": 77,
      "10000010000": 78,
      "000101": 79,
      "00010111": 80,
      "10111": 81,
      "10110000000": 82,
      "11001000": 83,
      "0111010100": 84,
      "10000011100000": 85,
      "10000010100000": 86,
      "100011110": 87,
      "10010010000": 88,
      "0000000001000": 89,
      "0100011111000": 90,
      "1100001110": 91,
      "10110100100": 92,
      "0100011001000": 93,
      "11000000100000": 94,
      "0011000100": 95,
      "100110100001": 96,
      "11000011101000": 97,
      "0100011": 98,
      "00100011": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "0"
      ],
      [
        "100",
        "0"
      ],
      [
        "100",
        "01"
      ],
      [
        "10000",
        "0"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "01"
      ],
      [
        "1",
        "01"
      ],
      [
        "1",
        "100"
      ],
      [
        "01",
        "11"
      ],
      [
        "0",
        "10000"
      ],
      [
        "00",
        "100"
      ],
      [
        "10001",
        "01"
      ],
      [
        "0001",
        "0"
      ],
      [
        "10001",
        "1"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "1000101",
        "10"
      ],
      [
        "10000",
        "00"
      ],
      [
        "10000",
        "000"
      ],
      [
        "11",
        "01"
      ],
      [
        "0000",
        "01"
      ],
      [
        "10",
        "100"
      ],
      [
        "10",
        "10000"
      ],
      [
        "1",
        "1000"
      ],
      [
        "10000",
        "01"
      ],
      [
        "10001",
        "11"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "100000",
        "100011"
      ],
      [
        "0001",
        "1"
      ],
      [
        "01",
        "1000"
      ],
      [
        "11",
        "010000"
      ],
      [
        "0000",
        "00100"
      ],
      [
        "101",
        "1000"
      ],
      [
        "000000100",
        "1000"
      ],
      [
        "0",
        "100"
      ],
      [
        "1",
        "100000"
      ],
      [
        "00",
        "1000"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "1000"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "10",
        "100000"
      ],
      [
        "00100",
        "10000"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "000001",
        "01"
      ],
      [
        "0",
        "1000"
      ],
      [
        "0",
        "100000"
      ],
      [
        "0",
        "1000111"
      ],
      [
        "1",
        "10000"
      ],
      [
        "00",
        "11010000"
      ],
      [
        "100",
        "10"
      ],
      [
        "10000",
        "1"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "10"
      ],
      [
        "101",
        "10000"
      ],
      [
        "101",
        "10100"
      ],
      [
        "000001",
        "1011000"
      ],
      [
        "1010000",
        "1"
      ],
      [
        "10100000",
        "100000"
      ],
      [
        "0",
        "10001"
      ],
      [
        "1",
        "1000000"
      ],
      [
        "1",
        "10000000"
      ],
      [
        "00",
        "11000"
      ],
      [
        "100",
        "11"
      ],
      [
        "100",
        "11010000"
      ],
      [
        "100",
        "10100001"
      ],
      [
        "01",
        "100"
      ],
      [
        "01",
        "0100"
      ],
      [
        "11",
        "110000000"
      ],
      [
        "10",
        "100011"
      ],
      [
        "100000",
        "10000"
      ],
      [
        "0001",
        "01"
      ],
      [
        "0001",
        "0111"
      ],
      [
        "101",
        "11"
      ],
      [
        "101",
        "10000000"
      ],
      [
        "1100",
        "1000"
      ],
      [
        "0111",
        "010100"
      ],
      [
        "1000001",
        "1100000"
      ],
      [
        "1000001",
        "0100000"
      ],
      [
        "1000111",
        "10"
      ],
      [
        "100100",
        "10000"
      ],
      [
        "00000000",
        "01000"
      ],
      [
        "01000111",
        "11000"
      ],
      [
        "110000",
        "1110"
      ],
      [
        "10110100",
        "100"
      ],
      [
        "010001",
        "1001000"
      ],
      [
        "11000000",
        "100000"
      ],
      [
        "0011000",
        "100"
      ],
      [
        "10011010000",
        "1"
      ],
      [
        "1100001110",
        "1000"
      ],
      [
        "0",
        "100011"
      ],
      [
        "00",
        "100011"
      ]
    ]
  }
}