{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "0000": 6,
      "01": 7,
      "011": 8,
      "10000": 9,
      "1000000": 10,
      "1100": 11,
      "010": 12,
      "1000": 13,
      "100000": 14,
      "000000": 15,
      "100011": 16,
      "01011": 17,
      "00010": 18,
      "111": 19,
      "1000001": 20,
      "010110": 21,
      "101": 22,
      "000": 23,
      "000001": 24,
      "10000001": 25,
      "10": 26,
      "100100": 27,
      "1111": 28,
      "1001000": 29,
      "100010110": 30,
      "10000000": 31,
      "100000000": 32,
      "00011": 33,
      "111100": 34,
      "100001": 35,
      "00000011": 36,
      "001100": 37,
      "1001100": 38,
      "100010": 39,
      "000100": 40,
      "1011": 41,
      "11000001": 42,
      "10010000001": 43,
      "10000010": 44,
      "100000001": 45,
      "0000001001000": 46,
      "0100000": 47,
      "0100011": 48,
      "110000": 49,
      "1100000": 50,
      "101011": 51,
      "001000": 52,
      "1101": 53,
      "0110000000": 54,
      "011100": 55,
      "0111000001": 56,
      "10000100": 57,
      "100000100011": 58,
      "100000100001": 59,
      "0000000": 60,
      "010111": 61,
      "101010110": 62,
      "0000011001000": 63,
      "100100100011": 64,
      "0100": 65,
      "01000": 66,
      "11000000": 67,
      "00100": 68,
      "0010000001": 69,
      "0011000001": 70,
      "00100000001": 71,
      "100010111": 72,
      "110": 73,
      "11100011": 74,
      "11100010": 75,
      "00000000": 76,
      "0000011": 77,
      "10000011": 78,
      "10000111": 79,
      "110010000010": 80,
      "1000100": 81,
      "000000100100": 82,
      "0000001001100": 83,
      "1011000000": 84,
      "00000101": 85,
      "10000001100000": 86,
      "1111011": 87,
      "10000000100000": 88,
      "10000000011": 89,
      "10000000001": 90,
      "11110010": 91,
      "1111000100": 92,
      "100010100011": 93,
      "10000010100000": 94,
      "01000111": 95,
      "101011111": 96,
      "1101100": 97,
      "11100011100000": 98,
      "0000001001001": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "0",
        "11"
      ],
      [
        "100",
        "00"
      ],
      [
        "100",
        "0000"
      ],
      [
        "1",
        "100"
      ],
      [
        "01",
        "0"
      ],
      [
        "100",
        "0"
      ],
      [
        "10000",
        "0"
      ],
      [
        "0000",
        "00"
      ],
      [
        "100",
        "011"
      ],
      [
        "01",
        "011"
      ],
      [
        "00",
        "010"
      ],
      [
        "11",
        "1"
      ],
      [
        "10000",
        "01"
      ],
      [
        "01011",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "00",
        "0"
      ],
      [
        "0000",
        "01"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "1",
        "0"
      ],
      [
        "100",
        "100"
      ],
      [
        "11",
        "11"
      ],
      [
        "100",
        "1000"
      ],
      [
        "100",
        "010110"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "1000000",
        "00"
      ],
      [
        "00",
        "011"
      ],
      [
        "11",
        "1100"
      ],
      [
        "10000",
        "1"
      ],
      [
        "000000",
        "11"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "010"
      ],
      [
        "000",
        "100"
      ],
      [
        "1",
        "011"
      ],
      [
        "1",
        "1000001"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "10000",
        "010"
      ],
      [
        "1000000",
        "01"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "0",
        "100000"
      ],
      [
        "0",
        "100011"
      ],
      [
        "1",
        "10000"
      ],
      [
        "1",
        "100000"
      ],
      [
        "1",
        "01011"
      ],
      [
        "00",
        "1000"
      ],
      [
        "11",
        "01"
      ],
      [
        "01",
        "10000000"
      ],
      [
        "011",
        "100"
      ],
      [
        "011",
        "1000001"
      ],
      [
        "10000",
        "100"
      ],
      [
        "100000",
        "100011"
      ],
      [
        "100000",
        "100001"
      ],
      [
        "000000",
        "0"
      ],
      [
        "01011",
        "1"
      ],
      [
        "101",
        "010110"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "100100",
        "100011"
      ],
      [
        "0",
        "100"
      ],
      [
        "0",
        "1000"
      ],
      [
        "1",
        "1000000"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "10000001"
      ],
      [
        "00",
        "11000001"
      ],
      [
        "00",
        "100000001"
      ],
      [
        "100",
        "010111"
      ],
      [
        "11",
        "0"
      ],
      [
        "11",
        "100011"
      ],
      [
        "11",
        "100010"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0000",
        "011"
      ],
      [
        "10000",
        "011"
      ],
      [
        "10000",
        "111"
      ],
      [
        "1100",
        "10000010"
      ],
      [
        "1000",
        "100"
      ],
      [
        "000000",
        "100100"
      ],
      [
        "000000",
        "1001100"
      ],
      [
        "101",
        "1000000"
      ],
      [
        "000001",
        "01"
      ],
      [
        "10000001",
        "100000"
      ],
      [
        "1111",
        "011"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "100000000",
        "11"
      ],
      [
        "100000000",
        "01"
      ],
      [
        "111100",
        "10"
      ],
      [
        "111100",
        "0100"
      ],
      [
        "100010",
        "100011"
      ],
      [
        "10000010",
        "100000"
      ],
      [
        "0100011",
        "1"
      ],
      [
        "101011",
        "111"
      ],
      [
        "1101",
        "100"
      ],
      [
        "11100011",
        "100000"
      ],
      [
        "000000100100",
        "1"
      ]
    ]
  }
}