{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "11": 7,
      "0001": 8,
      "1100": 9,
      "0100": 10,
      "1000000": 11,
      "010000": 12,
      "000001": 13,
      "0101": 14,
      "10": 15,
      "00010": 16,
      "0100000": 17,
      "0000": 18,
      "100100": 19,
      "011": 20,
      "000100": 21,
      "101": 22,
      "1000101": 23,
      "010": 24,
      "10000000100000": 25,
      "000": 26,
      "1111": 27,
      "110000": 28,
      "0011": 29,
      "00000111": 30,
      "1000": 31,
      "10101": 32,
      "100001": 33,
      "00000011": 34,
      "100010111": 35,
      "1010000": 36,
      "10001": 37,
      "01100": 38,
      "10000011": 39,
      "1100010": 40,
      "00000101": 41,
      "10100": 42,
      "001100": 43,
      "110": 44,
      "1110000": 45,
      "00011": 46,
      "10000000": 47,
      "10000000001": 48,
      "000001101": 49,
      "1001000": 50,
      "100010110": 51,
      "0000011101100": 52,
      "10100000001": 53,
      "00000001": 54,
      "1000100": 55,
      "100010000": 56,
      "011100": 57,
      "010100": 58,
      "1000010": 59,
      "110100": 60,
      "1110": 61,
      "10000001": 62,
      "1111100": 63,
      "11000011": 64,
      "1010101": 65,
      "100011111": 66,
      "11000000": 67,
      "10100000": 68,
      "1001100": 69,
      "011001000": 70,
      "10000100": 71,
      "100000100": 72,
      "111": 73,
      "1110101": 74,
      "11100001": 75,
      "110010000011": 76,
      "1100110": 77,
      "110011000011": 78,
      "0100011001000": 79,
      "01000011": 80,
      "0000011001000": 81,
      "100100100001": 82,
      "10010010100000": 83,
      "0110100": 84,
      "1100000": 85,
      "11100000100000": 86,
      "0000011011100": 87,
      "100010000010": 88,
      "0111000100": 89,
      "101010110": 90,
      "110000000011": 91,
      "100000100011": 92,
      "111010110": 93,
      "00010000": 94,
      "001000": 95,
      "001001100": 96,
      "0010000100": 97,
      "100110000": 98,
      "100100001": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "01"
      ],
      [
        "1",
        "100"
      ],
      [
        "0",
        "100"
      ],
      [
        "10000",
        "00"
      ],
      [
        "0",
        "10000"
      ],
      [
        "00",
        "0001"
      ],
      [
        "01",
        "01"
      ],
      [
        "1",
        "0"
      ],
      [
        "0001",
        "0"
      ],
      [
        "010000",
        "0"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "100"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "0100"
      ],
      [
        "1",
        "01"
      ],
      [
        "100",
        "0101"
      ],
      [
        "01",
        "0"
      ],
      [
        "1000000",
        "0100000"
      ],
      [
        "00",
        "0"
      ],
      [
        "11",
        "11"
      ],
      [
        "1",
        "10000"
      ],
      [
        "00",
        "11"
      ],
      [
        "000001",
        "11"
      ],
      [
        "100",
        "0"
      ],
      [
        "1",
        "0101"
      ],
      [
        "10000",
        "1"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "1000101",
        "11"
      ],
      [
        "1",
        "010000"
      ],
      [
        "100",
        "01"
      ],
      [
        "01",
        "100"
      ],
      [
        "10000",
        "011"
      ],
      [
        "1100",
        "010"
      ],
      [
        "000001",
        "01"
      ],
      [
        "1",
        "0100"
      ],
      [
        "00",
        "1100"
      ],
      [
        "11",
        "0"
      ],
      [
        "11",
        "10000"
      ],
      [
        "0001",
        "1"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "1000000",
        "0001"
      ],
      [
        "000001",
        "101"
      ],
      [
        "100100",
        "0"
      ],
      [
        "1000101",
        "10"
      ],
      [
        "00000111",
        "01100"
      ],
      [
        "1010000",
        "0001"
      ],
      [
        "00",
        "000001"
      ],
      [
        "100",
        "0100"
      ],
      [
        "100",
        "010000"
      ],
      [
        "01",
        "1100"
      ],
      [
        "01",
        "0100"
      ],
      [
        "10000",
        "10"
      ],
      [
        "11",
        "0100"
      ],
      [
        "11",
        "10"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "1111",
        "100"
      ],
      [
        "110000",
        "11"
      ],
      [
        "10101",
        "01"
      ],
      [
        "10001",
        "1111"
      ],
      [
        "1",
        "1000000"
      ],
      [
        "1",
        "0100000"
      ],
      [
        "100",
        "1100"
      ],
      [
        "01",
        "1001000"
      ],
      [
        "10000",
        "100"
      ],
      [
        "10000",
        "0100"
      ],
      [
        "11",
        "1"
      ],
      [
        "11",
        "10101"
      ],
      [
        "11",
        "100001"
      ],
      [
        "1100",
        "10000011"
      ],
      [
        "1100",
        "110"
      ],
      [
        "1100",
        "11000011"
      ],
      [
        "0100",
        "011001000"
      ],
      [
        "010000",
        "11"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "100100",
        "100001"
      ],
      [
        "100100",
        "10100000"
      ],
      [
        "011",
        "0100"
      ],
      [
        "110000",
        "0"
      ],
      [
        "1110000",
        "0100000"
      ],
      [
        "000001101",
        "1100"
      ],
      [
        "100010000",
        "010"
      ],
      [
        "011100",
        "0100"
      ],
      [
        "1010101",
        "10"
      ],
      [
        "11000000",
        "0011"
      ],
      [
        "100000100",
        "011"
      ],
      [
        "1110101",
        "10"
      ],
      [
        "00",
        "010000"
      ],
      [
        "00",
        "1000"
      ],
      [
        "00",
        "1001100"
      ],
      [
        "00",
        "10000100"
      ],
      [
        "100",
        "110000"
      ],
      [
        "100",
        "100001"
      ]
    ]
  }
}