{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "000": 6,
      "10": 7,
      "1100": 8,
      "0000": 9,
      "1000": 10,
      "100000": 11,
      "00000": 12,
      "1011": 13,
      "1000000": 14,
      "10000": 15,
      "110": 16,
      "100011": 17,
      "00010": 18,
      "001100": 19,
      "00011": 20,
      "100001": 21,
      "111100": 22,
      "000000": 23,
      "101": 24,
      "10001011": 25,
      "111": 26,
      "10100": 27,
      "101100": 28,
      "11001000": 29,
      "0000000": 30,
      "100010": 31,
      "110000": 32,
      "0100": 33,
      "011": 34,
      "100100": 35,
      "101000": 36,
      "10100000": 37,
      "1100000": 38,
      "000000000": 39,
      "10000011": 40,
      "100010111": 41,
      "00000001": 42,
      "0000000001000": 43,
      "10000000": 44,
      "1000100": 45,
      "00000101": 46,
      "0000011001000": 47,
      "10111": 48,
      "100000000": 49,
      "100011111": 50,
      "00000011": 51,
      "100010110": 52,
      "00100001": 53,
      "100110": 54,
      "10100000000": 55,
      "1100100": 56,
      "00000100": 57,
      "110100": 58,
      "000000100": 59,
      "10000011101000": 60,
      "00100": 61,
      "1001000000": 62,
      "11100": 63,
      "11111100": 64,
      "1110100": 65,
      "11100010": 66,
      "000100": 67,
      "0001000100": 68,
      "10100001": 69,
      "11000": 70,
      "00001": 71,
      "100000100011": 72,
      "100000100001": 73,
      "100000100010": 74,
      "10000010100000": 75,
      "10110": 76,
      "1101000": 77,
      "0011000100": 78,
      "1111000": 79,
      "1111000100": 80,
      "10110000000": 81,
      "11000011": 82,
      "011100": 83,
      "0111000100": 84,
      "100100100000": 85,
      "10000011100000": 86,
      "10000000100000": 87,
      "100110111": 88,
      "0000001001000": 89,
      "0010011001000": 90,
      "11111100000": 91,
      "11100010100011": 92,
      "0100000": 93,
      "010000": 94,
      "0110": 95,
      "010100": 96,
      "0101000": 97,
      "011000": 98,
      "001000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "0"
      ],
      [
        "100",
        "000"
      ],
      [
        "00",
        "000"
      ],
      [
        "10",
        "11"
      ],
      [
        "100",
        "0000"
      ],
      [
        "100",
        "00"
      ],
      [
        "11",
        "0"
      ],
      [
        "1000",
        "11"
      ],
      [
        "000",
        "10"
      ],
      [
        "00",
        "1100"
      ],
      [
        "000",
        "11"
      ],
      [
        "10000",
        "1"
      ],
      [
        "11",
        "1100"
      ],
      [
        "0000",
        "00"
      ],
      [
        "10",
        "1"
      ],
      [
        "1000",
        "1011"
      ],
      [
        "11",
        "1"
      ],
      [
        "10",
        "100"
      ],
      [
        "10",
        "1100"
      ],
      [
        "1100",
        "1000"
      ],
      [
        "0000",
        "000"
      ],
      [
        "1000",
        "10"
      ],
      [
        "1100",
        "00"
      ],
      [
        "0",
        "100"
      ],
      [
        "0",
        "11"
      ],
      [
        "100",
        "100"
      ],
      [
        "10",
        "1000"
      ],
      [
        "10",
        "100000"
      ],
      [
        "1100",
        "000"
      ],
      [
        "0000",
        "00000"
      ],
      [
        "100000",
        "11"
      ],
      [
        "10001011",
        "1"
      ],
      [
        "0000000",
        "1"
      ],
      [
        "000000000",
        "1000"
      ],
      [
        "100",
        "00000"
      ],
      [
        "1000",
        "100"
      ],
      [
        "00000",
        "101"
      ],
      [
        "00000",
        "11001000"
      ],
      [
        "1011",
        "1"
      ],
      [
        "1000000",
        "00"
      ],
      [
        "100011",
        "111"
      ],
      [
        "000000",
        "11"
      ],
      [
        "10001011",
        "0"
      ],
      [
        "00",
        "100001"
      ],
      [
        "100",
        "110"
      ],
      [
        "10",
        "100000000"
      ],
      [
        "1100",
        "100"
      ],
      [
        "00000",
        "100"
      ],
      [
        "110",
        "100"
      ],
      [
        "000000",
        "100"
      ],
      [
        "10000011",
        "101000"
      ],
      [
        "00",
        "100"
      ],
      [
        "100",
        "1000000"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "111100"
      ],
      [
        "11",
        "10100"
      ],
      [
        "11",
        "100010"
      ],
      [
        "000",
        "100"
      ],
      [
        "000",
        "1000100"
      ],
      [
        "10",
        "100001"
      ],
      [
        "1100",
        "0"
      ],
      [
        "0000",
        "1"
      ],
      [
        "100000",
        "100011"
      ],
      [
        "100000",
        "100001"
      ],
      [
        "100000",
        "100010"
      ],
      [
        "100000",
        "10100000"
      ],
      [
        "1011",
        "0"
      ],
      [
        "110",
        "1000"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "111100",
        "0"
      ],
      [
        "111100",
        "0100"
      ],
      [
        "101100",
        "00000"
      ],
      [
        "110000",
        "11"
      ],
      [
        "011",
        "100"
      ],
      [
        "011",
        "1000100"
      ],
      [
        "100100",
        "100000"
      ],
      [
        "10000011",
        "100000"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "100110",
        "111"
      ],
      [
        "000000100",
        "1000"
      ],
      [
        "00100",
        "11001000"
      ],
      [
        "11111100",
        "000"
      ],
      [
        "11100010",
        "100011"
      ],
      [
        "0",
        "100000"
      ],
      [
        "0",
        "10000"
      ],
      [
        "0",
        "110"
      ],
      [
        "0",
        "10100"
      ],
      [
        "0",
        "101000"
      ],
      [
        "0",
        "11000"
      ],
      [
        "00",
        "1000"
      ]
    ]
  }
}