{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "11": 4,
      "0000": 5,
      "000": 6,
      "10": 7,
      "100": 8,
      "0011": 9,
      "10000": 10,
      "00011": 11,
      "011": 12,
      "001": 13,
      "1011": 14,
      "000100": 15,
      "000011": 16,
      "1001": 17,
      "010": 18,
      "0011000100": 19,
      "0010000": 20,
      "10011": 21,
      "01": 22,
      "00000011": 23,
      "00010": 24,
      "01100": 25,
      "000011000": 26,
      "100011": 27,
      "0000000": 28,
      "000110": 29,
      "00100": 30,
      "000000011": 31,
      "0000011": 32,
      "00110": 33,
      "1000000": 34,
      "0001": 35,
      "1000011": 36,
      "00100011": 37,
      "001000001100": 38,
      "000010": 39,
      "000010000": 40,
      "000011100": 41,
      "1101": 42,
      "0000001": 43,
      "10010": 44,
      "0011000110": 45,
      "00110000001": 46,
      "101111": 47,
      "000011001": 48,
      "01010": 49,
      "001000000100": 50,
      "100110": 51,
      "1001100": 52,
      "000101011": 53,
      "1000100": 54,
      "100010": 55,
      "000000": 56,
      "0000010": 57,
      "101": 58,
      "00110000011": 59,
      "00111000011": 60,
      "1000010": 61,
      "011000011100": 62,
      "101101": 63,
      "10111000011": 64,
      "0000000110011": 65,
      "00010101100110": 66,
      "1000": 67,
      "11010": 68,
      "00000": 69,
      "00000000": 70,
      "000010010": 71,
      "10100": 72,
      "10100011": 73,
      "00111": 74,
      "100000": 75,
      "100000011": 76,
      "10000011": 77,
      "0110000011": 78,
      "101100": 79,
      "010100011": 80,
      "0010000100": 81,
      "10011010": 82,
      "01000": 83,
      "1000111": 84,
      "10111100011": 85,
      "00000000100110": 86,
      "101001001100": 87,
      "01100000111000": 88,
      "01011": 89,
      "0100000": 90,
      "010011010": 91,
      "00101": 92,
      "00101101": 93,
      "1100": 94,
      "11100": 95,
      "110011": 96,
      "1100011": 97,
      "11011": 98,
      "110000011": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "00",
        "11"
      ],
      [
        "1",
        "0000"
      ],
      [
        "000",
        "11"
      ],
      [
        "0",
        "11"
      ],
      [
        "00",
        "1"
      ],
      [
        "10",
        "11"
      ],
      [
        "000",
        "100"
      ],
      [
        "0000",
        "11"
      ],
      [
        "100",
        "1"
      ],
      [
        "0",
        "10"
      ],
      [
        "0011",
        "000100"
      ],
      [
        "00",
        "10000"
      ],
      [
        "100",
        "11"
      ],
      [
        "0",
        "1"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "000",
        "10"
      ],
      [
        "011",
        "00"
      ],
      [
        "000011",
        "000"
      ],
      [
        "1",
        "00011"
      ],
      [
        "0000",
        "000"
      ],
      [
        "00011",
        "0"
      ],
      [
        "00",
        "100"
      ],
      [
        "0000",
        "00011"
      ],
      [
        "0000",
        "011"
      ],
      [
        "0011",
        "0"
      ],
      [
        "10000",
        "00"
      ],
      [
        "000",
        "1"
      ],
      [
        "10000",
        "11"
      ],
      [
        "001",
        "00011"
      ],
      [
        "0010000",
        "01100"
      ],
      [
        "0000",
        "10"
      ],
      [
        "0000",
        "10000"
      ],
      [
        "000011",
        "100"
      ],
      [
        "11",
        "01"
      ],
      [
        "0000",
        "001"
      ],
      [
        "100",
        "10"
      ],
      [
        "0011",
        "000110"
      ],
      [
        "0011",
        "0000001"
      ],
      [
        "1011",
        "11"
      ],
      [
        "000011",
        "001"
      ],
      [
        "010",
        "10"
      ],
      [
        "0010000",
        "00100"
      ],
      [
        "10011",
        "0"
      ],
      [
        "10011",
        "00"
      ],
      [
        "00010",
        "1011"
      ],
      [
        "1",
        "000100"
      ],
      [
        "1",
        "00010"
      ],
      [
        "0000",
        "00"
      ],
      [
        "0000",
        "010"
      ],
      [
        "10",
        "1"
      ],
      [
        "0011",
        "0000011"
      ],
      [
        "0011",
        "1000011"
      ],
      [
        "10000",
        "10"
      ],
      [
        "011",
        "000011100"
      ],
      [
        "1011",
        "01"
      ],
      [
        "1011",
        "1000011"
      ],
      [
        "000000011",
        "0011"
      ],
      [
        "000101011",
        "00110"
      ],
      [
        "1",
        "000"
      ],
      [
        "11",
        "010"
      ],
      [
        "0000",
        "0"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0000",
        "10010"
      ],
      [
        "10",
        "100"
      ],
      [
        "10",
        "100011"
      ],
      [
        "0011",
        "1"
      ],
      [
        "10000",
        "0"
      ],
      [
        "10000",
        "0011"
      ],
      [
        "10000",
        "011"
      ],
      [
        "011",
        "0000011"
      ],
      [
        "1011",
        "00"
      ],
      [
        "010",
        "100011"
      ],
      [
        "0010000",
        "100"
      ],
      [
        "10011",
        "010"
      ],
      [
        "01",
        "000"
      ],
      [
        "100011",
        "1"
      ],
      [
        "101111",
        "00011"
      ],
      [
        "00000000",
        "100110"
      ],
      [
        "10100",
        "1001100"
      ],
      [
        "0110000011",
        "1000"
      ],
      [
        "0",
        "1011"
      ],
      [
        "0",
        "100000"
      ],
      [
        "0",
        "10011010"
      ],
      [
        "00",
        "101"
      ],
      [
        "00",
        "101101"
      ],
      [
        "11",
        "00"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "0011"
      ],
      [
        "11",
        "00011"
      ],
      [
        "11",
        "011"
      ],
      [
        "11",
        "0000011"
      ]
    ]
  }
}