{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "000": 6,
      "10": 7,
      "1000": 8,
      "1100": 9,
      "0000": 10,
      "100000": 11,
      "110": 12,
      "10000": 13,
      "00010": 14,
      "111": 15,
      "100010": 16,
      "000000": 17,
      "110000": 18,
      "10100": 19,
      "11000": 20,
      "00000": 21,
      "100010110": 22,
      "10000000": 23,
      "1000000": 24,
      "101000": 25,
      "1100000": 26,
      "11100000": 27,
      "00011": 28,
      "10000010": 29,
      "001000": 30,
      "100001": 31,
      "000000100": 32,
      "1111": 33,
      "11110": 34,
      "00010111": 35,
      "10000000100000": 36,
      "0000001001000": 37,
      "00100": 38,
      "10010": 39,
      "000100": 40,
      "100011": 41,
      "11001000": 42,
      "110110": 43,
      "1111000": 44,
      "100010111": 45,
      "10000010100000": 46,
      "011000": 47,
      "0000010": 48,
      "11101000": 49,
      "10110000": 50,
      "110011": 51,
      "00000111": 52,
      "0000011001000": 53,
      "00000101": 54,
      "010000": 55,
      "00110": 56,
      "00100001": 57,
      "0010110000": 58,
      "100100": 59,
      "100110": 60,
      "11100": 61,
      "1110": 62,
      "11110000": 63,
      "1110000000": 64,
      "0001": 65,
      "101100": 66,
      "10110": 67,
      "1010100": 68,
      "1010000000": 69,
      "1000100": 70,
      "11000000": 71,
      "1100101000": 72,
      "10000010000": 73,
      "10000011100000": 74,
      "10000010010": 75,
      "1101": 76,
      "0001011000": 77,
      "00000011": 78,
      "00000010": 79,
      "110000100010": 80,
      "110000100011": 81,
      "11000111": 82,
      "10000001100000": 83,
      "1111010": 84,
      "0010010000": 85,
      "110110100000": 86,
      "0011010000": 87,
      "10100000001": 88,
      "110010100011": 89,
      "01": 90,
      "011": 91,
      "0100000": 92,
      "0110": 93,
      "0110000": 94,
      "010100": 95,
      "011000000": 96,
      "1100010": 97,
      "001100": 98,
      "0010100": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "100",
        "0"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "000"
      ],
      [
        "11",
        "0"
      ],
      [
        "100",
        "00"
      ],
      [
        "000",
        "10"
      ],
      [
        "11",
        "1"
      ],
      [
        "1000",
        "10"
      ],
      [
        "0000",
        "00"
      ],
      [
        "1100",
        "00"
      ],
      [
        "10",
        "100"
      ],
      [
        "1",
        "1000"
      ],
      [
        "00",
        "000"
      ],
      [
        "100010",
        "110"
      ],
      [
        "10000",
        "000"
      ],
      [
        "100",
        "0000"
      ],
      [
        "10",
        "1000"
      ],
      [
        "1100",
        "000"
      ],
      [
        "11",
        "100000"
      ],
      [
        "000",
        "11"
      ],
      [
        "100000",
        "10"
      ],
      [
        "00",
        "1000"
      ],
      [
        "10000",
        "1"
      ],
      [
        "000000",
        "100"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "110"
      ],
      [
        "00010",
        "111"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "000000100",
        "1000"
      ],
      [
        "00",
        "100"
      ],
      [
        "100",
        "10"
      ],
      [
        "000",
        "100"
      ],
      [
        "1000",
        "11"
      ],
      [
        "1100",
        "1000"
      ],
      [
        "110",
        "110"
      ],
      [
        "111",
        "1000"
      ],
      [
        "100010",
        "111"
      ],
      [
        "10000010",
        "100000"
      ],
      [
        "0",
        "11000"
      ],
      [
        "00",
        "00010"
      ],
      [
        "11",
        "101000"
      ],
      [
        "10",
        "110000"
      ],
      [
        "1100",
        "11"
      ],
      [
        "00000",
        "111"
      ],
      [
        "00000",
        "11001000"
      ],
      [
        "0000010",
        "1"
      ],
      [
        "0",
        "10000"
      ],
      [
        "00",
        "110"
      ],
      [
        "00",
        "100001"
      ],
      [
        "00",
        "10110000"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "110"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "10"
      ],
      [
        "11",
        "110000"
      ],
      [
        "11",
        "10000000"
      ],
      [
        "000",
        "1"
      ],
      [
        "10",
        "1100"
      ],
      [
        "10",
        "110"
      ],
      [
        "10",
        "10100"
      ],
      [
        "10",
        "10000000"
      ],
      [
        "1000",
        "100"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "1100",
        "101000"
      ],
      [
        "100000",
        "10000"
      ],
      [
        "100000",
        "11100000"
      ],
      [
        "100000",
        "10010"
      ],
      [
        "110",
        "1"
      ],
      [
        "00010",
        "11000"
      ],
      [
        "000000",
        "11"
      ],
      [
        "000000",
        "10"
      ],
      [
        "110000",
        "100010"
      ],
      [
        "110000",
        "100011"
      ],
      [
        "11000",
        "111"
      ],
      [
        "1000000",
        "1100000"
      ],
      [
        "11110",
        "10"
      ],
      [
        "00100",
        "10000"
      ],
      [
        "110110",
        "100000"
      ],
      [
        "00110",
        "10000"
      ],
      [
        "1010000000",
        "1"
      ],
      [
        "1100101000",
        "11"
      ],
      [
        "0",
        "1"
      ],
      [
        "0",
        "11"
      ],
      [
        "0",
        "100000"
      ],
      [
        "0",
        "110"
      ],
      [
        "0",
        "110000"
      ],
      [
        "0",
        "10100"
      ],
      [
        "0",
        "11000000"
      ],
      [
        "1",
        "100010"
      ],
      [
        "00",
        "1100"
      ],
      [
        "00",
        "10100"
      ]
    ]
  }
}