{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "11": 7,
      "0100": 8,
      "1100": 9,
      "0001": 10,
      "10001": 11,
      "000": 12,
      "1000000": 13,
      "1000": 14,
      "101": 15,
      "0111": 16,
      "000000": 17,
      "00010": 18,
      "011": 19,
      "10100": 20,
      "000100": 21,
      "00011": 22,
      "010100": 23,
      "1110001": 24,
      "100010111": 25,
      "001": 26,
      "001100": 27,
      "0110": 28,
      "1001100": 29,
      "1001000": 30,
      "110000": 31,
      "1000001": 32,
      "0101": 33,
      "00001": 34,
      "00000111": 35,
      "1111": 36,
      "100010110": 37,
      "1011100": 38,
      "100100": 39,
      "1000100": 40,
      "010": 41,
      "011100": 42,
      "000001": 43,
      "11100": 44,
      "0100000": 45,
      "10000000": 46,
      "0000001001000": 47,
      "11000010100": 48,
      "10": 49,
      "0011": 50,
      "1001000000": 51,
      "011000": 52,
      "010111": 53,
      "00000001": 54,
      "110100": 55,
      "111100": 56,
      "11000000": 57,
      "1100000": 58,
      "000101": 59,
      "100010100": 60,
      "100000000001": 61,
      "101100": 62,
      "00000011": 63,
      "11100011": 64,
      "11100011100": 65,
      "0011000100": 66,
      "00100": 67,
      "001001100": 68,
      "100000100": 69,
      "100001": 70,
      "0000000": 71,
      "11101": 72,
      "111110001": 73,
      "1110": 74,
      "01000001": 75,
      "01000101": 76,
      "000111": 77,
      "100011000001": 78,
      "100011110": 79,
      "1011000": 80,
      "10110000000": 81,
      "0000001011000": 82,
      "0001000100": 83,
      "0101000000": 84,
      "10000010100000": 85,
      "0111000001": 86,
      "0000011001000": 87,
      "11100000": 88,
      "11000010100000": 89,
      "11000010100011": 90,
      "10010000001": 91,
      "01011101": 92,
      "100010100011": 93,
      "0010011001000": 94,
      "111010110": 95,
      "11111000101": 96,
      "001000": 97,
      "00101": 98,
      "100000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "01"
      ],
      [
        "100",
        "01"
      ],
      [
        "00",
        "0"
      ],
      [
        "100",
        "0000"
      ],
      [
        "100",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "01",
        "11"
      ],
      [
        "0000",
        "00"
      ],
      [
        "0001",
        "0"
      ],
      [
        "01",
        "1"
      ],
      [
        "1",
        "0100"
      ],
      [
        "00",
        "0100"
      ],
      [
        "0001",
        "1"
      ],
      [
        "01",
        "0100"
      ],
      [
        "11",
        "10001"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "00",
        "1"
      ],
      [
        "00",
        "1100"
      ],
      [
        "011",
        "0"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "1000"
      ],
      [
        "1100",
        "00"
      ],
      [
        "100",
        "0001"
      ],
      [
        "01",
        "01"
      ],
      [
        "0000",
        "1"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "11",
        "11"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "101",
        "1100"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "0100"
      ],
      [
        "01",
        "0"
      ],
      [
        "01",
        "1100"
      ],
      [
        "0000",
        "01"
      ],
      [
        "11",
        "100"
      ],
      [
        "0100",
        "000"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "110000",
        "10100"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "11"
      ],
      [
        "100",
        "1000000"
      ],
      [
        "01",
        "1000"
      ],
      [
        "01",
        "0111"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "11",
        "0100"
      ],
      [
        "11",
        "1100"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "1100",
        "000"
      ],
      [
        "0001",
        "01"
      ],
      [
        "10001",
        "0100"
      ],
      [
        "1000000",
        "00001"
      ],
      [
        "101",
        "100"
      ],
      [
        "000000",
        "11"
      ],
      [
        "1110001",
        "1"
      ],
      [
        "1110001",
        "1100"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "1001100"
      ],
      [
        "100",
        "000100"
      ],
      [
        "100",
        "001"
      ],
      [
        "0000",
        "000"
      ],
      [
        "11",
        "101"
      ],
      [
        "11",
        "1110001"
      ],
      [
        "11",
        "10"
      ],
      [
        "0100",
        "0001"
      ],
      [
        "0100",
        "0101"
      ],
      [
        "0001",
        "11"
      ],
      [
        "10001",
        "1000001"
      ],
      [
        "10001",
        "1110"
      ],
      [
        "101",
        "1000"
      ],
      [
        "101",
        "10000000"
      ],
      [
        "000000",
        "1011000"
      ],
      [
        "000100",
        "0100"
      ],
      [
        "010100",
        "0000"
      ],
      [
        "1000001",
        "0100000"
      ],
      [
        "011100",
        "0001"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "11100",
        "000"
      ],
      [
        "11000010100",
        "000"
      ],
      [
        "11000010100",
        "011"
      ],
      [
        "1001000000",
        "1"
      ],
      [
        "010111",
        "01"
      ],
      [
        "100010100",
        "011"
      ],
      [
        "001001100",
        "1000"
      ],
      [
        "11101",
        "0110"
      ],
      [
        "111110001",
        "01"
      ],
      [
        "00",
        "1000"
      ],
      [
        "00",
        "101"
      ],
      [
        "100",
        "000"
      ]
    ]
  }
}