{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "0000": 6,
      "01": 7,
      "0100": 8,
      "1100": 9,
      "011": 10,
      "1000000": 11,
      "1000": 12,
      "0001": 13,
      "10100": 14,
      "000": 15,
      "00011": 16,
      "001": 17,
      "10001": 18,
      "000100": 19,
      "001100": 20,
      "000001": 21,
      "101": 22,
      "1001100": 23,
      "0111": 24,
      "111": 25,
      "00000001": 26,
      "100011": 27,
      "111100": 28,
      "0011": 29,
      "1001000": 30,
      "0100000": 31,
      "00010": 32,
      "100010111": 33,
      "1011": 34,
      "001000": 35,
      "0010100": 36,
      "1000100": 37,
      "100001": 38,
      "1111": 39,
      "11000000": 40,
      "11000010100": 41,
      "1000001": 42,
      "110100": 43,
      "00001": 44,
      "0000000": 45,
      "0110": 46,
      "10000001": 47,
      "10100001": 48,
      "0000011001100": 49,
      "0000011001000": 50,
      "100011111": 51,
      "100000": 52,
      "000000": 53,
      "00000000": 54,
      "00000011": 55,
      "010": 56,
      "1010001": 57,
      "100010100": 58,
      "0001000100": 59,
      "10101": 60,
      "11000010100000": 61,
      "00100": 62,
      "100000100": 63,
      "100001100": 64,
      "1001001100": 65,
      "1000011": 66,
      "10010000001": 67,
      "1101": 68,
      "11111": 69,
      "11100001": 70,
      "00000111": 71,
      "010100": 72,
      "01000": 73,
      "11001100": 74,
      "1100000": 75,
      "1100001": 76,
      "110011100001": 77,
      "10000000100000": 78,
      "100000000001": 79,
      "10100000001": 80,
      "100010110": 81,
      "0011000100": 82,
      "00000101": 83,
      "1011000000": 84,
      "10011001000": 85,
      "1111000000": 86,
      "1111000001": 87,
      "101111111": 88,
      "11000000100000": 89,
      "0000001001000": 90,
      "0000000001000": 91,
      "10100010100000": 92,
      "100010100010": 93,
      "101010110": 94,
      "100000100001": 95,
      "1000011001000": 96,
      "0101000000": 97,
      "00111": 98,
      "0010011001000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "1",
        "100"
      ],
      [
        "0",
        "11"
      ],
      [
        "100",
        "0000"
      ],
      [
        "100",
        "0"
      ],
      [
        "00",
        "01"
      ],
      [
        "1",
        "0100"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "011"
      ],
      [
        "00",
        "1"
      ],
      [
        "100",
        "01"
      ],
      [
        "00",
        "0100"
      ],
      [
        "00",
        "1100"
      ],
      [
        "0000",
        "01"
      ],
      [
        "1",
        "01"
      ],
      [
        "100",
        "1100"
      ],
      [
        "011",
        "1"
      ],
      [
        "11",
        "1"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "100",
        "011"
      ],
      [
        "11",
        "1100"
      ],
      [
        "00",
        "11"
      ],
      [
        "100",
        "1000"
      ],
      [
        "0100",
        "000"
      ],
      [
        "0001",
        "0"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "1",
        "011"
      ],
      [
        "00",
        "1000"
      ],
      [
        "00",
        "10100"
      ],
      [
        "100",
        "0100"
      ],
      [
        "100",
        "001"
      ],
      [
        "11",
        "11"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "1100",
        "0010100"
      ],
      [
        "100",
        "0001"
      ],
      [
        "11",
        "0100"
      ],
      [
        "0000",
        "1"
      ],
      [
        "0000",
        "000"
      ],
      [
        "011",
        "0"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "10100",
        "001"
      ],
      [
        "000001",
        "1001100"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "100011",
        "111"
      ],
      [
        "100",
        "000"
      ],
      [
        "0000",
        "00"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "01",
        "0"
      ],
      [
        "10100",
        "01"
      ],
      [
        "10001",
        "0100"
      ],
      [
        "000100",
        "0100"
      ],
      [
        "101",
        "01"
      ],
      [
        "11000010100",
        "000"
      ],
      [
        "00",
        "100"
      ],
      [
        "100",
        "000100"
      ],
      [
        "100",
        "001100"
      ],
      [
        "100",
        "1001100"
      ],
      [
        "100",
        "0011"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "11",
        "01"
      ],
      [
        "11",
        "111"
      ],
      [
        "11",
        "100001"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "01",
        "0100"
      ],
      [
        "0100",
        "0"
      ],
      [
        "1100",
        "1100"
      ],
      [
        "1100",
        "000"
      ],
      [
        "1100",
        "001"
      ],
      [
        "1100",
        "11100001"
      ],
      [
        "1000000",
        "0100000"
      ],
      [
        "1000000",
        "00001"
      ],
      [
        "10100",
        "000001"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "000001",
        "01"
      ],
      [
        "101",
        "1000000"
      ],
      [
        "1001100",
        "1000"
      ],
      [
        "111100",
        "0000"
      ],
      [
        "111100",
        "0001"
      ],
      [
        "1011",
        "11111"
      ],
      [
        "11000000",
        "100000"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "00000000",
        "01000"
      ],
      [
        "1010001",
        "0100000"
      ],
      [
        "100010100",
        "010"
      ],
      [
        "10101",
        "0110"
      ],
      [
        "100000100",
        "001"
      ],
      [
        "100001100",
        "1000"
      ],
      [
        "010100",
        "0000"
      ],
      [
        "00",
        "111"
      ],
      [
        "00",
        "10011001000"
      ]
    ]
  }
}