{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "001": 6,
      "011": 7,
      "0000": 8,
      "1001": 9,
      "0100": 10,
      "10000": 11,
      "0011": 12,
      "001100": 13,
      "00100": 14,
      "010": 15,
      "00011": 16,
      "01100": 17,
      "1100": 18,
      "00110000": 19,
      "0011000100": 20,
      "000100": 21,
      "10": 22,
      "00001100": 23,
      "1000000": 24,
      "01011": 25,
      "000011000": 26,
      "11": 27,
      "000": 28,
      "0001": 29,
      "0000100": 30,
      "0010000": 31,
      "100110": 32,
      "00100011": 33,
      "00110000011": 34,
      "00010": 35,
      "00000011": 36,
      "0011100": 37,
      "00110000001": 38,
      "100001": 39,
      "01000": 40,
      "100000": 41,
      "10000011": 42,
      "01001": 43,
      "101": 44,
      "000010000": 45,
      "1001100": 46,
      "0100011": 47,
      "1100010": 48,
      "0010000100": 49,
      "100010": 50,
      "0101": 51,
      "01010": 52,
      "0110": 53,
      "00000000": 54,
      "000000011": 55,
      "00000001": 56,
      "00111100": 57,
      "001000000100": 58,
      "001001001100": 59,
      "011000100": 60,
      "011000000100": 61,
      "001000001100": 62,
      "1000010": 63,
      "11100": 64,
      "101000": 65,
      "10100011": 66,
      "00001": 67,
      "100100": 68,
      "1000100": 69,
      "1000110": 70,
      "001011": 71,
      "000000010": 72,
      "1001100000": 73,
      "100000011": 74,
      "001101100": 75,
      "00110100011": 76,
      "001000011100": 77,
      "001001000100": 78,
      "000110": 79,
      "111": 80,
      "00011001": 81,
      "00111000011": 82,
      "0000000111001": 83,
      "001111000": 84,
      "11100011": 85,
      "0000000101001": 86,
      "1000000111001": 87,
      "1011": 88,
      "11001": 89,
      "101100": 90,
      "101011": 91,
      "1100110": 92,
      "1100000": 93,
      "110000011": 94,
      "1011000100": 95,
      "001001": 96,
      "000011": 97,
      "0001100": 98,
      "000011100": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "1"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "100",
        "00"
      ],
      [
        "001",
        "1"
      ],
      [
        "001",
        "100"
      ],
      [
        "00",
        "100"
      ],
      [
        "01",
        "0"
      ],
      [
        "00",
        "011"
      ],
      [
        "01",
        "100"
      ],
      [
        "1",
        "100"
      ],
      [
        "001",
        "10000"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "00",
        "0100"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "001100"
      ],
      [
        "100",
        "0000"
      ],
      [
        "01",
        "011"
      ],
      [
        "00001100",
        "0"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "01"
      ],
      [
        "0000",
        "100"
      ],
      [
        "00",
        "10000"
      ],
      [
        "1001",
        "10"
      ],
      [
        "00100",
        "011"
      ],
      [
        "00110000",
        "011"
      ],
      [
        "00",
        "010"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "0011",
        "100"
      ],
      [
        "00110000",
        "001"
      ],
      [
        "100",
        "001"
      ],
      [
        "0100",
        "0"
      ],
      [
        "10000",
        "0"
      ],
      [
        "10000",
        "011"
      ],
      [
        "0",
        "1001"
      ],
      [
        "1",
        "01"
      ],
      [
        "0000",
        "10000"
      ],
      [
        "1001",
        "100"
      ],
      [
        "0100",
        "011"
      ],
      [
        "1100",
        "010"
      ],
      [
        "0010000",
        "100"
      ],
      [
        "100",
        "010"
      ],
      [
        "01",
        "01"
      ],
      [
        "01",
        "010"
      ],
      [
        "011",
        "0"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0000",
        "00011"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "0011",
        "1100"
      ],
      [
        "00100",
        "0000100"
      ],
      [
        "00100",
        "1001100"
      ],
      [
        "01100",
        "0100"
      ],
      [
        "01100",
        "0000100"
      ],
      [
        "0010000",
        "01100"
      ],
      [
        "100001",
        "0"
      ],
      [
        "1",
        "1100"
      ],
      [
        "1",
        "01000"
      ],
      [
        "1",
        "0100011"
      ],
      [
        "00",
        "001"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "0100"
      ],
      [
        "100",
        "0110"
      ],
      [
        "001",
        "011"
      ],
      [
        "0000",
        "00010"
      ],
      [
        "1001",
        "100000"
      ],
      [
        "10000",
        "0011"
      ],
      [
        "0011",
        "01100"
      ],
      [
        "0011",
        "0100011"
      ],
      [
        "00100",
        "0011100"
      ],
      [
        "00100",
        "1000100"
      ],
      [
        "00011",
        "0"
      ],
      [
        "11",
        "1"
      ],
      [
        "0001",
        "1001"
      ],
      [
        "0011100",
        "0011"
      ],
      [
        "000000011",
        "1001"
      ],
      [
        "00111100",
        "0"
      ],
      [
        "11100",
        "011"
      ],
      [
        "000000010",
        "1001"
      ],
      [
        "100000011",
        "1001"
      ],
      [
        "1",
        "011"
      ],
      [
        "1",
        "1001"
      ],
      [
        "1",
        "01100"
      ],
      [
        "1",
        "01011"
      ],
      [
        "1",
        "100110"
      ],
      [
        "1",
        "100000"
      ],
      [
        "1",
        "10000011"
      ],
      [
        "1",
        "011000100"
      ],
      [
        "00",
        "1001"
      ],
      [
        "00",
        "0011"
      ],
      [
        "00",
        "01100"
      ],
      [
        "00",
        "0011100"
      ]
    ]
  }
}