{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "011": 7,
      "0000": 8,
      "11": 9,
      "1100": 10,
      "010": 11,
      "0100": 12,
      "1000000": 13,
      "100000": 14,
      "1000": 15,
      "0111": 16,
      "00010": 17,
      "10001": 18,
      "10000011": 19,
      "000001": 20,
      "000": 21,
      "000100": 22,
      "10": 23,
      "0110": 24,
      "000000": 25,
      "100010111": 26,
      "101": 27,
      "01111": 28,
      "1001100": 29,
      "100000000": 30,
      "10000010": 31,
      "1100010": 32,
      "10000000": 33,
      "100010110": 34,
      "1001000": 35,
      "10001111": 36,
      "011100": 37,
      "00000101": 38,
      "10100000000": 39,
      "1100000": 40,
      "001100": 41,
      "100100": 42,
      "0111000000": 43,
      "00000111": 44,
      "1101": 45,
      "0100010": 46,
      "01000111": 47,
      "10000011100000": 48,
      "10000000100000": 49,
      "11000000": 50,
      "0001": 51,
      "00011": 52,
      "10011": 53,
      "100001": 54,
      "1000001": 55,
      "1000011": 56,
      "100001100": 57,
      "11011": 58,
      "110010000011": 59,
      "0100011": 60,
      "00000001": 61,
      "00000011": 62,
      "0000001001000": 63,
      "100011110": 64,
      "11000000100000": 65,
      "1010": 66,
      "10110": 67,
      "10100010": 68,
      "11000001": 69,
      "0011000001": 70,
      "100010": 71,
      "1000100": 72,
      "01100": 73,
      "0101": 74,
      "10000100": 75,
      "10000000001": 76,
      "1000010": 77,
      "011011100": 78,
      "110": 79,
      "1100011": 80,
      "0101000100": 81,
      "10000000100010": 82,
      "100010000010": 83,
      "0000011001100": 84,
      "0000011001000": 85,
      "1011000000": 86,
      "10110000000": 87,
      "10000010100000": 88,
      "10000010100010": 89,
      "100011111": 90,
      "0111000100": 91,
      "10110100000": 92,
      "10100010100000": 93,
      "1011": 94,
      "10100": 95,
      "10111": 96,
      "110000011": 97,
      "00100": 98,
      "001000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "100"
      ],
      [
        "01",
        "0"
      ],
      [
        "0",
        "100"
      ],
      [
        "10000",
        "00"
      ],
      [
        "10000",
        "0"
      ],
      [
        "100",
        "0"
      ],
      [
        "011",
        "1"
      ],
      [
        "00",
        "010"
      ],
      [
        "100",
        "01"
      ],
      [
        "10000",
        "011"
      ],
      [
        "0000",
        "01"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "0100"
      ],
      [
        "1",
        "0"
      ],
      [
        "011",
        "0"
      ],
      [
        "0000",
        "00"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "1",
        "01"
      ],
      [
        "011",
        "11"
      ],
      [
        "100",
        "1100"
      ],
      [
        "10000",
        "0000"
      ],
      [
        "10000",
        "010"
      ],
      [
        "1100",
        "010"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "100",
        "1000"
      ],
      [
        "100",
        "01111"
      ],
      [
        "011",
        "100"
      ],
      [
        "000001",
        "01"
      ],
      [
        "10",
        "100000000"
      ],
      [
        "1",
        "100000"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "100"
      ],
      [
        "011",
        "1000000"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "11",
        "01"
      ],
      [
        "0100",
        "010"
      ],
      [
        "0100",
        "0111"
      ],
      [
        "10000011",
        "100000"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "1",
        "1000000"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "011"
      ],
      [
        "100",
        "11"
      ],
      [
        "10000",
        "1"
      ],
      [
        "10000",
        "01"
      ],
      [
        "10000",
        "11"
      ],
      [
        "10000",
        "1100"
      ],
      [
        "11",
        "011"
      ],
      [
        "1100",
        "10000011"
      ],
      [
        "0100",
        "011"
      ],
      [
        "000000",
        "01"
      ],
      [
        "000000",
        "11"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "10001111",
        "0"
      ],
      [
        "11000000",
        "100000"
      ],
      [
        "1",
        "010"
      ],
      [
        "1",
        "0110"
      ],
      [
        "1",
        "0100010"
      ],
      [
        "1",
        "1000001"
      ],
      [
        "00",
        "11000001"
      ],
      [
        "100",
        "010"
      ],
      [
        "100",
        "0100"
      ],
      [
        "01",
        "100"
      ],
      [
        "01",
        "01"
      ],
      [
        "10000",
        "100"
      ],
      [
        "10000",
        "000001"
      ],
      [
        "10000",
        "10"
      ],
      [
        "011",
        "011100"
      ],
      [
        "11",
        "0"
      ],
      [
        "1100",
        "011"
      ],
      [
        "010",
        "1000100"
      ],
      [
        "1000000",
        "0100010"
      ],
      [
        "1000",
        "10000010"
      ],
      [
        "000001",
        "1001100"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "101",
        "1000000"
      ],
      [
        "101",
        "10000000"
      ],
      [
        "10000010",
        "100000"
      ],
      [
        "10000010",
        "100010"
      ],
      [
        "10001111",
        "1"
      ],
      [
        "011100",
        "0100"
      ],
      [
        "10110",
        "100000"
      ],
      [
        "10100010",
        "100000"
      ],
      [
        "1",
        "011"
      ],
      [
        "1",
        "0100"
      ],
      [
        "1",
        "0111"
      ],
      [
        "1",
        "10000011"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "1000"
      ]
    ]
  }
}