{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "11": 5,
      "0000": 6,
      "1100": 7,
      "000": 8,
      "10": 9,
      "11000": 10,
      "0011": 11,
      "00100": 12,
      "1001": 13,
      "00011": 14,
      "1000": 15,
      "110": 16,
      "10000": 17,
      "00001": 18,
      "001100": 19,
      "00000011": 20,
      "101": 21,
      "001": 22,
      "000011000": 23,
      "1000010": 24,
      "00110000011": 25,
      "0011000": 26,
      "11100": 27,
      "00000": 28,
      "0011100": 29,
      "100011": 30,
      "1000000": 31,
      "100000": 32,
      "0000100": 33,
      "0001100": 34,
      "001000001100": 35,
      "11001": 36,
      "1011100": 37,
      "001000000100": 38,
      "000110": 39,
      "100010": 40,
      "0000000": 41,
      "0001": 42,
      "1100011": 43,
      "0011000100": 44,
      "0000010": 45,
      "01100011": 46,
      "10000100": 47,
      "000011": 48,
      "00110000001": 49,
      "0011000110": 50,
      "0011100100": 51,
      "10010": 52,
      "000000011": 53,
      "000010000": 54,
      "000011001": 55,
      "1100100": 56,
      "1100010": 57,
      "11000100000": 58,
      "00100000110": 59,
      "11010000100": 60,
      "00111000011": 61,
      "0000000111001": 62,
      "001000001101": 63,
      "0100": 64,
      "01000": 65,
      "10000011": 66,
      "10011000100000": 67,
      "1111": 68,
      "11100011": 69,
      "000010": 70,
      "1100101": 71,
      "000101": 72,
      "000100010": 73,
      "101001": 74,
      "1000100": 75,
      "10001100100": 76,
      "110110": 77,
      "0000001111001": 78,
      "1000000000101": 79,
      "000011101": 80,
      "11010000100101": 81,
      "0001000101001": 82,
      "011": 83,
      "01001": 84,
      "0100000": 85,
      "00101001": 86,
      "10011": 87,
      "1001100": 88,
      "1001000": 89,
      "1001000010": 90,
      "10000000": 91,
      "100100000": 92,
      "10010000100": 93,
      "111": 94,
      "1111100": 95,
      "111100011": 96,
      "000011100": 97,
      "000000000": 98,
      "110011": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "1100",
        "0"
      ],
      [
        "00",
        "11"
      ],
      [
        "00",
        "100"
      ],
      [
        "100",
        "1"
      ],
      [
        "000",
        "11"
      ],
      [
        "100",
        "0"
      ],
      [
        "11",
        "0"
      ],
      [
        "100",
        "00"
      ],
      [
        "0000",
        "1"
      ],
      [
        "00",
        "1100"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "10",
        "1"
      ],
      [
        "00",
        "1"
      ],
      [
        "0000",
        "11000"
      ],
      [
        "10000",
        "10"
      ],
      [
        "001100",
        "00011"
      ],
      [
        "00",
        "11000"
      ],
      [
        "11",
        "100"
      ],
      [
        "0000",
        "0"
      ],
      [
        "0011",
        "100"
      ],
      [
        "1000",
        "11"
      ],
      [
        "100",
        "0000"
      ],
      [
        "100",
        "000"
      ],
      [
        "0000",
        "100"
      ],
      [
        "000",
        "1100"
      ],
      [
        "00100",
        "0001100"
      ],
      [
        "1100",
        "1"
      ],
      [
        "10",
        "11100"
      ],
      [
        "00100",
        "0000100"
      ],
      [
        "00011",
        "0"
      ],
      [
        "1000",
        "10"
      ],
      [
        "0000",
        "000"
      ],
      [
        "000",
        "1"
      ],
      [
        "11000",
        "11"
      ],
      [
        "0011000",
        "100"
      ],
      [
        "00000",
        "10"
      ],
      [
        "0",
        "1100011"
      ],
      [
        "100",
        "00100"
      ],
      [
        "0000",
        "11"
      ],
      [
        "001100",
        "00001"
      ],
      [
        "0011000",
        "110"
      ],
      [
        "0011100",
        "100"
      ],
      [
        "100",
        "10"
      ],
      [
        "0000",
        "00011"
      ],
      [
        "0000",
        "10000"
      ],
      [
        "0000",
        "11001"
      ],
      [
        "1100",
        "100"
      ],
      [
        "11000",
        "10"
      ],
      [
        "11000",
        "100000"
      ],
      [
        "00100",
        "000110"
      ],
      [
        "110",
        "10000100"
      ],
      [
        "0011100",
        "0011"
      ],
      [
        "000000011",
        "1001"
      ],
      [
        "00100000110",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "0",
        "1000"
      ],
      [
        "100",
        "00011"
      ],
      [
        "100",
        "11000100000"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "100011"
      ],
      [
        "0000",
        "10"
      ],
      [
        "1100",
        "101"
      ],
      [
        "000",
        "101"
      ],
      [
        "000",
        "100010"
      ],
      [
        "10",
        "1001"
      ],
      [
        "1000",
        "100"
      ],
      [
        "1000",
        "1100100"
      ],
      [
        "110",
        "110"
      ],
      [
        "00000011",
        "11001"
      ],
      [
        "1000000",
        "000101"
      ],
      [
        "000011",
        "101"
      ],
      [
        "11010000100",
        "101"
      ],
      [
        "000100010",
        "1001"
      ],
      [
        "0",
        "11"
      ],
      [
        "0",
        "1001"
      ],
      [
        "0",
        "100000"
      ],
      [
        "00",
        "101001"
      ],
      [
        "100",
        "11"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "1000"
      ],
      [
        "100",
        "1000010"
      ],
      [
        "100",
        "00000"
      ],
      [
        "100",
        "100000"
      ],
      [
        "100",
        "10000100"
      ],
      [
        "11",
        "1"
      ],
      [
        "11",
        "11100"
      ],
      [
        "11",
        "1100011"
      ],
      [
        "0000",
        "11100"
      ],
      [
        "0000",
        "00000"
      ],
      [
        "1100",
        "11"
      ]
    ]
  }
}