{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "11": 7,
      "0000": 8,
      "010": 9,
      "0101": 10,
      "1100": 11,
      "1000": 12,
      "1000000": 13,
      "10": 14,
      "011": 15,
      "100000": 16,
      "000": 17,
      "00010": 18,
      "100000000": 19,
      "100010": 20,
      "110000": 21,
      "000000": 22,
      "0111": 23,
      "010111": 24,
      "10000001": 25,
      "10000011": 26,
      "011000": 27,
      "1001000": 28,
      "10000000011": 29,
      "100100": 30,
      "100010111": 31,
      "0110000001": 32,
      "100001": 33,
      "010110": 34,
      "001": 35,
      "110010": 36,
      "10000000": 37,
      "101": 38,
      "1001": 39,
      "100011": 40,
      "100010110": 41,
      "10000010": 42,
      "111": 43,
      "010101": 44,
      "000100": 45,
      "11000011": 46,
      "0000001001000": 47,
      "10000011100000": 48,
      "1100000": 49,
      "001100": 50,
      "001000": 51,
      "00011": 52,
      "00010101": 53,
      "10010000001": 54,
      "110": 55,
      "1110000000": 56,
      "000001": 57,
      "0000011": 58,
      "10100000": 59,
      "10100000000": 60,
      "10100001": 61,
      "100000100010": 62,
      "10000000001": 63,
      "00000011": 64,
      "110010100010": 65,
      "0000011011000": 66,
      "010000": 67,
      "01000": 68,
      "11000000": 69,
      "1011000": 70,
      "110000000011": 71,
      "000111": 72,
      "0010100001": 73,
      "1001100": 74,
      "1000111": 75,
      "100001100": 76,
      "1101": 77,
      "11100010": 78,
      "11010111": 79,
      "110110000001": 80,
      "00000111": 81,
      "01010111": 82,
      "11000101": 83,
      "1100011": 84,
      "101000000": 85,
      "11000001": 86,
      "110000100010": 87,
      "11000010100000": 88,
      "000000101": 89,
      "10000000100000": 90,
      "10000010100000": 91,
      "111010110": 92,
      "11000000100001": 93,
      "0000011101000": 94,
      "0100": 95,
      "0100000": 96,
      "1010111": 97,
      "101010111": 98,
      "00010111": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "01",
        "0"
      ],
      [
        "01",
        "01"
      ],
      [
        "1",
        "100"
      ],
      [
        "100",
        "0"
      ],
      [
        "10000",
        "00"
      ],
      [
        "1",
        "0"
      ],
      [
        "01",
        "1"
      ],
      [
        "10000",
        "0"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "010"
      ],
      [
        "10000",
        "0000"
      ],
      [
        "100",
        "010"
      ],
      [
        "1",
        "10000"
      ],
      [
        "0000",
        "00"
      ],
      [
        "01",
        "11"
      ],
      [
        "0101",
        "11"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "10000",
        "011"
      ],
      [
        "01",
        "1000"
      ],
      [
        "100",
        "1000"
      ],
      [
        "100000000",
        "11"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "010111"
      ],
      [
        "01",
        "10000001"
      ],
      [
        "10000",
        "1"
      ],
      [
        "0101",
        "10"
      ],
      [
        "00",
        "1"
      ],
      [
        "1100",
        "10"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "100",
        "1"
      ],
      [
        "100",
        "011"
      ],
      [
        "100",
        "010110"
      ],
      [
        "10000",
        "010"
      ],
      [
        "11",
        "1"
      ],
      [
        "0101",
        "01"
      ],
      [
        "000",
        "100"
      ],
      [
        "110000",
        "11"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "10000011",
        "100000"
      ],
      [
        "1",
        "100000"
      ],
      [
        "00",
        "1100"
      ],
      [
        "00",
        "1000"
      ],
      [
        "00",
        "011"
      ],
      [
        "00",
        "010101"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "11",
        "0"
      ],
      [
        "11",
        "10000000"
      ],
      [
        "0000",
        "01"
      ],
      [
        "0000",
        "011"
      ],
      [
        "10",
        "100000"
      ],
      [
        "10",
        "100000000"
      ],
      [
        "10",
        "100001"
      ],
      [
        "100000",
        "100010"
      ],
      [
        "100000000",
        "01"
      ],
      [
        "000000",
        "11"
      ],
      [
        "110010",
        "100010"
      ],
      [
        "0000011",
        "011000"
      ],
      [
        "0",
        "10000"
      ],
      [
        "0",
        "1000"
      ],
      [
        "1",
        "1000000"
      ],
      [
        "1",
        "011000"
      ],
      [
        "1",
        "10000000011"
      ],
      [
        "00",
        "0111"
      ],
      [
        "00",
        "10100001"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "0111"
      ],
      [
        "10000",
        "1100"
      ],
      [
        "11",
        "01"
      ],
      [
        "11",
        "100010"
      ],
      [
        "11",
        "010111"
      ],
      [
        "11",
        "0110000001"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "0101",
        "0111"
      ],
      [
        "1100",
        "0101"
      ],
      [
        "1100",
        "011"
      ],
      [
        "10",
        "1000000"
      ],
      [
        "110000",
        "01"
      ],
      [
        "110000",
        "100010"
      ],
      [
        "110000",
        "10100000"
      ],
      [
        "000000",
        "101"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "10000010",
        "100000"
      ],
      [
        "111",
        "010110"
      ],
      [
        "11000000",
        "100001"
      ],
      [
        "00000111",
        "01000"
      ],
      [
        "0",
        "100"
      ],
      [
        "0",
        "100000"
      ],
      [
        "1",
        "010111"
      ],
      [
        "1",
        "01010111"
      ],
      [
        "00",
        "010111"
      ]
    ]
  }
}