{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "11": 7,
      "0100": 8,
      "1100": 9,
      "011": 10,
      "000": 11,
      "100100": 12,
      "000000": 13,
      "10001": 14,
      "10100": 15,
      "0111": 16,
      "1000000": 17,
      "001": 18,
      "0001": 19,
      "1000": 20,
      "00011": 21,
      "00010": 22,
      "000100": 23,
      "1001000": 24,
      "101": 25,
      "011100": 26,
      "01000": 27,
      "0110": 28,
      "000001": 29,
      "00000000": 30,
      "0100000": 31,
      "00000001": 32,
      "00000011": 33,
      "100010110": 34,
      "100000100": 35,
      "011000": 36,
      "1110001": 37,
      "100010111": 38,
      "1011": 39,
      "100001": 40,
      "111100": 41,
      "110000": 42,
      "0000000001000": 43,
      "001000": 44,
      "1001100": 45,
      "0101": 46,
      "11100": 47,
      "1111": 48,
      "0000001001000": 49,
      "10100000": 50,
      "11100010": 51,
      "1000100": 52,
      "010100": 53,
      "011000000": 54,
      "000011": 55,
      "110100": 56,
      "1100100": 57,
      "100100001": 58,
      "100100100001": 59,
      "10100100": 60,
      "10100000001": 61,
      "011101000": 62,
      "101100": 63,
      "0111000001": 64,
      "0000011001000": 65,
      "100000100001": 66,
      "001100": 67,
      "100011": 68,
      "10010100": 69,
      "10000000001": 70,
      "10000000011": 71,
      "010100000": 72,
      "0000011": 73,
      "0100001": 74,
      "11001": 75,
      "1100000": 76,
      "100100100011": 77,
      "0000001001100": 78,
      "100010": 79,
      "10100011101000": 80,
      "10100010100000": 81,
      "101100100001": 82,
      "0111000000": 83,
      "100000100011": 84,
      "10110100000": 85,
      "1111000100": 86,
      "11110011100010": 87,
      "110000100010": 88,
      "01010111": 89,
      "0110000000": 90,
      "11010010100000": 91,
      "10100100000": 92,
      "10": 93,
      "00100": 94,
      "00100100": 95,
      "00100100001": 96,
      "00011101000": 97,
      "10011": 98,
      "100000000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "1",
        "100"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "100",
        "100"
      ],
      [
        "0000",
        "00"
      ],
      [
        "100",
        "01"
      ],
      [
        "1",
        "0100"
      ],
      [
        "01",
        "11"
      ],
      [
        "100",
        "0000"
      ],
      [
        "00",
        "1"
      ],
      [
        "00",
        "01"
      ],
      [
        "100",
        "0"
      ],
      [
        "00",
        "011"
      ],
      [
        "0001",
        "0"
      ],
      [
        "00",
        "0100"
      ],
      [
        "100100",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "01",
        "1100"
      ],
      [
        "0100",
        "0"
      ],
      [
        "011",
        "0"
      ],
      [
        "0000",
        "01"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0100",
        "000"
      ],
      [
        "000000",
        "01"
      ],
      [
        "000000",
        "11"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "100",
        "000100"
      ],
      [
        "01",
        "1000"
      ],
      [
        "11",
        "10001"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "1",
        "011"
      ],
      [
        "100",
        "001"
      ],
      [
        "11",
        "1100"
      ],
      [
        "1100",
        "00"
      ],
      [
        "00000000",
        "01000"
      ],
      [
        "00",
        "1000"
      ],
      [
        "100",
        "1100"
      ],
      [
        "01",
        "01"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "11"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "10100",
        "000"
      ],
      [
        "1110001",
        "0"
      ],
      [
        "100",
        "0100"
      ],
      [
        "01",
        "0100"
      ],
      [
        "01",
        "1000000"
      ],
      [
        "0000",
        "11"
      ],
      [
        "11",
        "0100"
      ],
      [
        "1100",
        "100"
      ],
      [
        "100100",
        "001"
      ],
      [
        "100100",
        "100001"
      ],
      [
        "10100",
        "100"
      ],
      [
        "10100",
        "000001"
      ],
      [
        "0111",
        "01000"
      ],
      [
        "101",
        "100"
      ],
      [
        "011100",
        "0001"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "100000100",
        "001"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "011"
      ],
      [
        "100",
        "10100"
      ],
      [
        "100",
        "00000001"
      ],
      [
        "100",
        "00000011"
      ],
      [
        "01",
        "0100000"
      ],
      [
        "0000",
        "011"
      ],
      [
        "0100",
        "001"
      ],
      [
        "1100",
        "1"
      ],
      [
        "1100",
        "000"
      ],
      [
        "100100",
        "100011"
      ],
      [
        "000000",
        "1001100"
      ],
      [
        "10001",
        "0"
      ],
      [
        "10100",
        "011101000"
      ],
      [
        "10100",
        "010100000"
      ],
      [
        "101",
        "100100001"
      ],
      [
        "011100",
        "0000"
      ],
      [
        "100000100",
        "011"
      ],
      [
        "1011",
        "0100000"
      ],
      [
        "111100",
        "0100"
      ],
      [
        "111100",
        "11100010"
      ],
      [
        "110000",
        "100010"
      ],
      [
        "0101",
        "0111"
      ],
      [
        "011000000",
        "0"
      ],
      [
        "110100",
        "10100000"
      ],
      [
        "10100100",
        "000"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "100100"
      ],
      [
        "00",
        "100100001"
      ],
      [
        "00",
        "011101000"
      ],
      [
        "100",
        "11"
      ],
      [
        "100",
        "000000"
      ]
    ]
  }
}