{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "10000": 6,
      "11": 7,
      "1000000": 8,
      "1100": 9,
      "0001": 10,
      "0100": 11,
      "10": 12,
      "0000": 13,
      "0101": 14,
      "1000": 15,
      "110000": 16,
      "010": 17,
      "000": 18,
      "00010": 19,
      "101": 20,
      "000001": 21,
      "100000": 22,
      "1000101": 23,
      "011": 24,
      "000100": 25,
      "1001100": 26,
      "0111": 27,
      "00011": 28,
      "10100": 29,
      "110100": 30,
      "10000001": 31,
      "011100": 32,
      "101000000": 33,
      "10101": 34,
      "10000000": 35,
      "001000": 36,
      "11000011": 37,
      "100010111": 38,
      "100010110": 39,
      "11000000": 40,
      "1001000": 41,
      "1000111": 42,
      "1000001": 43,
      "1000011": 44,
      "10000010": 45,
      "10100000": 46,
      "000000": 47,
      "1100000": 48,
      "10100000000": 49,
      "10000010100000": 50,
      "10001": 51,
      "100001": 52,
      "10000000100": 53,
      "110010100": 54,
      "00000000": 55,
      "0000000": 56,
      "10110000000": 57,
      "00000111": 58,
      "0000011001100": 59,
      "0000011001000": 60,
      "10100000001": 61,
      "100011110": 62,
      "1010": 63,
      "100100": 64,
      "10010000": 65,
      "1000100": 66,
      "100010": 67,
      "100110100": 68,
      "011001100": 69,
      "0110000001": 70,
      "0110000000": 71,
      "0110100000": 72,
      "100001100": 73,
      "1111": 74,
      "1110": 75,
      "11011100": 76,
      "10000000001": 77,
      "100000000011": 78,
      "10000001100000": 79,
      "1100100": 80,
      "000101": 81,
      "01000": 82,
      "01000101": 83,
      "01000111": 84,
      "11000010100000": 85,
      "0101000000": 86,
      "1011100": 87,
      "0111000000": 88,
      "1101000": 89,
      "110100100001": 90,
      "101010111": 91,
      "0000001001100": 92,
      "10000000100010": 93,
      "110010100011": 94,
      "0000000001000": 95,
      "100110100011": 96,
      "01000001": 97,
      "01000011": 98,
      "110000001": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "10000",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "01"
      ],
      [
        "0",
        "100"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "00"
      ],
      [
        "01",
        "01"
      ],
      [
        "100",
        "0"
      ],
      [
        "1",
        "10000"
      ],
      [
        "01",
        "0"
      ],
      [
        "00",
        "0"
      ],
      [
        "0001",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "00",
        "0001"
      ],
      [
        "10000",
        "0"
      ],
      [
        "100",
        "0101"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "0100"
      ],
      [
        "100",
        "1100"
      ],
      [
        "01",
        "11"
      ],
      [
        "0001",
        "1"
      ],
      [
        "1",
        "0100"
      ],
      [
        "11",
        "0100"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "01",
        "1100"
      ],
      [
        "10",
        "1000000"
      ],
      [
        "1",
        "0101"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "00",
        "1000"
      ],
      [
        "110000",
        "11"
      ],
      [
        "1000101",
        "11"
      ],
      [
        "1000101",
        "10"
      ],
      [
        "1",
        "1000000"
      ],
      [
        "100",
        "1000"
      ],
      [
        "100",
        "0111"
      ],
      [
        "10000",
        "01"
      ],
      [
        "10000",
        "11"
      ],
      [
        "10000",
        "010"
      ],
      [
        "10",
        "100000"
      ],
      [
        "0000",
        "00"
      ],
      [
        "110000",
        "0"
      ],
      [
        "101000000",
        "00"
      ],
      [
        "10000010",
        "100000"
      ],
      [
        "100",
        "01"
      ],
      [
        "10000",
        "1"
      ],
      [
        "1000000",
        "0100"
      ],
      [
        "1100",
        "10100"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0000",
        "000"
      ],
      [
        "101",
        "10000000"
      ],
      [
        "000001",
        "11"
      ],
      [
        "000001",
        "1001100"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "101000000",
        "01"
      ],
      [
        "1000111",
        "10"
      ],
      [
        "1",
        "010"
      ],
      [
        "100",
        "100"
      ],
      [
        "100",
        "10000"
      ],
      [
        "100",
        "0100"
      ],
      [
        "100",
        "010"
      ],
      [
        "100",
        "110100"
      ],
      [
        "01",
        "1001100"
      ],
      [
        "01",
        "10000001"
      ],
      [
        "01",
        "10000000"
      ],
      [
        "01",
        "10100000"
      ],
      [
        "10000",
        "1100"
      ],
      [
        "11",
        "11"
      ],
      [
        "11",
        "10"
      ],
      [
        "11",
        "011100"
      ],
      [
        "1000000",
        "0001"
      ],
      [
        "1000000",
        "00011"
      ],
      [
        "1000000",
        "1100000"
      ],
      [
        "1100",
        "100"
      ],
      [
        "0001",
        "01"
      ],
      [
        "0100",
        "0"
      ],
      [
        "0100",
        "0101"
      ],
      [
        "0100",
        "0111"
      ],
      [
        "110000",
        "10100000"
      ],
      [
        "010",
        "1000000"
      ],
      [
        "101",
        "1100"
      ],
      [
        "011",
        "1000000"
      ],
      [
        "110100",
        "0"
      ],
      [
        "110100",
        "100001"
      ],
      [
        "10101",
        "0111"
      ],
      [
        "000000",
        "1001100"
      ],
      [
        "10000000100",
        "010"
      ],
      [
        "110010100",
        "011"
      ],
      [
        "00000000",
        "01000"
      ],
      [
        "100110100",
        "011"
      ],
      [
        "0",
        "1000001"
      ],
      [
        "0",
        "1000011"
      ],
      [
        "1",
        "10000001"
      ]
    ]
  }
}