{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "1100": 7,
      "0100": 8,
      "11": 9,
      "0001": 10,
      "0101": 11,
      "101": 12,
      "1000000": 13,
      "000100": 14,
      "000": 15,
      "00100": 16,
      "11100": 17,
      "1000101": 18,
      "00010": 19,
      "1000": 20,
      "0111": 21,
      "11000000": 22,
      "001": 23,
      "001100": 24,
      "00011": 25,
      "10100": 26,
      "00000101": 27,
      "110100": 28,
      "10": 29,
      "1001100": 30,
      "011": 31,
      "000000": 32,
      "101100": 33,
      "1011100": 34,
      "100010111": 35,
      "1000100": 36,
      "000101": 37,
      "0011000100": 38,
      "100000100": 39,
      "000000100": 40,
      "1110001": 41,
      "100010110": 42,
      "1000111": 43,
      "00001": 44,
      "00000100": 45,
      "00000111": 46,
      "10000001": 47,
      "11000000100": 48,
      "100000100001": 49,
      "10101": 50,
      "0011100": 51,
      "100100": 52,
      "000011": 53,
      "11000011100": 54,
      "01000101": 55,
      "100000000001": 56,
      "0010000100": 57,
      "00000011": 58,
      "0000001011100": 59,
      "0000001001100": 60,
      "100011111": 61,
      "00101": 62,
      "10011": 63,
      "10010000001": 64,
      "011100": 65,
      "0111000000": 66,
      "000000000100": 67,
      "110001": 68,
      "1100000": 69,
      "1101": 70,
      "1110101": 71,
      "10110000001": 72,
      "0001001011100": 73,
      "001000": 74,
      "11100011": 75,
      "110000000001": 76,
      "10100000": 77,
      "1101001110001": 78,
      "110100000011": 79,
      "1101001110101": 80,
      "10011000001": 81,
      "10110000100": 82,
      "10110010100000": 83,
      "0001011001100": 84,
      "0000001001000": 85,
      "11000000100000": 86,
      "11000011100001": 87,
      "100110111": 88,
      "0000000001000": 89,
      "11010011100010": 90,
      "100101": 91,
      "1001000000": 92,
      "100001": 93,
      "100110100": 94,
      "010100": 95,
      "0101000101": 96,
      "00000": 97,
      "000001": 98,
      "00000000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "0",
        "100"
      ],
      [
        "1",
        "1"
      ],
      [
        "00",
        "01"
      ],
      [
        "01",
        "01"
      ],
      [
        "1",
        "01"
      ],
      [
        "100",
        "0000"
      ],
      [
        "00",
        "0100"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "100"
      ],
      [
        "1",
        "1100"
      ],
      [
        "100",
        "0101"
      ],
      [
        "0001",
        "0"
      ],
      [
        "100",
        "0"
      ],
      [
        "01",
        "11"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "00",
        "1"
      ],
      [
        "00",
        "1100"
      ],
      [
        "0001",
        "1"
      ],
      [
        "1",
        "0100"
      ],
      [
        "0000",
        "0101"
      ],
      [
        "11",
        "0100"
      ],
      [
        "1",
        "0"
      ],
      [
        "100",
        "1100"
      ],
      [
        "01",
        "1"
      ],
      [
        "0000",
        "00"
      ],
      [
        "101",
        "100"
      ],
      [
        "101",
        "1100"
      ],
      [
        "1000101",
        "11"
      ],
      [
        "100",
        "0100"
      ],
      [
        "0001",
        "01"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "100",
        "000100"
      ],
      [
        "0000",
        "00100"
      ],
      [
        "11100",
        "01"
      ],
      [
        "1000101",
        "10"
      ],
      [
        "100",
        "0111"
      ],
      [
        "0000",
        "1"
      ],
      [
        "0000",
        "0100"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "11000000",
        "100"
      ],
      [
        "100000100",
        "001"
      ],
      [
        "1",
        "0101"
      ],
      [
        "00",
        "11100"
      ],
      [
        "100",
        "100"
      ],
      [
        "0000",
        "11"
      ],
      [
        "1100",
        "0011100"
      ],
      [
        "0100",
        "0101"
      ],
      [
        "1000000",
        "00001"
      ],
      [
        "00100",
        "00100"
      ],
      [
        "000000",
        "11"
      ],
      [
        "000000",
        "1011100"
      ],
      [
        "000000100",
        "1100"
      ],
      [
        "1000111",
        "11"
      ],
      [
        "00",
        "101"
      ],
      [
        "100",
        "11"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "01",
        "1100"
      ],
      [
        "01",
        "11000000"
      ],
      [
        "0000",
        "00000100"
      ],
      [
        "1100",
        "01"
      ],
      [
        "1100",
        "000"
      ],
      [
        "11",
        "01"
      ],
      [
        "11",
        "10101"
      ],
      [
        "101",
        "10000001"
      ],
      [
        "000100",
        "1011100"
      ],
      [
        "00100",
        "0"
      ],
      [
        "11100",
        "011"
      ],
      [
        "11000000",
        "0001"
      ],
      [
        "10100",
        "000"
      ],
      [
        "110100",
        "1110001"
      ],
      [
        "110100",
        "000011"
      ],
      [
        "110100",
        "1110101"
      ],
      [
        "1001100",
        "0001"
      ],
      [
        "101100",
        "00100"
      ],
      [
        "101100",
        "10100000"
      ],
      [
        "000101",
        "1001100"
      ],
      [
        "000000100",
        "1000"
      ],
      [
        "11000000100",
        "000"
      ],
      [
        "11000011100",
        "001"
      ],
      [
        "10011",
        "0111"
      ],
      [
        "000000000100",
        "0"
      ],
      [
        "1101001110001",
        "0"
      ],
      [
        "100",
        "101"
      ],
      [
        "100",
        "1000000"
      ],
      [
        "100",
        "001"
      ],
      [
        "100",
        "110100"
      ],
      [
        "01",
        "0100"
      ],
      [
        "01",
        "01000101"
      ],
      [
        "0000",
        "0"
      ],
      [
        "0000",
        "01"
      ],
      [
        "0000",
        "0000"
      ]
    ]
  }
}