{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "001": 6,
      "011": 7,
      "0000": 8,
      "1001": 9,
      "10000": 10,
      "1000": 11,
      "0011": 12,
      "010": 13,
      "0011000": 14,
      "01100": 15,
      "10000011": 16,
      "0001": 17,
      "00011": 18,
      "100011": 19,
      "0011000100": 20,
      "1000000": 21,
      "10011": 22,
      "000": 23,
      "0010": 24,
      "101": 25,
      "100100": 26,
      "00110000011": 27,
      "00000011": 28,
      "0010000": 29,
      "000011000": 30,
      "1000010": 31,
      "1011": 32,
      "100010": 33,
      "01010": 34,
      "100000": 35,
      "0011100": 36,
      "01000": 37,
      "01011": 38,
      "001000001100": 39,
      "001000000": 40,
      "00001001": 41,
      "00000001": 42,
      "000100": 43,
      "001000000100": 44,
      "10": 45,
      "00110000": 46,
      "000010000": 47,
      "000010011": 48,
      "01100011": 49,
      "1000110": 50,
      "100110": 51,
      "00110000001": 52,
      "00100": 53,
      "00010": 54,
      "00100011": 55,
      "0011000110": 56,
      "0000010": 57,
      "1000100": 58,
      "0011101": 59,
      "000110": 60,
      "000111001": 61,
      "00111000011": 62,
      "0000100101011": 63,
      "0000100111011": 64,
      "0100": 65,
      "01001": 66,
      "1100011": 67,
      "00001": 68,
      "001000": 69,
      "000010": 70,
      "000011101": 71,
      "011001": 72,
      "01101": 73,
      "0000100": 74,
      "1001100": 75,
      "00111100011": 76,
      "01100100": 77,
      "01100001": 78,
      "000111000": 79,
      "10010001100100": 80,
      "0010000100": 81,
      "101110": 82,
      "00000001100110": 83,
      "0000000101101": 84,
      "001000011100": 85,
      "001000100100": 86,
      "010000011": 87,
      "0100011": 88,
      "010011": 89,
      "0100000": 90,
      "11": 91,
      "1100": 92,
      "1101": 93,
      "1100010": 94,
      "1100000": 95,
      "101100011": 96,
      "001001": 97,
      "000011100": 98,
      "100100011": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "1"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "100",
        "0"
      ],
      [
        "001",
        "1"
      ],
      [
        "01",
        "0"
      ],
      [
        "001",
        "1000"
      ],
      [
        "01",
        "100"
      ],
      [
        "10000",
        "011"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "011"
      ],
      [
        "100",
        "011"
      ],
      [
        "0011000",
        "100"
      ],
      [
        "100",
        "0000"
      ],
      [
        "1001",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "001",
        "0"
      ],
      [
        "1",
        "01"
      ],
      [
        "100",
        "100"
      ],
      [
        "001",
        "10000011"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "00",
        "10000"
      ],
      [
        "00",
        "0011000"
      ],
      [
        "100",
        "0010"
      ],
      [
        "1",
        "011"
      ],
      [
        "100",
        "010"
      ],
      [
        "01",
        "010"
      ],
      [
        "10000",
        "0"
      ],
      [
        "0011",
        "100"
      ],
      [
        "0",
        "1000"
      ],
      [
        "01",
        "011"
      ],
      [
        "0010000",
        "01100"
      ],
      [
        "00",
        "1000000"
      ],
      [
        "0000",
        "1001"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "000",
        "100"
      ],
      [
        "001000000",
        "100"
      ],
      [
        "1",
        "0"
      ],
      [
        "001",
        "10000"
      ],
      [
        "0000",
        "10000"
      ],
      [
        "0000",
        "10011"
      ],
      [
        "01100",
        "011"
      ],
      [
        "100011",
        "0"
      ],
      [
        "10011",
        "0"
      ],
      [
        "00110000",
        "001"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "010"
      ],
      [
        "00",
        "100011"
      ],
      [
        "001",
        "1000110"
      ],
      [
        "0000",
        "010"
      ],
      [
        "1000",
        "100"
      ],
      [
        "0011",
        "101"
      ],
      [
        "00011",
        "0"
      ],
      [
        "00011",
        "1001"
      ],
      [
        "0011100",
        "0011"
      ],
      [
        "00001001",
        "01011"
      ],
      [
        "000010011",
        "1011"
      ],
      [
        "0",
        "100"
      ],
      [
        "0",
        "1001"
      ],
      [
        "1",
        "100011"
      ],
      [
        "00",
        "001"
      ],
      [
        "00",
        "1000"
      ],
      [
        "00",
        "0010"
      ],
      [
        "00",
        "0011101"
      ],
      [
        "01",
        "1001"
      ],
      [
        "011",
        "01"
      ],
      [
        "0000",
        "100"
      ],
      [
        "1001",
        "100"
      ],
      [
        "0011",
        "1100011"
      ],
      [
        "01100",
        "100"
      ],
      [
        "01100",
        "001"
      ],
      [
        "00011",
        "1000"
      ],
      [
        "100100",
        "01100100"
      ],
      [
        "0010000",
        "100"
      ],
      [
        "1011",
        "10"
      ],
      [
        "00000001",
        "100110"
      ],
      [
        "00000001",
        "01101"
      ],
      [
        "00100",
        "0011100"
      ],
      [
        "001000",
        "100100"
      ],
      [
        "0",
        "10000011"
      ],
      [
        "0",
        "100011"
      ],
      [
        "0",
        "10011"
      ],
      [
        "0",
        "100000"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "100"
      ],
      [
        "1",
        "101"
      ],
      [
        "1",
        "100010"
      ],
      [
        "1",
        "100000"
      ],
      [
        "1",
        "01100011"
      ],
      [
        "00",
        "1001"
      ],
      [
        "00",
        "0011100"
      ],
      [
        "100",
        "100011"
      ]
    ]
  }
}