{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "11": 7,
      "10000": 8,
      "1100": 9,
      "0100": 10,
      "011": 11,
      "1000": 12,
      "100000": 13,
      "1000000": 14,
      "0111": 15,
      "000000": 16,
      "010": 17,
      "10001": 18,
      "101": 19,
      "100001": 20,
      "000": 21,
      "00011": 22,
      "1001000": 23,
      "0110": 24,
      "00010": 25,
      "10000000": 26,
      "010100": 27,
      "000001": 28,
      "0000001001000": 29,
      "10100": 30,
      "00000001": 31,
      "100010110": 32,
      "1100000": 33,
      "001000": 34,
      "10011": 35,
      "011000": 36,
      "00000111": 37,
      "010000": 38,
      "001100": 39,
      "100100": 40,
      "111100": 41,
      "100010111": 42,
      "10111": 43,
      "1111": 44,
      "10000011": 45,
      "100000001": 46,
      "00000011": 47,
      "10000000100000": 48,
      "0000011001000": 49,
      "1010000": 50,
      "1001100": 51,
      "00000100": 52,
      "1110100": 53,
      "10000100": 54,
      "10000010100": 55,
      "0100011": 56,
      "100000100001": 57,
      "10000000100": 58,
      "00000101": 59,
      "100100100001": 60,
      "11110011": 61,
      "10000011100000": 62,
      "10": 63,
      "10110": 64,
      "1000111": 65,
      "100010": 66,
      "100100000001": 67,
      "01100": 68,
      "011100": 69,
      "00001": 70,
      "1110000000": 71,
      "1110000100": 72,
      "11100010": 73,
      "110010111": 74,
      "10000001": 75,
      "1011100": 76,
      "1010100": 77,
      "10110000000": 78,
      "1000010": 79,
      "0001010000": 80,
      "0101000100": 81,
      "100110111": 82,
      "0011000100": 83,
      "10111100000": 84,
      "0000001101100": 85,
      "1010000100": 86,
      "10000010100010": 87,
      "11110011100000": 88,
      "100011111": 89,
      "0100000": 90,
      "110000": 91,
      "1010": 92,
      "0010000": 93,
      "000100": 94,
      "0010011": 95,
      "001001100": 96,
      "100100001": 97,
      "10010000001": 98,
      "0110000000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "100",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "0",
        "100"
      ],
      [
        "01",
        "1"
      ],
      [
        "100",
        "0"
      ],
      [
        "10000",
        "0"
      ],
      [
        "100",
        "0000"
      ],
      [
        "01",
        "11"
      ],
      [
        "0000",
        "00"
      ],
      [
        "01",
        "0"
      ],
      [
        "100",
        "01"
      ],
      [
        "1",
        "01"
      ],
      [
        "10000",
        "1"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "011"
      ],
      [
        "100",
        "1000"
      ],
      [
        "011",
        "0"
      ],
      [
        "00",
        "010"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "01",
        "0100"
      ],
      [
        "0000",
        "01"
      ],
      [
        "000000",
        "1001000"
      ],
      [
        "1",
        "0100"
      ],
      [
        "000000",
        "01"
      ],
      [
        "10001",
        "0110"
      ],
      [
        "1",
        "100000"
      ],
      [
        "00",
        "1000"
      ],
      [
        "100",
        "11"
      ],
      [
        "01",
        "1000"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "0",
        "10000"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "100"
      ],
      [
        "11",
        "1100"
      ],
      [
        "10001",
        "0111"
      ],
      [
        "1",
        "0111"
      ],
      [
        "11",
        "11"
      ],
      [
        "10000",
        "011"
      ],
      [
        "1000000",
        "01"
      ],
      [
        "000000",
        "11"
      ],
      [
        "10000000",
        "100000"
      ],
      [
        "000001",
        "1001000"
      ],
      [
        "1",
        "010000"
      ],
      [
        "100",
        "1100"
      ],
      [
        "0000",
        "0100"
      ],
      [
        "11",
        "10100"
      ],
      [
        "10000",
        "100"
      ],
      [
        "10000",
        "010100"
      ],
      [
        "0100",
        "011"
      ],
      [
        "100000",
        "100001"
      ],
      [
        "1000000",
        "0100"
      ],
      [
        "000001",
        "01"
      ],
      [
        "100100",
        "100001"
      ],
      [
        "111100",
        "11"
      ],
      [
        "10000011",
        "100000"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "0110"
      ],
      [
        "100",
        "0111"
      ],
      [
        "100",
        "010"
      ],
      [
        "100",
        "100000001"
      ],
      [
        "01",
        "100"
      ],
      [
        "01",
        "1100"
      ],
      [
        "0000",
        "1"
      ],
      [
        "11",
        "10000000"
      ],
      [
        "11",
        "10000100"
      ],
      [
        "11",
        "100010"
      ],
      [
        "1100",
        "10111"
      ],
      [
        "1000000",
        "1"
      ],
      [
        "101",
        "1100"
      ],
      [
        "101",
        "0100"
      ],
      [
        "101",
        "10000000"
      ],
      [
        "100001",
        "0"
      ],
      [
        "00010",
        "10000"
      ],
      [
        "010100",
        "0100"
      ],
      [
        "10011",
        "0111"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "10111",
        "100000"
      ],
      [
        "00000011",
        "01100"
      ],
      [
        "1010000",
        "100"
      ],
      [
        "10000010100",
        "010"
      ],
      [
        "11110011",
        "100000"
      ],
      [
        "1000111",
        "11"
      ],
      [
        "0",
        "100000"
      ],
      [
        "1",
        "10000"
      ],
      [
        "1",
        "010"
      ],
      [
        "00",
        "10000"
      ],
      [
        "00",
        "0100"
      ],
      [
        "00",
        "10011"
      ],
      [
        "00",
        "1001100"
      ],
      [
        "100",
        "100001"
      ],
      [
        "100",
        "10000001"
      ],
      [
        "01",
        "10000000"
      ]
    ]
  }
}