{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      ",": 0,
      "0": 1,
      "1": 2,
      "00": 3,
      "100": 4,
      "01": 5,
      "0000": 6,
      "11": 7,
      "1100": 8,
      "011": 9,
      "0100": 10,
      "01100": 11,
      "000": 12,
      "00100": 13,
      "0011": 14,
      "001100": 15,
      "1001": 16,
      "010": 17,
      "0000100": 18,
      "001": 19,
      "0001": 20,
      "00011": 21,
      "0001100": 22,
      "0011000100": 23,
      "00001": 24,
      "00000011": 25,
      "11000": 26,
      "111": 27,
      "001000000100": 28,
      "101": 29,
      "10011": 30,
      "00010": 31,
      "1000000": 32,
      "1000100": 33,
      "100001": 34,
      "11100": 35,
      "01001": 36,
      "1000010": 37,
      "1001100": 38,
      "100000": 39,
      "01011": 40,
      "000011000": 41,
      "00110000011": 42,
      "00110000001": 43,
      "100110": 44,
      "101100": 45,
      "000100": 46,
      "100010": 47,
      "0101100": 48,
      "0000000": 49,
      "00000001": 50,
      "1100011": 51,
      "0110": 52,
      "01000": 53,
      "01100011": 54,
      "0010000100": 55,
      "01010": 56,
      "000011100": 57,
      "1100100": 58,
      "0011100": 59,
      "00111100011": 60,
      "10010": 61,
      "000111000": 62,
      "000010": 63,
      "111011": 64,
      "0000000101001": 65,
      "10100": 66,
      "10000011": 67,
      "1000110": 68,
      "0101001": 69,
      "00000000": 70,
      "00001100": 71,
      "00000001100": 72,
      "11011": 73,
      "111001": 74,
      "1100000": 75,
      "010001": 76,
      "01000001": 77,
      "011000000100": 78,
      "0011000110": 79,
      "000010000": 80,
      "0000100111001": 81,
      "0001100111011": 82,
      "00011001100000": 83,
      "111010": 84,
      "1011100": 85,
      "11100011": 86,
      "1001100000": 87,
      "1011000100": 88,
      "0001000101001": 89,
      "01011001000000": 90,
      "00111000011": 91,
      "0000000001011": 92,
      "000011001": 93,
      "0000000110011": 94,
      "01000001111010": 95,
      "100100": 96,
      "0101": 97,
      "01010001": 98,
      "00000": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "00"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "100"
      ],
      [
        "01",
        "1"
      ],
      [
        "0",
        "100"
      ],
      [
        "01",
        "100"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "100"
      ],
      [
        "00",
        "11"
      ],
      [
        "00",
        "1100"
      ],
      [
        "100",
        "1"
      ],
      [
        "01",
        "0"
      ],
      [
        "0000",
        "100"
      ],
      [
        "00",
        "1"
      ],
      [
        "00",
        "01"
      ],
      [
        "00",
        "011"
      ],
      [
        "00",
        "01100"
      ],
      [
        "001100",
        "0100"
      ],
      [
        "0000",
        "1"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "1100",
        "0"
      ],
      [
        "11",
        "1"
      ],
      [
        "00100",
        "0000100"
      ],
      [
        "1",
        "01"
      ],
      [
        "100",
        "11"
      ],
      [
        "00",
        "010"
      ],
      [
        "100",
        "0000"
      ],
      [
        "100",
        "0100"
      ],
      [
        "100",
        "001"
      ],
      [
        "11",
        "100"
      ],
      [
        "0100",
        "1"
      ],
      [
        "100001",
        "0"
      ],
      [
        "100",
        "1100"
      ],
      [
        "100",
        "000"
      ],
      [
        "01",
        "011"
      ],
      [
        "0000",
        "11000"
      ],
      [
        "001100",
        "00011"
      ],
      [
        "001100",
        "00001"
      ],
      [
        "10011",
        "0"
      ],
      [
        "1",
        "01100"
      ],
      [
        "00",
        "0100"
      ],
      [
        "100",
        "010"
      ],
      [
        "01",
        "01100"
      ],
      [
        "0000",
        "000"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "1100",
        "011"
      ],
      [
        "011",
        "0"
      ],
      [
        "0100",
        "0"
      ],
      [
        "01100",
        "011"
      ],
      [
        "00100",
        "00100"
      ],
      [
        "01",
        "010"
      ],
      [
        "0000",
        "11100"
      ],
      [
        "1100",
        "100"
      ],
      [
        "0011",
        "100"
      ],
      [
        "0011",
        "1100011"
      ],
      [
        "1001",
        "0"
      ],
      [
        "0001",
        "11000"
      ],
      [
        "00001",
        "0"
      ],
      [
        "111",
        "011"
      ],
      [
        "00000001",
        "01001"
      ],
      [
        "1",
        "0100"
      ],
      [
        "100",
        "00011"
      ],
      [
        "100",
        "0110"
      ],
      [
        "01",
        "01001"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0000",
        "1100"
      ],
      [
        "0000",
        "0001100"
      ],
      [
        "11",
        "011"
      ],
      [
        "11",
        "1001"
      ],
      [
        "1100",
        "000"
      ],
      [
        "0100",
        "01"
      ],
      [
        "0100",
        "0001"
      ],
      [
        "01100",
        "0000100"
      ],
      [
        "001100",
        "0110"
      ],
      [
        "0000100",
        "00"
      ],
      [
        "0000100",
        "111001"
      ],
      [
        "0001100",
        "111011"
      ],
      [
        "0001100",
        "1100000"
      ],
      [
        "111",
        "010"
      ],
      [
        "101",
        "1100"
      ],
      [
        "11100",
        "011"
      ],
      [
        "1001100",
        "000"
      ],
      [
        "101100",
        "0100"
      ],
      [
        "000100",
        "0101001"
      ],
      [
        "0101100",
        "1000000"
      ],
      [
        "0011100",
        "0011"
      ],
      [
        "00000000",
        "01011"
      ],
      [
        "00001100",
        "1"
      ],
      [
        "00000001100",
        "11"
      ],
      [
        "01000001",
        "111010"
      ],
      [
        "100",
        "100"
      ],
      [
        "01",
        "01"
      ],
      [
        "01",
        "010001"
      ],
      [
        "0000",
        "0"
      ]
    ]
  }
}